{"business_units": [{"scrapping_website_name": "Bluehost", "scrapping_website_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "response": [{"business_item_data": {"business_type": "Service", "absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "category": "Hosting Service", "name": "Bluehost-Hosting Service", "sub_category": "", "picture_urls": [], "original_price": "", "sale_price": "", "availability": "", "specifications": [], "website_name": "Bluehost", "description": ""}, "reviews": [{"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Charles Bernard", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            Globally, I was very satisfied with Bluehost. Support: So far, I have not seen such a great customer support. People on lie support were very helpful even though I'm a beginner, and they gave me basic advice on what I should accomplish even when I decided to change host (reasons later).\nUptime and speed: I did not notice any issue with this aspect of hosting. My website isn't a behemoth, though, so I can't testify so much on that part. Value: As a renewing customer, I was a bit disappointed by the price they offered me for a 3 years hosting.\nI was seeing better offers elsewhere (and even for Bluehost NEW customers) so I decided to leave. The customer support did try to find a way to keep me, but it was not enough. Globally, if you're ok with the price, go all in. They're great!\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Patrick Eason", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            I've been a BlueHost subscriber for the past 3 years and have had an excellent experience through them. When I first subscribed it was a matter of pricing->feature value, but the cPanel experience was weak and the upgrade process was hit and miss. Over the past three years BlueHost has resolved any issues I had with them.\nThey're cPanel is greatly improved, they're feature set is much broader with few limitations, and with their new reseller account options I can host clients without any of the problems I used to run in to. BlueHost's cPanel in particular is where the best value comes. When I started my subscription with them I was less than savvy about many things relating to hosting or marketing or anything else that would otherwise lead to solid web presence.\nThere are many included tools and promotions that BlueHost provides with the subscription that put me on the right track and led to more opportunities as I matured. Technical expertise is not a requirement as BlueHost has most of those tools available to you, but there is still enough flexibility for more savvy developers to get their hands dirty. The only one quorum I have is a lack of root level access, but that isn't a dealbreaker for myself personally.\nOverall I'd consider BlueHost as one of my favorite webhosts. There are others I've tried, but BlueHost has been the most reliable and their customer service team has always been quick and knowledgeable. For those who want a simple but reliable experience then BlueHost is the way to go; those who want complete control over their experience may not like how BlueHost does things.\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "3", "review_title": null, "reviewed_at": null, "reviewer_name": "Abby  Brown", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            Bluehost support is bad. Yes you have live chat but it's entirely outsourced to third-world countries and they are painfully slow at replying. As well, I upgraded from shared hosting package to cloud hosting and they did something wrong in the transition and my website went down.\nI then had to create a ticket and it took 4 days to get an update on the ticket. As well, in terms of page speed, the \"Server response time\" is always above 1 second, which is way above the Google Page Speed recommended limit of 300ms, and this is with cloud hosting which is supposed to be fast. All in all, if you haven't chosen yet, don't choose bluehost.\nThe only reason I'm still with them right now is because it would be a pain the *** to move all my sites and contact with no downtime or seo hit. Stay away\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Kashish Kumawat", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            Hi,\nI have been using BlueHost for my Wordpress Site for the past two months. Earlier I was using NameCheap hosting and now I feel glad that I switched. Currently, I'm using the Basic Shared Hosting plan.\nBlueHost's shared hosting is not only fast but reliable with good customer support. I am also using the Cloudflare CDN which BlueHost and it has really improved the site's loading speed.So far, my site has been down only for once and that was just a few days after I switched to BlueHost. However, their customer support was fast in responding to my issue and they got it resolved within half an hour.\nSince then, I haven't faced any issues with my site. Another good thing about BlueHost is their Control Panel. It is easy to use and user-friendly.\nBluehost's control panel also provides additional services like SEO based services and CloudFlare integration. I'll definitely upgrade to better plans at Bluehost once my website begins to generate more traffic. For small site owners and bloggers, I'll definitely recommend BlueHost for their excellent services. \n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "1", "review_title": null, "reviewed_at": null, "reviewer_name": "Andres  Perez", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            In the past it was a good hosting provider, but now it is a shame the low quality of service, the lack of knowledge of the support staff and do not refund your money when you decide to leave. I've been trying for weeks to get back more than 500 USD and they do not, it's a shame and a shame\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "1.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Peter Schmidt", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            This support is the worst ever! Support people don't even know their own system and don't want to help! Anything you ask from them they are not able to answer or they want to charge for everything.\nI would not use them ever! They are useless.... Never use them! Stay away from them!\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "3.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Dmytro Yaroshenko", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            We bought a shared hosting for 3 years, the biggest mistake of my life. Value per money is the worst thing. Support was loading hours everytime I wanted to fix something.\nLeaving from this hosting after 1 year, I know there is no refund policy for the rest of the 2 years it's lost money, but I hope people who read this feedback won't choose this company. Search before you choose.  \n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "2", "review_title": null, "reviewed_at": null, "reviewer_name": "Brian Vatcher", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            I have been with Bluehost for several years. I always give their support team kudos. However, in the past year, their email is getting worse and worse.\nTheir servers are black listed and they don't do anything about it. They respond with \"Try sending it again in an an hour when the servers rotate.\" This affects everyone in my business. We are working and with this kind of terrible service, we never know if your email goes through to a client or customer.\nTheir excuse is that email servers are shared so things like this happen. When I point out that email has been this way since before AOL and companies like AOL, gmail and others seem to deliver email just fine, the rep always seems to finally admit the senior management at Bluehost is not funding email support to force people to buy paid email services. IMO, email is a cost-of-doing-business type of feature.\nMeaning if I buy a car, a steering wheel is a cost-of-doing-business feature. I have a car (Bluehost) and it used to have steering wheel one hundred percent of the time. Now, the steering wheel is only there 70 of the time while I am driving.\nI then call the service department, they tell me it's not a safety risk. I should keep the car but get an Uber (Paid Gmail) to be able to get to work every day for reliability and safety. My answer is no thanks.\nI just get any other car on the market, even one like GoDaddy which I hate, and get a working steering wheel. It reminds me of the old Lily Tomlin skit about the phone company. She would always say, We don't care.\nWe don't have to. We're the phone company. At least with hosting companies, there are many options.\nIt was nice while it lasted Bluehost. I have been patient trying to let you get your act together. Good luck. \n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "5", "review_title": null, "reviewed_at": null, "reviewer_name": "Mike Otis", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            Bluehost hosting service is the best service provider out there. If you do a search for web hosting providers they come up number one in each category and there is a reason for it. They are available 24 hours a day and money back guarantee was one of the reasons I picked them. I own a web development business named Cyber-Farms and the up time is critical.\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "2.5", "review_title": null, "reviewed_at": null, "reviewer_name": "jan deruiter", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            I spent 139 (!) minutes on the phone yesterday trying to get them to map a domain to a subdirectory in our public_html directory. Something trivial that you can do yourself with other hosts like Dreamhost, mediatemple, pair, and so on. In the first few minutes, they messed up the existing path and then spent more than 2 hours telling me this is not possible and ended up leaving me having to migrate my site to the root on the server (where a dated site was located I had been trying to preserve).\nI have worked with dozens (100's?) of hosts since I started web dev in 1996. This was THE worst I have experienced. Luckily I only have 3 clients with these ppl. Unreal.\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4", "review_title": null, "reviewed_at": null, "reviewer_name": "Troy Thiessen", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            I purchased a 3 year hosting plan from BlueHost on a Saturday. They assigned me a temporary domain name which support told me would last from 25 minutes to 5 hours. During this time I was able to access Wordpress and start putting the page for my blog together.\nAfter 5 hours I contacted BlueHost live chat to ask how long it would take for my domain name to become active. The person on chat never seemed to understand my problem. I even copied and pasted the error message from their site that explained the situation but to no avail.\nI couldn't see how my blog looked or access email while the domain remained with a temporary address. On Sunday I tried 2 more times with live chat but couldn't get my problem resolved. I tried again on Monday and after chatting for a few minutes I realized that I wasn't going to have my problem resolved and asked for a refund.\nThe person took my information and said that I would be getting my refund. The refund hadn't been posted to my credit card account on Tuesday so I called customer support and talked to a person who understood my original problem and offered to solve it. I said no, I would just like to get my refund.\nThey told me that I wouldn't be getting the refund for my domain name purchase because the person who was processing the refund on Monday didn't complete the process and it had been more than 3 days since I had purchased the domain name and they would only refund that purchase during the first 3 days. (By the way, Tuesday was 3 days after Saturday) I received an email detailing my refund (less the price paid for the domain name) on Tuesday but it hadn't been posted to my credit card on Wednesday. I filed a claim with the credit card company and they have issued me a provisional credit. I know that stuff happens but when a problem is brought to the attention of a support person the problem should be worked on.\nThe live chat people should have been able to solve my problem or pushed it up to someone who could. If you use BlueHost I would recommend that you use their phone support instead of live chat for even the most simple problems.\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4", "review_title": null, "reviewed_at": null, "reviewer_name": "Jen Braaksma", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            Well, overall I think the service is okay. I am an English teacher and I use Bluehost for my blog about writing. I use their WordPress hosting service and I am satisfied with the service, although there are some flaws.\nPros:\n-Easy setup\n-Very good uptime (all the time)\n-Good speed\nCons:\n-Support is not great\n-The price is higher than other hosting\nDuring my last semester of teaching I was approached by one of my students who said he could optimize my site and get many more readers quickly, but found some security flaws in the site which should be fixed first. He offered to fix it himself for free, but first I contacted support. They did not do much and claimed the site was in good standing with security.\nThey have their own \"intrusion detection/prevention system\" which stops their service from getting hacked, but I found out it doesn't actually protect my website. I reluctantly let the student fix my site after giving him my account details and he managed to find all kinds of flaws from the inside as well. He fixed most of them within a couple of days, from bad configuration, bad plugins, and hiding my personal email/account.\nI'm not very good with this kind of stuff but was astonished by how much the student was able to do that BlueHost was not able to do. The student also showed me that there were much cheaper hosting plans I could have gotten, and sure enough he was right, so I don't think the value is great for this host. Other than all that, the first setup of the website was really easy, only a few clicks and it was ready. Everything went smoothly and although the site isn't super fast, it is up 100% of the time (or very close, I don't know what happens when I'm not on it.)\nOverall I give this host somewhere between 3/4 stars.\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Mohan Polydath", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            I wanted to setup my company website, after comparing and reading reviews of many webhost, I finally found BlueHost, believe me I had the best experience with bluehost, their cpanel have all the features and helped me a lot to setup my website in just a single day, I found the web hosting price in my budget, I would really recommend bluehost for any web hosting needs.\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Saikat Ghosh", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            Bluehost has a very nice list of features, and the best of them being the 'Unlimited Bandwidth\" in a very low cost, cheaper than many others as of the quality of service that Bluehost provides, but what I don't like about the host is that they have a good customer service but some of their employees keep turning rude at some moments!\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Danish Ali", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            I'm using BlueHost Since last 2 to 3 Years, I found BlueHost to be reliable and customer friendly hosting service. Their 24/7 customer support is among the best.That’s why I love this Hosting Platform, and they give all time Something Amazing Like 150$ foAdvertisingnt oAdWordsds. I'm Happy and Feel always Free about my Hosting Issues. I'm using their Shared hosting Plan and Get Everything Unlimited.\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Deepjyoti Barman", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            This is best hosting company for law budget customer with Indian perspective. It delivers budget plans with offer on the occasion of the Independence day. It has a variety of CMS within the server.\nIt helps to make a good website within a minute. Good security with Linux based server. I give them 4.6 out of 5. \n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "2", "review_title": null, "reviewed_at": null, "reviewer_name": "Alian nadeem", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            I registered my domain on Bluehost. I chose a monthly package which I think should deduct approx $10 monthly. I made sure that everything is good to go.\nSo when they processed my order, it showed that I selected an yearly package and they deducted $120 from my account. I contacted their support and they were not admitting at first after I showed them screenshot of my order, They agreed to give me my refund but they agreed to give only $60 so I decided to use the hosting. \n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "5", "review_title": null, "reviewed_at": null, "reviewer_name": "Asad Khan", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            I have been using Bluehost for almost a year or so, it was so tough for me, to get started my blogging career with hosting issues. I was using a local hosting company before, with no support and which was in the dark. I don't know, what other reliable option available out there, but I was left alone, although the company was closed because of their problems.\nBluehost packages are so accurate that they're made by, keeping the exact requirements of a site owner, in mind. They are very optimized regarding pricing, features, and security. They know and they've best and exact solution at the correct time.\nI would recommend others for this particular hosting. I love them, until they continue their hard work and I 'll use them.\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "3.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Neil Haffey", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            Very disappointed in the level of support I received to resolve an SSL certificate renewal. The wildcard SSL in question was set to auto-renew but is was not being applied. Customers to my website were receiving an insecure error.\nBluehost support's solution was to just wait it will apply eventually. Sounded like they didn't really know what was happening. So I waited 5 hours.\nStill no new SSL cert. I called again. This time they said it was Comodo's fault and told me to call Comodo even though the SSL cert was automatically purchased on Bluehost site.\nWhen I called Comodo they said they needed the Comodo order number. Well, I don't have the comodo order number because I purchase the SSL cert on Bluehost's site. Been on hold now for 25 minutes with Bluehost to try and get the Comodo order number because it was not on my Bluehost invoice for the SSL cert. Uggggg........\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "1", "review_title": null, "reviewed_at": null, "reviewer_name": "Dav Vand", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            I have been with Bluehost for almost a half year. Several times my email has been down. Customer support at Bluehost is not very helpful.\nIn some cases I was given feedback that their servers were down for maintenance. Down for maintenance!?! Why would a emai hosting be down for maintenance during peek working hours in Eastern time?\nThe answer was that they have several customers on the west coast and in Australia. Last time I checked the majority of the working population is in the eastern part of North America. What a joke.\nI am also continuing to have several issues with my email not being able to receive. In some cases it seems to think my inbox is full. Seems ridiculous when I don't even have 500 emails in my inbox. I will be switching soon.\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "muhammad waleed", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            BlueHost ranked as my number 1 web host. Because of their outstanding rating,\nand BlueHost give you a long list of features and plans which is easy to use, Which suit every user 100%. According to my knowledge BlueHost host more than a 500,0000+ domains and manage more then 10,000+ of servers across many cities of 3+ countries and approximately, The last 30+ days BlueHost give an up-time of more then 99.00%.\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "2.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Martin Rudinec", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "\n            Don't believe the hype. I've been with Bluehost for many years, and watched it get worse over time. It makes me sad, because they used to be very good back in the day, and I was happy with their service.\nIt's super slow now. Even if you install a clean empty WordPress, the page load times are awful. You run out of patience way before you get to set it up properly.\nMy bills kept getting bigger for no apparent reason, and even after an upgrade to the \"performance cloud\", my WordPress site didn't get any faster. They're only interested in sales, not so much their existing customers. I strongly recommend looking somewhere else for a fast reliable hosting.\n\n                         \n                    ", "picture_urls": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}]}]}, {"scrapping_website_name": "Hostgator", "scrapping_website_url": "https://hostingfacts.com/hosting-reviews/hostgator-wordpress-managed/", "response": [{"business_item_data": {"business_type": "Service", "absolute_url": "https://hostingfacts.com/hosting-reviews/hostgator-wordpress-managed/", "category": "Hosting Service", "name": "Hostgator-Hosting Service", "sub_category": "", "picture_urls": [], "original_price": "", "sale_price": "", "availability": "", "specifications": [], "website_name": "Hostgator", "description": ""}, "reviews": [{"absolute_url": "https://hostingfacts.com/hosting-reviews/hostgator-wordpress-managed/", "rating": "80", "review_title": "Good", "reviewed_at": "18/09/2017", "reviewer_name": "Matt", "category": "Hosting Service", "service_name": "Hostgator", "review_text": "\n        Hostgator are actually good to my liking and I do say I enjoy their service at one of my client’s websites and blogs.\n        I purchased a shared hosting for their company and over 3 years they have been having a good time with their blogs. All customer service is always active and ready to assist 24/7. What I value much about them is their free live chat customer service which is one way to resolve your complaints. So I don’t see any reason why people are rating them below their limits. I Love their service because is good\n      ", "picture_urls": ["https://hostingfacts.com/wp-content/uploads/2017/04/HostGator-Logo.png"], "website_name": ""}, {"absolute_url": "https://hostingfacts.com/hosting-reviews/hostgator-wordpress-managed/", "rating": "95", "review_title": "I have been using HostGator for years now", "reviewed_at": "04/06/2017", "reviewer_name": "Tim", "category": "Hosting Service", "service_name": "Hostgator", "review_text": "\n        I started my account with HostGator when I still learning html/css and wanted to publish my first website I was proud of. I am still hosting to this day. Their support is very helpful, one time I was in need of assistance with a SSL certificate and the chat literally went on for over 2,5 hours. Only downside I can think of is that sometimes their live chat is super busy and it can take a while before you can connect. Also 2 times my domains did not register correctly. Other than that the best web host in my opinion.\n      ", "picture_urls": ["https://hostingfacts.com/wp-content/uploads/2017/04/HostGator-Logo.png"], "website_name": ""}, {"absolute_url": "https://hostingfacts.com/hosting-reviews/hostgator-wordpress-managed/", "rating": "40", "review_title": "No www?", "reviewed_at": "21/05/2017", "reviewer_name": "Alex", "category": "Hosting Service", "service_name": "Hostgator", "review_text": "\n        Tried to set up a simple WordPress site via this Cloud package and in all honesty I’m surprised at how much hard work it was.\n        All of the automated emails seem to be for the old system as they don’t tie up with what actual happens in the customer portal. It also didn’t link the fact that I’d registered a domain at the same time so there were other emails about that.\n        It then turns out that you can’t change the URL in the WordPress settings so you are stuck with http:// version, no www. Not a major issue in many ways but not mentioned anywhere and a bit of an odd restriction.\n        Talked to the support team, one of whom advised me to uninstall WordPress and start over, the other of whom said it was all the same and it didn’t matter and insisted on calling me “bud”.\n        Can’t tell you what the actual hosting is like unfortunately because I gave up and moved elsewhere.\n      ", "picture_urls": ["https://hostingfacts.com/wp-content/uploads/2017/04/HostGator-Logo.png"], "website_name": ""}, {"absolute_url": "https://hostingfacts.com/hosting-reviews/hostgator-wordpress-managed/", "rating": "91", "review_title": "Their Cloud hosting is surprisingly good", "reviewed_at": "13/02/2017", "reviewer_name": "James Clarke", "category": "Hosting Service", "service_name": "Hostgator", "review_text": "\n        I am not a very big fan of Hostgator. There are too many negative reviews about their poor speed and slow support on the internet.\n          Even Hostingfacts does not recommend their regular shared hosting plans.\n        \n        But, their cloud hosting has been a pleasant surprise for me.\n          Little to no uptime , fast speed and friendly support staff is something, due to which i have decided to stay with them even after 10 months. Otherwise, i would have transferred to Siteground ( I like it a lot ) at any point of time.\n        \n        Hostgator Cloud is different, it is better and deserves the crown for this drastic improvement.\n      ", "picture_urls": ["https://hostingfacts.com/wp-content/uploads/2017/04/HostGator-Logo.png"], "website_name": ""}, {"absolute_url": "https://hostingfacts.com/hosting-reviews/hostgator-wordpress-managed/", "rating": "60", "review_title": "Expensive if you want more than 1 site", "reviewed_at": "08/02/2017", "reviewer_name": "John Galt", "category": "Hosting Service", "service_name": "Hostgator", "review_text": "\n        You’re only allowed to have 1 domain with the WordPress cloud hosting starter plan. The renewal rate is $9.95 which is pretty expensive when you consider other services and other plans give you unlimited domains. If you avoid the wordpress plans and choose the baby cloud plan you get unlimited domains for $7.95 and $11.95 renewal. $2 more for unlimited domains. You should get a baby cloud discount instead.\n      ", "picture_urls": ["https://hostingfacts.com/wp-content/uploads/2017/04/HostGator-Logo.png"], "website_name": ""}, {"absolute_url": "https://hostingfacts.com/hosting-reviews/hostgator-wordpress-managed/", "rating": "75", "review_title": "Long time HostGator user", "reviewed_at": "23/12/2016", "reviewer_name": "Jennifer", "category": "Hosting Service", "service_name": "Hostgator", "review_text": "\n        I have been a customer of hostgator for some time now. I have upgraded from Hatchling to Cloud Business. The speed of my 2 mb website has been good and all issues on our site have been handled professionally and pagespeed / onpage results are just fine.\n      ", "picture_urls": ["https://hostingfacts.com/wp-content/uploads/2017/04/HostGator-Logo.png"], "website_name": ""}, {"absolute_url": "https://hostingfacts.com/hosting-reviews/hostgator-wordpress-managed/", "rating": "85", "review_title": "Fast and reliable...", "reviewed_at": "17/12/2016", "reviewer_name": "Jonas", "category": "Hosting Service", "service_name": "Hostgator", "review_text": "\n        I used your discount and signed up with them 3 months ago. So far, so good. Not as single problem. I used to use Site5, but I discontinued using them as I felt the uptime was too bad.\n        Hence the reason I switched.\n        Overall, HostGator Cloud is a great host.\n      ", "picture_urls": ["https://hostingfacts.com/wp-content/uploads/2017/04/HostGator-Logo.png"], "website_name": ""}, {"absolute_url": "https://hostingfacts.com/hosting-reviews/hostgator-wordpress-managed/", "rating": "90", "review_title": "Support is on the good side...", "reviewed_at": "14/11/2016", "reviewer_name": "Mike", "category": "Hosting Service", "service_name": "Hostgator", "review_text": "\n        I’ve been using hostgator for just under a month and today I received a “500 Error” and my site completely shut down. I called their tech line and they said I had exceeded my bandwidth. Not Cool!\n        However, after I contacted the support they quickly fixed it.\n        Hands down – their support is good.\n      ", "picture_urls": ["https://hostingfacts.com/wp-content/uploads/2017/04/HostGator-Logo.png"], "website_name": ""}, {"absolute_url": "https://hostingfacts.com/hosting-reviews/hostgator-wordpress-managed/", "rating": "90", "review_title": "So far all good.", "reviewed_at": "04/11/2016", "reviewer_name": "Charles J.", "category": "Hosting Service", "service_name": "Hostgator", "review_text": "\n        I signed up for HostGator cloud back in June. So far, everything is working properly.\n        Uptime seems to be 100% and load times are much faster than my previous host (Site5).\n        I haven’t had a chat with their support (yet), so I can’t rate this.\n      ", "picture_urls": ["https://hostingfacts.com/wp-content/uploads/2017/04/HostGator-Logo.png"], "website_name": ""}, {"absolute_url": "https://hostingfacts.com/hosting-reviews/hostgator-wordpress-managed/", "rating": "100", "review_title": "Great support", "reviewed_at": "24/09/2016", "reviewer_name": "Dara Sofia C.", "category": "Hosting Service", "service_name": "Hostgator", "review_text": "\n        I am quite new to the blogging world. When I finally have the courage to create my own, I chose HostGator due to the reviews on this site. Yep. HostingFacts.com helped me with choosing my host, and I am quite satisfied. One thing I liked about HostGator very much is the support. Being a new blogger, I am quite slow and still learning about it. HostGator is such a huge help.\n        I recommend this to new bloggers, and although the price is higher than most hosts, this one is worth the money and will leave you satisfied.\n      ", "picture_urls": ["https://hostingfacts.com/wp-content/uploads/2017/04/HostGator-Logo.png"], "website_name": ""}, {"absolute_url": "https://hostingfacts.com/hosting-reviews/hostgator-wordpress-managed/", "rating": "90", "review_title": "Definitely worth it!", "reviewed_at": "31/08/2016", "reviewer_name": "Istiak Rayhan", "category": "Hosting Service", "service_name": "Hostgator", "review_text": "\n        I’ve started my blogging journey with the regular HostGator shared hosting. It worked great for me until my blog started getting high traffic. I’ve faced several downtimes on HostGator and moved to Bluehost shared hosting. My experience with Bluehost shared hosting wasn’t that good. And I decided to upgrade to Bluehost Managed WordPress Hosting. I didn’t find any difference. Believe me.\n        I bought HostGator Cloud hosting on last black friday and I’m still using it. It’s far-far better than Bluehost or GoDaddy (I’ve used them both).\n        So far, I haven’t faced any major downtimes with HG Cloud Hosting. Thumbs up for this!\n      ", "picture_urls": ["https://hostingfacts.com/wp-content/uploads/2017/04/HostGator-Logo.png"], "website_name": ""}]}]}, {"scrapping_website_name": "GoDaddy.com", "scrapping_website_url": "https://hostadvice.com/hosting-company/godaddy-reviews/", "response": [{"business_item_data": {"business_type": "Service", "absolute_url": "https://hostadvice.com/hosting-company/godaddy-reviews/", "category": "Hosting Service", "name": "GoDaddy.com-Hosting Service", "sub_category": "", "picture_urls": [], "original_price": "", "sale_price": "", "availability": "", "specifications": [], "website_name": "GoDaddy.com", "description": ""}, "reviews": [{"absolute_url": "https://hostadvice.com/hosting-company/godaddy-reviews/", "rating": "2.0", "review_title": "\n                        Horrible company                                            ", "reviewed_at": null, "reviewer_name": "Ludovic Vuillier", "category": "Hosting Service", "service_name": "GoDaddy.com", "review_text": "\n                        \n                                                        I was a loyal client for years and they used to be awesome. Today I recommend to everyone they stay away. Their tech was bad and the support was worse.                        \n                        \n                                                \n                                                    \n                        \n                    ", "picture_urls": ["https://hostadvice.com/wp-content/uploads/2014/01/GoDaddy.svg_-162x71.png"], "website_name": ""}, {"absolute_url": "https://hostadvice.com/hosting-company/godaddy-reviews/", "rating": "2.0", "review_title": "\n                        Worst domainbuy services                                            ", "reviewed_at": null, "reviewer_name": "Ayush Gangwar", "category": "Hosting Service", "service_name": "GoDaddy.com", "review_text": "\n                        \n                                                        Looks like a scam. After i registered on the domain buy service, I started getting mails from domain trading companies.They sell your data to other vendors and probably make a ton of money                        \n                        \n                                                \n                                                    \n                        \n                    ", "picture_urls": ["https://hostadvice.com/wp-content/uploads/2014/01/GoDaddy.svg_-162x71.png"], "website_name": ""}, {"absolute_url": "https://hostadvice.com/hosting-company/godaddy-reviews/", "rating": "2.0", "review_title": "\n                        Terrible Hosting Company                                            ", "reviewed_at": null, "reviewer_name": "L Knight", "category": "Hosting Service", "service_name": "GoDaddy.com", "review_text": "\n                        \n                                                                                        One of our websites went down due to an error on their part with the restore function in Cpanel. Rather than fix our issue and restore our website, Godaddy wanted to charge $149 to restore the website. Despite stating a misconfigu...Read More                                    \n                                ration error with their software, Godaddy would rather blame the customer and charge more money.Less \n                                                        \n                        \n                                                \n                                                    \n                        \n                    ", "picture_urls": ["https://hostadvice.com/wp-content/uploads/2014/01/GoDaddy.svg_-162x71.png"], "website_name": ""}, {"absolute_url": "https://hostadvice.com/hosting-company/godaddy-reviews/", "rating": "2.0", "review_title": "\n                        useless technical support. Don't use godaddy                                            ", "reviewed_at": null, "reviewer_name": "Kks ko", "category": "Hosting Service", "service_name": "GoDaddy.com", "review_text": "\n                        \n                                                                                        technical suport not professional at all. Does not understand. I was advised to cancel third party SSL and purchase Godaddy SSL 3time from different support staff, but third party ssl was installed to one website. As they have onl...Read More                                    \n                                y telephoe call technical support, we had to call many times and had to start explain from beginnnig.... It takes us such a long time. As they are not professional, cannot fix even small problem.Less \n                                                        \n                        \n                                                \n                                                    \n                        \n                    ", "picture_urls": ["https://hostadvice.com/wp-content/uploads/2014/01/GoDaddy.svg_-162x71.png"], "website_name": ""}, {"absolute_url": "https://hostadvice.com/hosting-company/godaddy-reviews/", "rating": "2.0", "review_title": "\n                        DO NOT TRUST GODADDY!  GO SOMEWHERE ELSE                                            ", "reviewed_at": null, "reviewer_name": "Leslie Munoz", "category": "Hosting Service", "service_name": "GoDaddy.com", "review_text": "\n                        \n                                                                                        GoDaddy will steer you into buying multiple years of Service and lure you with good pricing. Then they will get you to Auto-renew so there's nothing else to think about. If you ever forgot you were on auto-renewal and happen to mi...Read More                                    \n                                ss their email receipt, even if you're late in cancelling for just 13 days, they will NOT REFUND YOU! They will keep your money for the 5 years that you prepaid, even if you're never going to use their service. That's how they make money, but PREYING on the LITTLE PEOPLE. LOOK SOMEWHERE ELSE. TOGETHER, WE CAN BRING GODADDY DOWN. Danica Patrick, is this the kind of company you want to associate yourself with? Maybe you better think again. They are unscrupulous and dishonest and just out to make an easy buck with no consideration for the consumers. Their refund policies are embedded in all the legalese.Less \n                                                        \n                        \n                                                \n                                                    \n                        \n                    ", "picture_urls": ["https://hostadvice.com/wp-content/uploads/2014/01/GoDaddy.svg_-162x71.png"], "website_name": ""}, {"absolute_url": "https://hostadvice.com/hosting-company/godaddy-reviews/", "rating": "2.0", "review_title": "\n                        Godaddy BAD COMPANY CULTURE TO SUCK MONEY FROM YOU. WHY?                                            ", "reviewed_at": null, "reviewer_name": "TROY LEE", "category": "Hosting Service", "service_name": "GoDaddy.com", "review_text": "\n                        \n                                                                                        It wasn't user friendly from the start so I stopped using it after 2 months. it was too frustrating. And what happened after one year was, they auto renewed it for me. And had me going around in circles, and after that, tell me th...Read More                                    \n                                at it was past the 30days refund policy, and they couldn't refund it anymore, when I didn't even want the website anymore after 2 months. Now you know why their profits keep growing? When more people use, and after they have stopped, and Godaddy just helps them auto-renew without consent, they treat silence as consent, but sometimes people miss the email. How can they make the default decision? Yes, go daddy might be good for some people, but the way they work to grab more profits just reflects badly on the company culture and it makes me very disappointed. I have learnt to be more stringent with all these approvals. Thank you godaddy, for teaching me this lesson. Well, I go to college and i pay for it, I come here and I also pay for it. But you can be sure that, I wouldn't pay for it again, and I'll make sure none of my friends will be part of your quarterly profits. Thank you.Less \n                                                        \n                        \n                                                \n                                                    \n                        \n                    ", "picture_urls": ["https://hostadvice.com/wp-content/uploads/2014/01/GoDaddy.svg_-162x71.png"], "website_name": ""}, {"absolute_url": "https://hostadvice.com/hosting-company/godaddy-reviews/", "rating": "2.8", "review_title": "\n                        rude customer sopport                                            ", "reviewed_at": null, "reviewer_name": "Ali Nejad", "category": "Hosting Service", "service_name": "GoDaddy.com", "review_text": "\n                        \n                                                                                        After a long talk to their automated service and inputting my customer number, I had to even wait for longer time to talk with a rude, tired & impatient customer service representative asking same questions and once more custo...Read More                                    \n                                mer number. Amazingly as I am not holding the same credit card I used few years ago and didn't remember my password, he refused to identify me through other personal details.\r\nI would give them 0 star if there was an option available. BTW, The service type below doesn't offer domain option.Less \n                                                        \n                        \n                                                \n                                                    \n                        \n                    ", "picture_urls": ["https://hostadvice.com/wp-content/uploads/2014/01/GoDaddy.svg_-162x71.png"], "website_name": ""}, {"absolute_url": "https://hostadvice.com/hosting-company/godaddy-reviews/", "rating": "2.0", "review_title": "\n                        Can't cancel subscription                                            ", "reviewed_at": null, "reviewer_name": "Rúnar Sigurbjornsson", "category": "Hosting Service", "service_name": "GoDaddy.com", "review_text": "\n                        \n                                                                                        Purchased the required auction subscription because a domain I wanted was said to be on auction. After I subscribed, the domain won't come up in the auctions search. Now I can't find the option to cancel the subscription and havin...Read More                                    \n                                g a terrible time trying to contact their so-called support. Terrible business practices.Less \n                                                        \n                        \n                                                \n                                                    \n                        \n                    ", "picture_urls": ["https://hostadvice.com/wp-content/uploads/2014/01/GoDaddy.svg_-162x71.png"], "website_name": ""}, {"absolute_url": "https://hostadvice.com/hosting-company/godaddy-reviews/", "rating": "2.0", "review_title": "\n                        HORRIBLE MISLEADING SERVICE                                            ", "reviewed_at": null, "reviewer_name": "J Fried", "category": "Hosting Service", "service_name": "GoDaddy.com", "review_text": "\n                        \n                                                                                        Their website is terrible. I tried to cancel in December THE DAY MY CREDIT CARD WAS CHARGED and they did not let me cancel. They said I would receive a refund shortly and it was never processed. I called again in January to compla...Read More                                    \n                                in. The said only 2/3 of my account was canceled in December. Additionally, they said when I tried to cancel in December my chat wasn't \"Finished\" so that is why I did not get a refund. So ridiculous that someone would try to cancel and only cancel 2 /3 of the services associated with the account. It makes zero sense. They refunded only 2/3 of the renewal price and said I had to pay the last 1/3. Such a scam. Do NOT use them.Less \n                                                        \n                        \n                                                \n                                                    \n                        \n                    ", "picture_urls": ["https://hostadvice.com/wp-content/uploads/2014/01/GoDaddy.svg_-162x71.png"], "website_name": ""}]}]}, {"scrapping_website_name": "Expressvpn", "scrapping_website_url": "https://www.bestvpn.com/expressvpn-review/", "response": [{"business_item_data": {"business_type": "Service", "absolute_url": "https://www.bestvpn.com/expressvpn-review/", "category": "VPN Service", "name": "Expressvpn-VPN Service", "sub_category": "", "picture_urls": [], "original_price": "", "sale_price": "", "availability": "", "specifications": [], "website_name": "Expressvpn", "description": ""}, "reviews": [{"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "10/03/2018", "reviewer_name": "Mike ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHow is it with peer-to-peer file-sharing?\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "12/03/2018", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Mike,\nExpressVPN works very well for torrenting –  and with no meaningful logs, it is verty safe. The only thing to be aware of is that ExpressVPN does not offer port forwarding (although since it does not use a NAT firewall) this should not be required anyway.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "14/02/2018", "reviewer_name": "Jay ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Douglas,\nIn your travels scrutinizing VPN software, have you uncovered any reason why “Expressvpnd” would be hogging 98% of my CPU cycles even when ExpressVPN is not connected? Is it some kind of ‘helper’ app…? Better yet, do you suspect I can delete that damn thing without crippling the main application?\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "15/02/2018", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Jay,\nHmm. I take it you are using ExpressVPN’s Linux client? After a little poking around it seems that Expressvpnd is  ExpressVPN’s Linux deamon, so you probably need it to run the main client. It should definitely not be using up 90% of your CPU, though! I would contact ExpresVPN’s support about this. If you are not using Linux, then something fishy is going on.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "15/02/2018", "reviewer_name": "Jay ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tThanks Douglas for sharing your knowledge about that. Something fishy then, as I’m using Mac OS (maybe by some intellectual interpretation, they see Mac OS as a flavor or linux). I will take your advice…GRAZIE\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "16/02/2018", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Jay,\nWell… macOS is based on Unix which is closely related to Linux, so it would have not surprised me to see the “Expressvpnd” file on a Mac. Because I am a pro, however, I decided to check! I installed ExpressVPN into a macOS VM, and can see no sign of it. The only ExpressVPN process running is “ExpressVPN”. This screenshot was taken with the ExpressVPN client running and connected. As you can see, it is using 0% CPU (and this is inside a VM on a low-end Macbook Air). So I would definitely contact ExpressVPN’s support over the issue.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "17/02/2018", "reviewer_name": "Jay ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHey Douglas. I got the answer direct from the ExpressVPN people. Here’s what I did.\nExpressVPN customer support was, in the end, very precise, efficient, and well…savvy.\nExpressVPN support also supplied (true to their name) an express way to remove the existing program with one command line entered into the terminal. Neat…!\nThen they simply had me upgrade from v-6.5 to v-6.7.1 and that too, was with one express URL and a new Authorization code. Most companies don’t do that. Translation: savvy customer support. \nSince I installed v-6.7.1, my CPU cycles for expressvpnd dropped from 98% to 0.1%. Uhhh….wow.\nThe only place what I am saying, compared with what you’re saying, differs, is that after my upgrade installation to v-6.7.1, my Activity Monitor shows three files running (couldn’t find a way to upload a png screenshot) with these %-age CPU cycles :\n ExpressVPN\t                                0.4%\t(main program)\n expressvpn-browser-helper\t0.0\t        (I installed their browser helper, so this is known)\n expressvpnd\t                        0.3\t        (I have no idea what this is or what it does)\nSo it’s a mystery why your Mac installation shows no expressvpnd file. Anybody there know what that’s about?\nIncidentally, Douglas, unlike two people on this thread complaining about crashing or major loss of speed, my installation is rock-steady for hours and hours day after day. Reliability is one of the things I like most about ExpressVNP and IPVanish. I run both. They’re both great tools I’ve been using them for about a year or more.\nThe good news is ExpressVPN is running a small footprint.\nLASTLY, I value your site highly for your rigorous checking, comparisons, and reviews. Without BestVPN I would not be using VPNs at all.\nYou converted me. Thanks for being there.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "19/02/2018", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Jay,\nThanks! I’m glad the issue is resolved and that ExpressVPN has done a good job at providing support. Since you installed the browser helper and I didn’t, I would hazard that the expressvpnd 0.3 process is somehow related to that (?).\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "10/02/2018", "reviewer_name": "Kerry ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tFor those like me who are technology challenged…If you are in the US and trying to increase your streaming using a VPN, I would search more “consumer reviews” rather than these tech sites.  A VPN will SLOW your streaming speed because of the encryptions.  I tried ExpressVPN since it had more supposed “customer service” and a longer trial period.  Waste of time.  Cancelled within a week.  It reduced my speed by 15 Mbps which was drastic considering it left me with an average of 5-7 Mbps using their best location.  You’d be better off spending the money to upgrade your router.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "12/02/2018", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Kerry,\nA VPN will slow down your connection, which is why we perform extensive speed tests for our reviews. It is just a price you have to pay for the benefits of a VPN. As you see can from our extensible battery of scientific tests, however, ExpressVPN is one of the fastest services out there, and you shouldn’t really be suffering more than 10% or so speed drop when using it.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "30/01/2018", "reviewer_name": "bob kinzel ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tConstantly lost connection..support told be to reboot or reinstall which i did constantly..\nhad same problem on 4 different pcs..Would never use express vpn again.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "31/01/2018", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi bob,\nI can’t argue with the experience you have had, but must say that I am surprised. I, certainly, have never had any problems with ExpressVPN disconnecting regularly. Note that (usually for reasons beyond their control) all VPNs disconnect occasionally (which is why a kill switch is so important). But in my experience, ExpresVPN is is no worse than any other.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "29/01/2018", "reviewer_name": "Tom ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHello Douglas,\nI have small problem with ExpressVPN. While connecting to for ex. Bosnia and Herzegovina I am not receiving an IP which tracks me to Bosnia. Buy my IP,s ISP comes from Netherlands. The same situation is with Turkey, Belarus, Montenegro, Armenia all IPs from this country comes from Netherlands ISP loot. This is very strange beacuse it may show us that the IP which we are receiving is fake and all the traffic goes through Netherlands servers.\nOff course you can pick up different countries which doesn’t suffer with this ISP problem like Serbia, Latvia etc but then the speeds drops down twice.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "30/01/2018", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Tom,\nYou will need to confirm with ExpressVPN, but it sounds as if you are running into the virtual servers issue. We discuss our feelings about virtual servers in this article.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "18/01/2018", "reviewer_name": "Collection Smart Review ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tJust installed on my iPhone as my first vpn and it was very easy. I was up and running in seconds. Been using all day and no issues. I am impressed.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "12/01/2018", "reviewer_name": "Shaver ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tWith all the crazy crap that I keep reading in the news, I’m glad service like ExpressVPN exist.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "08/01/2018", "reviewer_name": "Martin ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tI was looking both on ExpressVPN and NordVPN, which you recommend both.\nI found this user review here https://www.vpnmentor.com/reviews/expressvpn/ and the user said he had hard time connecting to Netflix with Express. This is what I mostly interested in (watching Netflix France from outside of France if to be more specific).\nWhat do you think? Would there be issues with Express? Should I try Nord?\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "08/01/2018", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Martin,\nExpresVPN always runs at least one server that works with US Netflix. You should contact support to find out which server(s) work at any given time. ExpressVPN tells me that it does have servers that work with Netflix France, although you may need to contact its 24/7 Live Chat support to find out which ones. NordVPN tells me that all its France servers work with Netflix France. Both services have a no quibble 30-day money back guarantee, so you can’t really go too far wrong.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "28/12/2017", "reviewer_name": "Charles ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nDon’t trust free vpn services. Expressvpn may cost a bit more but the services is faaaar better. Tons of servers and protocols options to choose from.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "14/12/2017", "reviewer_name": "Umes ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nAwesome servers, no uptime, works with Netflx too. Also, the speeds are better than most.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "01/12/2017", "reviewer_name": "Mark ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nJust got back from 5 months in China Expressvpn worked perfectly.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "29/11/2017", "reviewer_name": "Fabio de Castro ferraz ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tEu quero\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "20/11/2017", "reviewer_name": "Relko ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nGood torrenting vpn. Works well for online gaming too because it prevents your network from DDoS attacks.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "08/11/2017", "reviewer_name": "Ryan C. ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nSpectacular speeds. The customer service is better than most.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "01/11/2017", "reviewer_name": "Rados ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nPerfect for use in China. If you’re living, working or just passing by, make sure you use the nearby HK servers to unblock content and bypass the great firewall.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "26/10/2017", "reviewer_name": "Keller ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nUnlike other VPNs, Express VPN’s interface is extremely user frendly. I was new to VPNs and was able to figure this one out immidiately.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "20/10/2017", "reviewer_name": "Luis ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nHaving trouble with Netflix? Just open a chatbox and they’ll direct you to the right server. Trust me, it still works.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "12/10/2017", "reviewer_name": "Russ ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nUsed purevpn and it was a joke! Every time I logged onto one of their sites, I ran at least 5 leak tests! Every time it showed my internet provider included in the results! So much for security. Also, whenever I downloaded anything, my firewall went nuts blocking intrusions! Spent a total of 16 hours with them trying to resolve dns leaks & nothing worked! Express VPN is sooooooo sweet, no leaks, fast downloads & my firewall has no intrusion blocks!  I’ve already had 2 warnings from my internet provider regarding downloads using pure VPN. WHAT A DIFFERENCE!\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "12/10/2017", "reviewer_name": "Max ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nWorks great in Germany. Lots of servers and nice customer support.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "11/10/2017", "reviewer_name": "John Loch ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tTHEIR SUPPORT SUCKS\nIt all looks good until you need meaningful support, at which point you’re screwed.\nThey just don’t care once they have your money.\nI would seriously consider other vendors.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "06/10/2017", "reviewer_name": "Ryan ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nMakes my connection private It’s well worth the price IMO.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "29/09/2017", "reviewer_name": "Yochonami ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tBest VPN app I’ve used so far. My only complaint is that I wished they allowed more devices so my gf could use it too.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "29/09/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Yochonami,\nWell, it depends how many devices you use, but ExpressVPN does allow up to 3 devices at once…\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "28/09/2017", "reviewer_name": "J.George ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nSolid app. The settings are pretty basic but i acutally think that’s a good thing.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "21/09/2017", "reviewer_name": "recovering reddit guy ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tI’ll help you guys out a bit:\nCONS:\noverpriced\nfake server locations\nno good features\nonly 3 connections\nbad speeds\nblocked by netflix\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "22/09/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi recovering reddit guy,\n– Price is definitely a matter of opinion, but remember that you also get a full smart DNS service thrown in with the subscription\n– Please see this article for our thoughts on virtual server locations\n– Ha ha\n– 3 simultaneous connections is average\n– ExpressVPN seems to have slowed down a little this year, but as you can see from the test results above, its still pretty nippy in my experience\n– Contact ExpresVPN’s support for a list of servers that work with Netflix.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "21/09/2017", "reviewer_name": "Jeff Elt. ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nVery quality service. 5 stars.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "12/09/2017", "reviewer_name": "Hi ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\texpessvpn now ublock US AND Canada AND UK NETFILX\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "13/09/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Hi,\nThanks for letting us know! We are currently working on a system to keep up-to-date with the latest developments in this cat-and-mouse game.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "11/09/2017", "reviewer_name": "Michael P. ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nGreat service. I love the HK stealth servers for China. I’ve you want to bypass the great firewall then you need this help.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "06/09/2017", "reviewer_name": "Gommer ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tImpressive service. I love all the different apps. I’ve been using this for a few months and have only tried <5 locations.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "31/08/2017", "reviewer_name": "Mark ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nI like this service a lot. Logless, no BS or Bluff. My only real complaint is that I wish they offered more than 3 simultaneous connections.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "28/08/2017", "reviewer_name": "Terry Bradbury ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tDO NOT WASTE YOUR MONEY an absolute bill of Junk! however still  better than pureVPN.\nI am a gamer and need a secure connection. That is the one thing you will not get. They blame it on everyone else. I now have 3 service providers into the house, A UPS, separate UPS’s on each router. Guess what! today I played all day with no disconnection and no connection to express VPN because as normally happens every 2 or 3 days I could not get connected to any expressvpn server anywhere so I tried without.\nDo I need a VPN. Yes! but I will go back to the old way, that we all started with before these companies sprang up. Pavel!! what’s your IP address mate!\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "28/08/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Terry,\ni have no idea why you are having problems, but I have never had any problems connecting to ExpressVPN’s servers.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "24/08/2017", "reviewer_name": "Marco ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nThe DNS leak protection is what got me to sign up, but the service itself is what’s keeping me going.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "16/08/2017", "reviewer_name": "Brian ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tSolid apps, better than average customer support. What more do you need?\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "16/08/2017", "reviewer_name": "jke ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tWhile registering for an account with expressvpn, I typed in different e-mail addresses because I wasn’t sure which one to choose – without saving/completing the process. In fact, I stopped after entering the e-mail address, which – one should assume – just is some text in a form that is lost when not saved. \nHowever, after about 1 hour I received a reminder from expressvpn on each of those addresses to complete my order. I find this very disturbing, especially for a company that boasts itself with online privacy.  Dunno though if it the same with other VPN services, probably yes.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "23/08/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi jke,\nI have not heard of this before, but does seem to be possible. I do not believe it to be common in the VPN industry, however.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "14/08/2017", "reviewer_name": "VPN user ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tAttention:\nI now believe that many ExpressVPN customers would (and/or will be) be asking for refunds if they knew the real truth about this company “faking” 11 server locations:\nhttps://restoreprivacy.com/vpn-server-locations/\nHow can ExpressVPN remain a top tier service with this blatant dishonesty?\nAlso, take note that PureVPN has been cited for 5 fake server locations.\n(Many thanks go to Sven Taylor above for posting this article)\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "24/08/2017", "reviewer_name": "stephen ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tI think you’re being a little paranoid, but that comes with the territory. The reason companies like ExpressVPN use virtual servers (typically in nearby countries) is for the very reason people use their services – security. If you’re in North Korea, for example, would you want to use a dodgy server that could have real security issues technically and physically, or set up a virtual server that’s located in a much more secure country but to all intents and purposes acts like a North Korean server for those wanting to use it within the country? It’s case of practicality and safety, of offering exactly what people are after in places like that – online security. Take note of where most of those virtual servers are located.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "11/08/2017", "reviewer_name": "Redwan ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tI have come across a webpage https://restoreprivacy.com/expressvpn-review/ which advise users to stay away from ExpressVPN and explained ‘Why?’ in great detail. I am seriously shocked at his review. I am not a VPN expert and seeing that bestvpn.com gives ExpressVPN #1 rank. Can you please explain in separate page regarding the issue raised seriously by editor of https://restoreprivacy.com/ ? I also read some other reviews on some popular VPN providers and think ‘What is going on with people’s privacy and lives.’\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "23/08/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Redwan,\nThe issues raised by Restore Privacy, such as keeping aggregate logs and that the BVI is not an ideal location to be based are covered in this review. It is just that in my judgment the complaints raised in  that article are not as serious as the author suggests. A good example is 3 simultaneous connections, which is the median amount in the VPN industry. Such is the nature of all reviews – they are subjective. BestVPN’s Best 5 selections are a group decision, and for us its excellent customer support, wealth of features (including a free smart DNS service), great technical security, strong perfomance (in out tests) etc., carried the day. That said, recent accusations that ExpresVPN operates fake server locations may cause us to rethink our current position.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "07/08/2017", "reviewer_name": "Tonny ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nBest VPN I’ve used. Switched from Vypr because ExpressVPN still works with unblocking Netflix. Speeds are legit.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "04/08/2017", "reviewer_name": "Bill ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nDoes the trick. The network lock option is also a nice touch. All in i’ve been very satisfied.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "31/07/2017", "reviewer_name": "Nick ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nReally great app. I Particularly like how it’s not overly complicated like other services I’ve tried. Quick to install and very easy to use.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "27/07/2017", "reviewer_name": "Tin ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nPrice is a bit higher but the service is well worth it. Tons of server locations and browsing sppeds for the most part are great.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "26/07/2017", "reviewer_name": "Rovelyn ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nWorks exactly like a VPN should. Yes, the price is a bit higher but I guess you gotta pay more for quality. Stay away from free services.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "21/07/2017", "reviewer_name": "Orsen ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nBest VPN on the market. Works great on my Linux, which is great because there aren’t many vpn applications available for it.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "18/07/2017", "reviewer_name": "Matthew ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tExcellent service followed up with excellent customer service.\nBear in mind that the customer service team is probably dealing with many newbies such as myself all the time, who have not realised that all they need to do is reset router, or computer, or activte/deactivate vpn.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "18/07/2017", "reviewer_name": "Kevin ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nKeeps you safe even when you’re expeirencing bad connections. Love the killswitch feature they added. Really lets me feel more at ease when Iam browsing.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "12/07/2017", "reviewer_name": "VPN user ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tUpdate:\nHere is a link I found which clearly indicates ExpressVPN is a US based company:\nhttps://www.bizapedia.com/de/exprsvpn-llc.html\nThought everyone should know!\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "13/07/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi VPN User,\nIt is my understanding that ExpressVPN was indeed a US company, but that it has moved to the BVI.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "12/07/2017", "reviewer_name": "Tony ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nI choose this service because they accept Bitcoin as payment. They also seem to write it about it a lot. If you’re going to use a VPN, use one that advocates privacy. Express VPN has been great so far.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "11/07/2017", "reviewer_name": "Duff ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nIf you’re looking for a vpn to stream content, this one still works with netflix. It might take a while to get connected sometimes but overall it works great.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "07/07/2017", "reviewer_name": "VPN user ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nWanted to add here that I really thought ExpressVPN was going to be the “one” VPN that I could rely on for the longer term but after using it for a while and having paid a full year’s subscription (as one month would have sufficed) it turns out I was getting a number of annoying connection issues (all with US locations) and the client would just sort of freeze up and not connect (?) until I quit the app and tried another European location that did connect. Have asked for a refund and at least live chat was quick at processing the request. These connection problems are very odd as I had much higher hopes for such an expensive service. Also, now waiting on IVPN to sort out their current crashing client issue (in my other review) as it is the only VPN that has been working reasonably well on my Mac and has very fast connections when it is not crashing. I am just about to give up on all VPN usage due to the unreliability I have encountered and just go back to my ISP with manually entered DNS.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "22/07/2017", "reviewer_name": "anonymous ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tI’ve been using IPVanish for 2yrs. Never a connection problem, speeds are great. sometimes when OS X or iOS update, it takes a few days for them to update there software to match.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "07/07/2017", "reviewer_name": "Andrey ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nThis app is so good I don’t even realize it’s on. Most vpns tend to drain your battery or slow connection, but this one is always super smooth.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "06/07/2017", "reviewer_name": "John ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tCan anyone explain, what is the convenience of using browser extension, if for its work, you need additionally install and monitor the Windows app?\nAnd why this extension doesn’t pass vpn traffic only through web browser, as most other vpn services do? Such approach to realization of this feature seems very strange.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "07/07/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi John,\nThis is indeed an unusual way to go about doing a VPN browser extension – as you say, most of these are in reality proxy connections (rather than real VPNs) that work for that browser only. I said that it provides convenience because that is the only real advantage I can see for doing an extension in this way. You can start the VPN directly from your browser’s menu bar. It’s not a big leap leap in convenience, I grant, but some may find it easier than the regular way.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "29/06/2017", "reviewer_name": "Clam ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nCouldn’t connect the other day? The probably had some problems with their serves. Works fine now, but I expect a lot from a service this expensive.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "28/06/2017", "reviewer_name": "Dana wellington ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPriceNot Rated\nFeaturesNot Rated\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nI contacted express vpn over 24 hours ago and have dove contacted them by email 7 more times. All I have received is email with the ticket number each time. My computer has an dns address not being found, so I can not connect to other websites. This is not the customer support that they tought about! Very disappointing.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "29/06/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Dana,\nHave you tried talking to ExpressVPN’s Live Chat team?\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "20/06/2017", "reviewer_name": "Klara T. ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nIf you’re gonna use free wifi, you need one of these first. It’s better to pay for VPN than wifi, that’s what I think.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "14/06/2017", "reviewer_name": "Carlos ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nWorks like a magic on mc PS4 and makes gaming even more fun! Wicked!\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "09/06/2017", "reviewer_name": "Zagy ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nServers are fast and the app is really easy to use. Can’t really ask for much else.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "02/06/2017", "reviewer_name": "Curtis ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nAwesome service. Tons of locations, strong privacy, settings, logless services, killswitch options, works with Netflix, fast servers, no uptime, unlimited bandwidth…should I go on?\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "31/05/2017", "reviewer_name": "Hummel ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nYou’re kidding yourself in this day and age if you’re still using a free vpn service. With government powers around the world colluding to infringe on your privacy, a vpn has never been more important. Expressvpn prides themselfs on offering logless browsing and strong encryption on all of their servers. The price is a little more than other vpns, but you get a much better service.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "30/05/2017", "reviewer_name": "Robert ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nA little bit disappointed. By reading reviews (this one and many others) i was expected to get really premium service for premium price (it’s around twice much more expensive than other) but it really really got big problems with speed decrease. I even can’t speak about watching Netflix, because i felt like with dial-up line when on us servers from eastern europe. Maybe it works good in asia or united states, but in europe it’s worth nothing. The lines I’ve tried was 100 and 300 mbps so the problems really wasn’t in my end.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "26/05/2017", "reviewer_name": "Johnny Doe ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tYou didn’t review another important aspect of VPN’s privacy & security features. Does Express VPN own all of it’s servers world-wide or are they renting space in server banks that may be compromised or even ran by malicious actors seeking to compile DNS information which can be used to logged & tracked?\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "29/05/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Johnny,\nThe only VPN company I know of to own all its servers is VyprVPN, wich has other privacy issues of its own. Please see 5 Best No Logs VPNs for a more complete discussion on this issue, but it is not as bad as may at first seem. Any VPN provider worth its salt will full-disk encrypt all servers it rents, making their all data stored on them inaccessible to malicious actors (including the server owner). Traffic analysis could still be performed on incoming and outgoing connections, but the use of shared IPs not only makes this very difficult, but also makes it even harder to actually prove anything.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "25/05/2017", "reviewer_name": "Jeff ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nWas experiencing a few bugs before but the latest Mac update seems to have fixed everything. Works great now!\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "24/05/2017", "reviewer_name": "Leroy ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nVery disappointed with customer service and perhaps whole service. Instead of trying to solve or search why i have such a huge speed drop so i have to fill-up google captcha everywhere just offered me to get refunded. Ok, I’m happy I got my money back, back with such attitude they will lose whole clients in near future. Think king has just lost his crown in vpn market. This service is really too expensive for what you get instead of what you’ve expected\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "24/05/2017", "reviewer_name": "Eduardo ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nNever had issues, customer service is always timely.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "22/05/2017", "reviewer_name": "Giacobbe ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nThis VPN have some problems! Before buying i contacted them via live chat to ask what might be speed drop and got answer the reduction won’t affect quality of performance. But the truth is really different my speed drop dramatically. The only good thing the support guy said and that was true that if I won’t be satisfied they will refund me immediately.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "22/05/2017", "reviewer_name": "Amy ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\n5 star for the customer service. They really have their act together. There service team is fast and very efficient. Keep it up!\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "18/05/2017", "reviewer_name": "Nely ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nWas researching vpn comanies and this one was always at the top of the list. Bought a 1 month plan and will be renewing my subscription.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "18/05/2017", "reviewer_name": "Kregar ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tThis is my first VPN.  It has worked great for me.  I have it on my T-Mobile phone and tablet.  Allows me to tether laptop.  No drops and no big drop in speed.  I don’t have broadband where I am, but will soon and will load a router with it.\nHappy so far,\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "16/05/2017", "reviewer_name": "Robert Bridges ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nMy daughter has been using ExpressVPN in China for the past several months.She uses it on her MacBook and on her iPhone.  Excellent service so far.  She recently had a technical issue at her end, and Irving on the chat line helped solved her problem.  A real person with excellent technical knowledge.  So now we can add great support to our list.  If you want the best, buy ExpressVPN.  It’s not cheap, but we award 5 stars on price because it’s worth it.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "15/05/2017", "reviewer_name": "Américo ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nServers which aren’t blacklisted by Netflix are overcrowded and it’s impossible to watch.\nAlso I’ve found as big disadvantage that only 3 devices could be signed in with 1 account, what means I’ve to buy 2 accounts if i want connect my and my wife devices while on vocation. Speeds are poor comparing to price\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "15/05/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Américo,\nThree simultaneous devices is fairly standard for a VPN service…\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "12/05/2017", "reviewer_name": "Cadd ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nI’ve only used it on mobile, but it’s worked great so far. It especially comes in handy when I’m browsing public wifi. I never trust airports.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "11/05/2017", "reviewer_name": "Herman ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nBought as premium service for premium price but was disappointed by huge speed drop. It would be OK for 10 – 15%, well keeping in mind distance from eastern Europe to US is huge let it be 30-40%, bet more than 80% speed drop is not what you expect from service which cost twice more than vpn you have been using before and got around 50% speed loss. Support team just proposed to try another server and after reporting it doesn’t work out asked may I want to be refund so respect it.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "11/05/2017", "reviewer_name": "Maria ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nBought it for the stealth servers, and man am I glad I did. The HK servers work great in China. Way better than any other VPN I’ve tried. Connections are also more stable than the norm. Honestly this is the best all around service I’ve tried.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "08/05/2017", "reviewer_name": "John ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nWorth every penny. Yes, expressvpn costs a bit more than other vpn apps, but the service is far superior. Just try talking to their live chat for proof. Very helpful app.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "03/05/2017", "reviewer_name": "Jason ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nHi Douglas, with all respect to You I think You should re-test this VPN, because I’ve switched to this VPN after reading reviews about perfect service, no speed drops and so on, but while I’m connect from Europe to US the best i’ve got is around 2-3 Mbps and like I’ve mentioned before when I’ve contacted customer care I got the answer it’s normal in peak time to have such speed drops. To make more clear without vpn i got ~100Mbps.\nWith VPN I’ve used before i got around 40-50Mbps connected to US servers and was able to watch US netflix, what now is impossible.\nMaybe this problem came out due to VPN’s peak in US when congress let ISP to sell data, but it is totally not worth the price they are asking to pay.\nThanks in advance and maybe it will be usefull.\nBest regards Jason.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "03/05/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Jason,\nSo I just reinstalled the ExpessVPN client and ran a quick test. I am based in the UK and let ExressVPN choose which US server to connect to (it connected to New York, which is not surprising as the NY server is closest to the UK).  You can see the results here . Have you turned off an P2P software before running you tests?\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "05/05/2017", "reviewer_name": "Oscar ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Douglas, I’ve also just ran a test. I’m located in Germany at the moment, also let ExressVPN choose which US server to connect and it also connected to New York because it is the closest one and a maximum i got was ~7Mbps. I could share a screenshot or link to speedtest.net because I’ve also tested here if it’s interesting for You.Now p2p clients or streaming services were running at that moment\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "05/05/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Oscar,\nFeel free to link if you like, but I believe you :). I’m not sure what else I can usefully say here – as you can see, I get very decent UK -> US speeds. For some reason this is clearly not true for everyone, but I can only publish the results I get. What I can say is that ExpressVPN is great when it comes to honoring its money-back guarantee, so people have plenty of opportunity to test the service for themselves before committing.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "02/05/2017", "reviewer_name": "Brian ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi, I posted two comments earlier on this thread and I saw them ready for moderation.  I’m sure there wasn’t anything controversial and certainly not offensive — one asked a question and had some quotes from some standard websites for checking for leaks, with my results.   And both comments have either disappeared, or were never posted after the moderating process.  Douglas, can you explain, please?  (Privately if you prefer, you have my email address.)  Many thanks in advance.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "03/05/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Brian,\nI had to finish work a little early yesterday for personal reasons, and so did not have the opportunity to moderate your comments until I started work this morning. They are now published.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "03/05/2017", "reviewer_name": "Brian ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tI felt guilty after I’d posted that! 🙁  Put it down to the impetuous impatience of a senior citizen (or something, LOL)  Only kidding.  I think.  Many thanks however.  🙂\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "02/05/2017", "reviewer_name": "Brian ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tFurther to my comment a few minutes ago, this one doesn’t look too good, but I hope I’m misunderstanding it(?!)\nFrom  ipleak.net\nYour IP addresses\n104.237.93.34 United Kingdom – England Univera Network – Business \nNo forwarded IP detected. If you are using a proxy, it’s a transparent proxy.\nIPv6 test not reachable.\nYour IP addresses – WebRTC detection  No leak, RTCPeerConnection not available.\nDNS Address – 1 server  159.122.209.126  United States\nIf you are now connected to a VPN and between the detected DNS you see your ISP DNS, then your system is leaking DNS requests\nI never had that message with NordVPN.  Hmm….(?)\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "03/05/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Brian,\nSo… do any of the IPs you see belong to either yourself or your ISP? If not, then you do not have any IP leaks.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "03/05/2017", "reviewer_name": "Brian ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Douglas,  I’m pretty sure they’re neither me nor the ISP, but I need to find out, if I can, all the addresses used by ExpressVPN, maybe that’s not possible.   By the way, I’m delighted with the ease and speed of connection with the Android version, which I’ve been using today.  And definitely no leaks.  I need to find out how much battery power it  uses, however.  I’ll check that out tomorrow.  (Samsung tablet, the ‘KitKat’ version!)\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "04/05/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Brian,\nVisit ipleak.net. If you click on the green IP addresses shown, the site will provide more details about who owns that IP address.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "02/05/2017", "reviewer_name": "Brian ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi again Douglas.  OK so I’ve taken the plunge and taken out a trial month’s sub to ExpressVPN (I wont blame you if I don’t like it 😉 )  So far everything is good, haven’t checked the speeds yet, but I’ve gone for the leak tests.  Is the following OK, cos I don’t understand why there are different IP figures:\nFrom doileak.com\nRequest IP: 104.237.93.34, SoftLayer Technologies (36351), United Kingdom (EU)\nDNS Request Source: We did get DNS requests from the following IPs:\n159.122.209.126: Express VPN (36351), United States (NA)\nYour DNS configuration seems to be ok. All your DNS request(s) came from the same network as your HTTP request (or from anonymous DNS servers).\nSSL traffic: 104.237.93.34\nWebRTC IP Leak: We could not detect an IP via WebRTC.   What’s the difference between the 159 … on and the 104 …?  Whatever, it’s good to know there’s no leak, although unless my memory is faulty, I think it’s the first time a VPN I’ve used has been linked to an actually country (USA).  Tho’ why USA, when it’s Brit Virg Is?!  I’ll add something when I’ve done a few speed tests.  All best.  —B\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "28/04/2017", "reviewer_name": "Ronald Cameron ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tI like the fact that ExpressVPN has a simple interface with few significant options that are changeable (basically the protocol). My previous VPN vendor’s Windows app had endless options and whenever you reported a problem to them their first response was to have you try turning each one on or off to see how it affected the problem. Extensive testing required that I wasn’t willing to do for them – so my last problem before I left them wasn’t resolved.\nFrom my initial experience, ExpressVPN is working well for me on my Chromebook and Android tablet with a few very minor hiccups but appears somewhat more flaky on my Windows PC. I am able to access certain financial web sites with ExpressVPN that I couldn’t with my former VPN software, nicely enough. Their web site is polished and professional. I have generally decided though that you just have to expect more problem issues/complexity if you introduce a VPN to the mix. AND the prices quoted for the software are US$ !\nExpressVPN support is fairly quick and friendly but fairly knee-jerk unthinking. They seem to want to have you first try re-installing the software as an attempt at resolution for any problem. When you do convince them you are experiencing a bug, they just appear to suggest you wait for resolution in a future release or install a possibly problematic older release without indicating they are reporting your issue to development. I supplied an ExpressVPN diagnostics log for the problem I was experiencing but never got any indication back that they had looked at it. Their 24/7 chat facility seems to go down occasionally – I’ve noticed it offline a couple of times in the two weeks I’ve been a customer.\nAnd what seems to be the case for VPN software in general, their product is sensitive to PC total security software (BitDefender I found won’t let their Windows app ‘Speed Test’ function work by default – a problem reported by other security software users on ExpressVPN’s web site).\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "28/04/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Ronald,\nThanks for sharing your detailed thoughts with us. With regards to VPNs and compatibility with other security products, the problem usually comes down to firewalls. Security products can take it upon themselves to block the VPN connections, or the firewall rules used by the security product and the VPN can clash (VPNs often use firewalls to prevent DNS leaks). This is no fault of the VPN software, however.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "28/04/2017", "reviewer_name": "Ronald Cameron ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tThanks Douglas. I wasn’t trying to imply VPN vendors are at fault because of incompatibility issues with security software only that VPN users should expect hassles like this to occur. (I had to abandon McAfee security and go to BitDefender with my last VPN in order to resolve an issue.) Note for other BitDefender users… BitDefender has a ‘general rule’ denying ‘incoming ICMP’ and ‘ICMPV6’ traffic that causes the speed test to error out. I am quite alright with disabling my firewall for a few minutes if I want to run this facility.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "01/05/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Ronald,\nThat’s a great tip. Thanks!\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "25/06/2017", "reviewer_name": "Ron ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Ronald,\nExpressVPN user for a while and looking into getting Bitdefender Total Security. Apart from not being able to run the speed test, are there any other collisions between the two programs? Can I keep using ExpressVPN while running Bitdefender without any issues?\nThanks,\nRon\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "27/04/2017", "reviewer_name": "Beckamm ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nI’ve read tons of reviews that prefer ExpressVPN instead of other listed above it because the speeds are good, but in fact connected to US servers they are terrible. I got only around 2Mbps at the best. Really not worth the price and whats are saying about this service\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "27/04/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Beckamm,\nAs you can see from the test results above, this was not my experience.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "28/04/2017", "reviewer_name": "Mike ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHmmmm. Did you connect to the recommended servers or try a speed test? I’ve personally never had any issues when i let the app choose for me.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "27/04/2017", "reviewer_name": "Simmon C. ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nVery reliable app with more server locations than you could ever want, though tbh I only ever use a couple. Still, it’s nice to have.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "21/04/2017", "reviewer_name": "Greta ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nStarted reading about VPNs after the recent elections. Gave this one and try and I’ve been pretty happy so far. Does exactly what it says on the website. Pretty fast too.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "18/04/2017", "reviewer_name": "Samuel ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tGreat mobile app to have, just don’t connect to Google maps when you’re on it. Totally screws everything up for me when i do.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "18/04/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Samuel,\nI am surprised by this as Google maps uses GPS to locate you. Using a VPN shouldn’t interfere with it. Have you contacted ExpressVPN about this issue?\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "17/04/2017", "reviewer_name": "Jody ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nBest VPN I’ve ever used. Seriously. Speeds are great and servers are very reliable.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "11/04/2017", "reviewer_name": "Herman ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nThis app is essential for travellers. Worgs great by instantly securing and all public wifi networks and bypass every firewall network i’ve encountered by far.  Can’t recommend it enough.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "10/04/2017", "reviewer_name": "Henry ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nLove This service. Some people are complaining about Netflix but all you need to do is ask the live chat which server is working. They’re constantly working on unblocking Netflix. Much better than other VPNs.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "05/04/2017", "reviewer_name": "Tonny ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nIf you live in the UK, then you needs this app. Snooper’s Charter is terrifying. This app works great and has been extremly reliable. It’s a simple way to fight back.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "01/04/2017", "reviewer_name": "Anonymous ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tThe speeds are nowhere as advertised. I pay for fiber and my smartphone average download speed is 200mbps. On expressvpn it dropped to 12mbps. That is a significant decrease. Netflix could not be watched by any US location I selected. Worked for the Canada ones. Given how much my family watches netflix, it is not worth the hassle of playing the cat and mouse game.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "03/04/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Anonymous,\nThat is indeed a major slowdown. You can see the results I got in this review. For Neflix, that surprises me somewhat, but as you say, it is a cat-and-mouse game. Did you try the smart DNS instead?\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "29/03/2017", "reviewer_name": "Router User (ASUSWRT Merlin) ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nSolid for the past year on ASUSWRT Merlin Router. Netflix doesn’t work without contacting support to find the correct server. I had one issue with my router and customer support clearly was not technical in their help.  I was able to fix the issue myself. However, I am about to update again because it is so solid.  It just works.  Speeds are down by about 20%.  USA User, focused on Security and stability.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "27/03/2017", "reviewer_name": "Klimer Mat ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nThe reason I signed up was, because I heard they had great speed, great customer support and great uptime. \nTurns out though that their customer support is the worst, they are far from experts and just read from manuals which are similar the articles they already have online. They can’t actually troubleshoot any problems.\nInitially I liked the service and the software, but I’ve been plagued by slow speeds, all servers closest to me perform poorly and 1 doesn’t connect. So I have to choose between low ping and low speed or high ping and high speed. \nThey don’t support 1 single travel router, I still got one and I’m not getting more than 1mbps when its 12mbps normally. Customer support couldn’t do anything to help.\nThe extra price doesn’t get you more sadly.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "27/03/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Klimer,\nVPN “travel routers” are all very slow becasue they simply do not have the processing power to handle VPN encryption/decryption at any speed. This is an issue with the hardware, and is not the fault of ExpressVPN.\nWhat the extra price does gets you is a good smart DNS service, an excellent client that uses first rate encryption and has no IP leak issues, and stealth servers that are effective for users in China. I, personally, have always found speeds range from good to excellent, but I accept that your experience may differ. \nThe customer service staff are not all tech experts, but I have always found that they do know enough to link to relevant online resources, or can refer you through to staff with greater technical expertise (this may cause a delay, but seems fair enough to me – ExpresVPN simply cannot afford to staff its 24/7 hotline with staff who all have degrees in computer engineering!).\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "25/03/2017", "reviewer_name": "Ed Rowe ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nI had a horrible experience with express VPN. \nIt works ok,  sometimes drops but does allow you to use with CBS sports and Sling. \nMy problem is the customer service is horrible.  I used it for a week without problem then started to use it yesterday and it was disconnected with a message to email the billing department with a copy of my credit card and my previous charge was refunded. It said its would take one to two days for verification.   It also said you cannot use the 24 online chat service for verification. Their advertisement is misleading. There is no telephone number to contact. Why they didn`t do this when I purchased the service is a mystery. I`m also not sure why they didn`t email me to ask for verification instead of just stopping my service.  \nI tried the online service anyway and they wrote a person from the billing department would contact me soon. I was trying to watch the NCAA tournament.  They haven`t yet. \nI checked my credit card and their charge was on it and no refund had been issued.  I paid for a service and then couldn’t`t use it.  \nFor the money then service should be much better. It`s the worst example of customer service from a company over the internet I have ever received.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "23/03/2017", "reviewer_name": "Matex ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nFast speeds, great connections, great secrity, measures, what more would you want in a vpn ?\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "20/03/2017", "reviewer_name": "Johnny ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nBest vpn i’ve ever used. Swithced from PIA which i had loved until recently and this one is miles ahead in terms reliability and speeds. You devs are doing an amazin job.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "15/03/2017", "reviewer_name": "Jax ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nWorks on my xbox and ps4. Love it! Helps me play CoD without having to worry about lag. Also have it installed on my android.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "09/03/2017", "reviewer_name": "Traver ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nExpress vpn is the best! Android app works Wonderfully! I’m able to check my IP to see which country I’m in and it helps me access sites that weren’t available before.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "09/03/2017", "reviewer_name": "Zerocool ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tI have tried a few VPNs before and I found ExpressVPN to be the best at the moment. \nI have been using ExpressVPN for 2 years without any problems. Especially in places like China, it’s a great VPN especially when you need to access information which is block by GFW. \nSo each time when I am travelling to China, I will have no trouble accessing anything! Yes it’s expensive but when you are in dire need for some important info outside out China or those countries which blocked some websites, this VPN provider will help me access anything. Plus it rarely drop signal on LTE or disconnect when I am on home WIFI. \nThe only thing which this VPN provider lacks is customisation for users especially PC. I am a Mac user and I do not need any complicated configuration!\n*Disclaimer* – I do not work for ExpressVPN. I am just a satisfied customer.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "02/03/2017", "reviewer_name": "Chris ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nLayout rocks! Sometimes my connection is slow but all i have to do is switch my vpn protocol and then im able to browse fast again. Love how easy it is to use too!\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "28/02/2017", "reviewer_name": "kevin ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tI need to copy files from a client to my computer, catch is the client will only add me to their allow-list if I give them a static IP address (NOT dynamic IP  which can change every few days). Will ‘ExpressVPN’ allow me to do this ?\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "01/03/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi keven,\nNot as far as I know. Please see 5 Best VPNs For Static IPs  for our pick of services that do.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "24/02/2017", "reviewer_name": "ManoL ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nI was always one of thoes who say I’ve got nothing to hide, but I really woke up when I saw how refined ads were getting on social media. I decided to stop giving away that much personal information and expressvpn helped. It’s a very good app and their blog is very well written and informative, too.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "23/02/2017", "reviewer_name": "Gordon ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nLove how ExpressVPN finally added a killswitch on their Windows app. I have it installed on my Android too. The old version used to drain my battery but the newest update runs like sugar.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "22/02/2017", "reviewer_name": "Tony ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nInvest on your privacy, people. Your data is the new currency for companies out there. And you’re getting anything for it. Get a vpn before it’s too late.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "16/02/2017", "reviewer_name": "Mark ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nThey should have an ad on airports “hey, if you going abroad, don’t forget to download a vpn first!”. You don’t want to land on a foreign country without it, trust me. Expressvpn is the vpn you want, and the one you need.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "08/02/2017", "reviewer_name": "Josh ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nThe latest IOS update is really great, I had some complaints before but nevermind, great app.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "04/02/2017", "reviewer_name": "Anonymous ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tI’m just wondering why this review fails to mention ExpressVPN’s automatic “diagnostic sharing” option which shares your data with “third parties” – according to their terms. Maybe it’s because ExpressVPN is paying you for all the advertisements, pop-ups, and 1st place “best vpn” positioning… Do your research people, see the VPN WARNING List.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "06/02/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Anonymous,\n1. All reviews on BestVPN.com are impartial. As we make very clear to advertisers and business partners etc., the only way to get a good review on this website is to run a good VPN service. Even a cursory glance through our reviews should demonstrate that we can be very hard on VPN services if they are not up to scratch. \n2. I do a great deal of research when writing a VPN review. The relevant lines in the ExpressVPN ToS are (emphasis mine),\n“Our software may send diagnostic data to a third party analytics provider for the purpose of identifying connection errors and possible bugs in our application. The information collected is generic in nature and does not contain personally identifying information.” \nNow, I’m sorry, but I do not consider sending anonymized connection logs to a third party to be a major problem. Yes, I know when comes to big data, that “anonymized or “psuedo-anonymised” logs are really no such thing, but assuming ExpressVPN removes the IP addresses of its users from the data, I do not think this presents a major danger. \nOf course, the fact that connection logs exist at all is a danger, and one that I have flagged up in the review.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "02/02/2017", "reviewer_name": "Tyn ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nWorks fine in NY, sometimes it’s a bit slow when I travel abroad, but since it helps me stay up-to-date with all the media I usually check whenever I ago ( especially you know where ), I can’t complain about it.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "31/01/2017", "reviewer_name": "ABC ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nReliability is horrible. Constantly letting me down. I was told by customer support ‘any technology is going to have some problems’. Really? This bad. I would say on an average day (of saying being online for 8/9 hours) I spend 10-15 minutes waiting for it to re-connect, have to try different servers, manually disconnect, and reconnect, etc, etc.\nAnd also a lot of sites (like google, amazon, etc) block certain locations because it’s being used by bots or because they think it is not in the location it’s supposed to be.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "27/01/2017", "reviewer_name": "Tory ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nI use it on my linux, which is actually pretty cool bc I don’t think other vpns would work for it. It really understands the meaning of the word ” accessible “.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "23/01/2017", "reviewer_name": "Donald Hale ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tI use piratebay with utorrent. If I bought this would someone be available to help me through the process of setting it up? I’m a dummy when it comes to understanding anything pc related. I can barely turn my pc on… haha Also, I have windows 7 which works well for me.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "24/01/2017", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Donald,\nExpressVPN has among the best customer support on the market. Contact it via Live Chat, and I’m sure the support staff will be happy to hold your hand during the setup process.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "12/01/2017", "reviewer_name": "Bjor ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tSigned up for a free trial before i traveled to china it really helped during my trip. Get it before your check-in, you won’t regret it.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "24/12/2016", "reviewer_name": "Mike Gilbertsen ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tTried ExpressVPN over a four day period. Somewhat confusing setup. Was not able to get it to work. Exchanged Emails twice, still unable to find the solution. Looking elsewhere.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "27/12/2016", "reviewer_name": "Carol ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHow can it be confusing ?  \nThe article is detailed ( with pictures )\nThey also have a video review https://www.youtube.com/watch?v=iGDqqhmyZ-k\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "27/12/2016", "reviewer_name": "Carol ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tIf you need more instructions on how to install express … https://www.youtube.com/user/expressvpn/videos\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "10/12/2016", "reviewer_name": "Noelle ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tExpress VPN is highly over-priced and their customer service representatives are relentless when confronted with billing issues.  Even when they are in the wrong, they will wear you down by badgering a customer until they have no recourse but find a different vpn servoce.  I feel like I have been interrogated by the CIA.  The service, itself, is top notch, but heaven forbid if you have billing issues.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "10/12/2016", "reviewer_name": "John ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tI use ExpressVPN and I am happy with it.  It is the only VPN I have tried that will stream an entire basketball game without dropping.  And it has increased its security.  Better security, reliable = win.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "04/12/2016", "reviewer_name": "From China ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tUsed this while working overseas in China. I was a grad student and having this service saved me many times when trying to access research online. I connected to the Hong Kong servers mentioned in the article. Had quite a few disconnects but that was more in relation to the connection where I lived. I’ve stuck with ExpressVPN even since returning home as it has come in quite useful for the office when those pesky IT guys want to block things.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "18/12/2016", "reviewer_name": "User in China ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tMe too I’m in China. After lots of free methods to bypass China’s GFW been blocked, I started using paid VPNs. I’ve tried a lot, ExpressVPN is the only one I’ve found so far that’s a always working & allows torrent traffics & unlimited data and speed. Sure sometimes it got difficult connecting, but by retrying and changing locations (and connecting methods) it worked good, even when times that other VPNs been blocked here in China. It one of the more expensive ones, but dada and speed is unlimited is nice, so I don’t have to constantly checking a dashboard to see how much I’ve left.\nI don’t know how this VPN performed on other countries, but it worked fine for me, it’s nice they’ve got clients for just about any platform, make things more convenient. (You can use OS default ways like L2TP to connect too. With or without a client) I’ve tried setting this up on my DD-WRT router and it worked great, making everything go through VPN, without having to set each device up individually. I’ve made two Wi-Fi signals for my house, one with this ExpressVPN and one without, needs a bit of work to set this up, but it’s fun and convenient. Pretty much any DD-WRT router can do it, you don’t have to buy theirs (those routers on ExpiresVPN website), they’re over priced.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "30/11/2016", "reviewer_name": "Daniel ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nI have ExpressVPN installed on every one of my devices in preparation for a Trump presidency when the already fuzzy privacy laws no longer apply.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "01/01/2017", "reviewer_name": "Nonlibtard ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tTil now, with Obama, you enjoyed fantastic privacy. Right?\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "25/11/2016", "reviewer_name": "Isaac ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tI’m confused. In your PureVPN review you blast them for a WebRTC leak, and here you have a WebRTC leak and it’s perfectly fine. This appears to be a double standard.\nExpressVPN in my opinion is completely overpriced. They are NOT the fastest VPN in the world, yet continue to claim to be.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "30/11/2016", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Isaac,\nThe difference is that PureVPN exposes your external IP via WebRTC, while ExpressVPN only exposes your local IP address. You local IP address is only the internal address used to locate resources on your by your LAN, and cannot be used to identify you on the internet. It therefore does not constitute an IP leak.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "24/11/2016", "reviewer_name": "Devon B. ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nDon’t trust VPNs based in Europe/UK/US! Go with something like Express that’s legally incorporated in BVI\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "14/11/2016", "reviewer_name": "Mick ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nIf you’re getting the Netflix proxy error with your VPN then it’s been blocked. I know Express still has a few servers that work.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "14/11/2016", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHui Mick,\nThat is correct.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "10/11/2016", "reviewer_name": "Matt ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nIf you want to get an app that’s not available in your location on Google Play Store, just take out your SIM, connect to a VPN like Express in the location you want, and turn off your GPS. Then open Google Play.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "10/11/2016", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi Matt,\nThanks for the tip. When I have a moment, I test it.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "05/11/2016", "reviewer_name": "lilah ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\twill this work on vista?\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "07/11/2016", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tHi lilah,\nYes. For full instructions, please see here.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "31/10/2016", "reviewer_name": "Karmen C. ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nI set up Express on my Raspberry Pi to use as a mini media center\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "28/10/2016", "reviewer_name": "Dissatisfied User ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\tExpress Vpn is not able to over overcome the geo block in particular for RAI TV in Italy. Having Italian TV is very important to my family. They advertise that they can provide services to Geo blocked countries but admittedly this is currently not the case. I find this particularly disappointing. Further technical support is available however one can spen hours chatting with them and still not be able to resolve issues. They just don’t have the resources to resolve issues in a meaningful and efficient manner. They are polite but not knowledgeable enough to get to the bottom of an issue.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "28/10/2016", "reviewer_name": "Mike ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nExpressVPN manages to hold a stable connection even on 4G LTE. I’m using the iPhone app.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}, {"absolute_url": "https://www.bestvpn.com/expressvpn-review/", "rating": "8.2", "review_title": null, "reviewed_at": "27/10/2016", "reviewer_name": "Douglas Crawford ", "category": "VPN Service", "service_name": "Expressvpn", "review_text": "\n\t\t\t\t\t\nPrice\n\n\n\n\nFeatures\n\n\n\n\nReliability\n\n\n\n\nSpeed\n\n\n\n\nCustomer Service\n\n\n\n\n\nExpressVPN has improved an already very impressive service. Well done.\n\t\t\t\t", "picture_urls": ["https://dqmqbm17xhtln.cloudfront.net/wp-content/uploads/2016/04/ExpressVPN-Logo-320-80-1-1.png.pagespeed.ce.J_zJrLBoT1.png"], "website_name": ""}]}]}, {"scrapping_website_name": "NordVPN", "scrapping_website_url": "https://www.resellerratings.com/store/Nordvpn_com", "response": [{"business_item_data": {"business_type": "Service", "absolute_url": "https://www.resellerratings.com/store/Nordvpn_com", "category": "VPN Service", "name": "NordVPN-VPN Service", "sub_category": "", "picture_urls": [], "original_price": "", "sale_price": "", "availability": "", "specifications": [], "website_name": "NordVPN", "description": ""}, "reviews": []}]}, {"scrapping_website_name": "Nordvpn", "scrapping_website_url": "https://bestcompany.com/vpn/company/nordvpn", "response": [{"business_item_data": {"business_type": "Service", "absolute_url": "https://bestcompany.com/vpn/company/nordvpn", "category": "VPN Service", "name": "Nordvpn-VPN Service", "sub_category": "", "picture_urls": [], "original_price": "", "sale_price": "", "availability": "", "specifications": [], "website_name": "Nordvpn", "description": ""}, "reviews": [{"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "4", "review_title": "I use Nord VPN to surf the Internet.", "reviewed_at": "30/03/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  I like that with Nord my searches are private and my data is not being sold or used without my permission.   Also, they have great customer support.\n\nCons:  Sometime so many people are using it that the servers can be slow even though there are many servers to choose from.\n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "4", "review_title": "Good speeds, but...", "reviewed_at": "29/03/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            \n            Pros: - Once you switch on the browser plugin, you can forget about it and all your traffic can get tunnelled\n- Decent speeds\n- Easy to get started with tunnelling browser traffic\n            Cons: - With Linux you can configure OpenVPN to use NordVPN servers, but it would be nice to have a dedicated app\n- Slow, jaggy experience on Firefox plugin\n- Usability could be improved, for example not forgetting the username in the browser plugin so soon\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "The best VPN choice", "reviewed_at": "27/03/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  NordVPN has a great interface, awesome support across multiple devices, and doesn't have the same service restrictions that a lot of other services have. It's also insanely affordable, especially for the added security it provides. Also I get the fastest speeds when using this product. \n\nCons:  During peak hours or times when there are a lot of users, some of the servers closer to my location become difficult to connect to. But I can easily choose another server, so it's not really a big deal. \n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "4", "review_title": "NordVPN is an easy to use application", "reviewed_at": "26/03/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            \n            Pros: Nord VPN is very easy to use. It connects on startup so there are no issues getting it set up after the first time.\n            Cons: There is really nothing negative to say about an application that works the way it is designed to every time. \n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "Best VPN I've been able to find", "reviewed_at": "22/03/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  I travel a lot, and insecure networks are everywhere.  I've tried lots of different VPNs and have been impressed by some, but NordVPN blows the rest out of the water.\n\nCons:  I wish that it would simply notify me that it had disconnected and not simply continue to relentlessly reconnect.\n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "Affordable product that does just what it needs to do", "reviewed_at": "22/03/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  The price is reasonable, the software will start automatically upon opening your computer, and it allows you to change between servers if you ever need to.  \n\nCons:  There are no cons that I have run into while using this software as it does exactly what I need it to do.\n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "4", "review_title": "VPN that works", "reviewed_at": "16/03/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            \n            Pros: Have had no problems connecting to VPN through NordVPN. Able to do so through my desktop, laptop and mobile phone for secure networks.\n            Cons: Initial set up for my devices were a bit complicated with proxy settings and addresses. Sometimes the speed slows to unusable.\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "A bit expensive but i recommend it", "reviewed_at": "16/03/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  Easy to use interface for the desktop client. Works fine with its mobile devices client too. It's also easy to setup and use and can connect until 6 devices to the VPN.\n\nCons:  You need to purchase  the 3 year package to be able to use it at its full potential and save some money. Other than that no complains.\n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "Great VPN", "reviewed_at": "11/03/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  Nord VPN has been my go-to VPN for quite some time.  The software is easy to use and is super robust.  You get a lot of options for servers worldwide and the servers are stable.\n\nCons:  Nord VPN costs more than other VPNs I have used, but then again you get what you pay for.  I've had more success with Nord VPN than other VPNs.\n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "4", "review_title": "NordVPN is a good software", "reviewed_at": "08/03/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  NordVPN has a good server coverage all over the world. It is easy to setup the software and within a minute you are up running. \n\nOverall:  It allows me to visit sites and services which are blocked when I am travelling outside my home country.\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "Easy to setup and simple to use", "reviewed_at": "08/03/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  Nord VPN is really easy to use and setup. Instantly pretend to be from another country. Great for use when abroad and you want to watch TV from your home country.\n\nCons:  Nothing I thought it was excellent and had no issues with it. Any problems where down to the poor bandwidth available\n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "Fast, Easy to use just a few clicks and you're secured. Good for streaming and downloading.", "reviewed_at": "04/03/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  The price is so cheap for 2 years fast and unlimited bandwidth. It's a PLUS for me.\n\nCustomer support is very professional, they respond to me for 4 hours after I write a letter.\n\nCons:  Monthly payment is too much high. I recommend choosing their star deal.\niPv6 leaking your marks. \n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "Used it on my work systems and it is secure", "reviewed_at": "22/02/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  It keeps data safe and secure by adding protection to internet traffic \nIt handles a high amount of traffic well while keeping it secure \nYou can choose a server of your choice\nThe price is not bad for the protection you get\n\nCons:  It can cause slightly slower internet speeds when browsing and if it disconnects or doesnt connect automatically you can find yourself using internet without the vpn. However if you keep an eye on it its an easy solution\n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "4", "review_title": "If it works it propvides extra security", "reviewed_at": "16/02/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  There is a relatively fast VPN connection giving me amn extra sense of security. The softyware is relatively unintrusive and the interface is clear and simple.\n\nCons:  The software often does not make a connection in itself despite having this turned on in settings. I have noticed that in some cases the VPN does not connect without warning me. Customer service is slow and only uses e-mail. They tend to not read or understand the emails. \n\nOverall:  Extra layer of protection against hackers.\n        \n            \n              Vendor Response\n\n              by NordVPN\n                on February 20, 2018\n\n              Good day Monique, \r\n\r\nWe are really sorry that you have faced these problems with NordVPN. We have live chat support https://nordvpn.com/contact-us/ On the right corner there is a popup with chat sign so you can always reach our tech team. They are working 24/7\n            \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "Solid vpn", "reviewed_at": "15/02/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            \n            Pros: It is so easy to use. Mostly just a click of a button for easy connecting. Theres also an option to connect to a specific server. It shows the server load. It works with netflix.\n            Cons: I don't have many cons, I guess more of suggestions. Maybe making an option to auto-switch if a server has a high load?\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "2", "review_title": "Was good at times...but not always", "reviewed_at": "14/02/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  Easy to use interface for the desktop client. The servers available worldwide looks attractive.  Works fine with its mobile devices client too.\n\nCons:  Many servers are perpetually very congested, and servers uptime is also another issue. Can be very frustrating at times. No point having so many servers when many are down most of the time.\n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "4", "review_title": "Extra security with ease and value for money", "reviewed_at": "19/01/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  The software is easy to setup and use.  It can be installed on many devices and also on my NAS. I can connect 6 devices to VPN so this is quite a lot. because I travel a lot I need to connect to lesser secure networks and NordVPN gives me more assurance that this is less likely to be cracked. \n\nCons:  In order to have the best value for money, you need to buy the software for a 3 year period. But this is cheaper than most other VPN services.\n\nOverall:  Extra security\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "Great product, a little expensive but worth it", "reviewed_at": "18/01/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  NordVPN does not collect logs or other user data, which is especially important in terms of keeping data safe. The connections are secure. They inform you how to connect (and they have a variety of connection options), so it is very user-friendly, even to those who may not have used a vpn in the past. There are tons of servers to connect to, and you have a lot of power in choosing what, where, and how you connect, which is a huge plus and not a feature on other VPNs.\n\nCons:  Obviously internet speed will slow, and some connections seem to be slower than others. This can be fixed by switching connections, but it would be nice if more had faster speeds. They do consistently add servers, however. It is costly, but in the world of VPNs you get what you pay for so it is worth it here. \n\nOverall:  A great VPN that can be used anywhere with public WIFI, and at home. The added security is definitely worth the price, as security is much needed in today's world.\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "3", "review_title": "The price is good and the software works.", "reviewed_at": "16/01/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  The price is the most compelling part of this vpn software.  The software works great on an individual client and does an excellent job without much loss of speed.\n\nCons:  It is not easy to set up on a WRT router so that multiple clients may connect.  A lot of speed is lost after successful set up.\n\n\n        \n            \n              Vendor Response\n\n              by NordVPN\n                on January 17, 2018\n\n              Hey Ken, \r\n\r\nWe understand that sometimes set up can be difficult that's why we have these tutorials: https://nordvpn.com/tutorials/\r\n\r\nThank you for your honest review!\n            \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "One of the reliable providers. combines a number of important factors that motivate to choose it.", "reviewed_at": "16/01/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  Really quality service, the minimum rates, reliability, and security.\nHas a huge amount of servers all over the world.  All connections are secured and encrypted.\nHigh and stable speed. It is possible to create multiple connections.\n\nCons:  The negative aspects are almost not noticed. There's a disconnection but very rarely and not more than half a minute.\n\nOverall:  In my opinion, this service provides the most reliable protection and the connection speed doesn't drop. Good that after payment of services within 30 days you can request a refund if the service did not like.\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "4", "review_title": "It is easy to setup and use and worked really well. I would highly recommend NordVPN", "reviewed_at": "16/01/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  Easy to install and setup, It is friendly and gives me all the protection that I need from a VPN. The price is reasonable.\n\nCons:  NordVPN is not support of IPv6, but I think they will include it soon, it would be a very important option.\n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "4", "review_title": "Manage banking on line is easy and friendly but could be a little faster", "reviewed_at": "16/01/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  It is fast and easy to access not matter where I am and the security vpn help to protect the information and keep it away from been stolen \n\nCons:  Most of bank apps are free you just need to have an account with them so pay for this one is not appealing and put you behind your competition \n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "4", "review_title": "Great Software for Testing our Sites response from different parts of the world", "reviewed_at": "16/01/2018", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  Easy to connect and amazing user interface, its really friendly with developers and regular users. Although our main focus was to test we used it to hide our navigation as well.\n\nCons:  Actually all the options we need are fully satisfied, although we would appreciate an even faster connection response time, perhaps this could be fault of our own internet connection.\n\nOverall:  Excellent software to hide our navigation but mainly to test response time from different parts of the world to our servers.\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "4", "review_title": "It's pretty safe and fast.", "reviewed_at": "28/12/2017", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  It really avoids locks and filters to navigate without problems.Instant access to social websites, messaging applications, P2P services and multimedia content that may be restricted in your country or region\n\nCons:  Allows to be in public connection points with secure and reliable VPN service, traffic is protected every step of the way by using a military level encryption that even a supercomputer can not decipher\n\nOverall:  Powers of anonymity of The Onion Router, and do it with the most advanced security technologies that exist today.\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "The connection is fast and the software is  easy to use. I am 100% happy using it\r\n100% of my satisf", "reviewed_at": "28/12/2017", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  Amazing technical service with no connection problem. Solved quickly and efficiently. No issues using \n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "4", "review_title": "Very good.", "reviewed_at": "28/12/2017", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  I've used several VPN softwares and this one gives me confidence that everything is honest and transparency. \n\nOverall:  I think that financial benefit is one of the most important benefit that I've gotten by using this software.\nI've had some troubles with MAC, but I'm not an expert with MAC so maybe this is the reason why I'm experience such troubles with that.\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "NordVPN is a powerful virtual private network with a number of excellent features", "reviewed_at": "13/12/2017", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  I think it has a variety of servers, including unique secure servers. More than 2,000 servers in diverse locations worldwide says a lot, trust me, I have tried others. Six simultaneous connections. P2P is allowed. Browser applications. And Router protection.\n\nCons:  Price maybe. You can find coupons over there and if you're lucky you can find a decent price. But it's not super expensive.\n\nOverall:  While traveling I like to feel safe over unsecured locations.  Peace of mind is priceless.\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "4", "review_title": "I've used NordVPN for a about a year and I love the ability to use different types of servers. ", "reviewed_at": "30/11/2017", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  The ability to easily choose servers and server types is a big win. Plus NordVPN constantly is adding new servers to reduce load and improve speed! \n\nCons:  I have a few lower use servers in my favorites list and they sometimes get shut down when traffic is too low. The prompt to upgrade to a new version a bit invasive in my opinion. \n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "As far as I am concerned, this is the best VPN software available.", "reviewed_at": "14/11/2017", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  Easy to use VPN that promises to never keep logs and continually provides updates. Military grade encryption, a slew of VPN options (Onion, Onion over VPN, etc), and an incredibly large number of servers! I am always able to quickly connect to a fast server whether it be on my phone, computer, raspberry pi, etc).\n\nCons:  If you don't run Nord VPN on startup, it can take a little bit longer than I would expect to load and connect to a server (only on PC) but really, that's just due to my personal preference on limiting startup applications to only the essentials. \n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "4", "review_title": "Very high value  for money", "reviewed_at": "09/11/2017", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  NordVPN offers several features to give a good user experience. First off, they do not keep logs and do not collect user data. Which is often a primary usability constraint, combined with the secure connection. \nNordVPN offers a wide range of connectivity options. Through their own applications but also through the widely used openvpn protocol. And for all their connectivity options there are extensive walkthroughs available on how to set up the connection.\n\nCons:  The use of the VPN will induce a reduction in internet speed. Even though this is inevitable with the use of a VPN and the accompanying encryption. Sometimes switching to a different server will improve the internet speed.\nMaybe a con could be that the help articles are only available in English.\n\nOverall:  It provides a safe environment for all your activities over the internet, even at locations where you cannot completely trust the internet connection itself, no matter if it is on your laptop or your smartphone. This gives a safe feeling and relieves you from working.\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "Amazing user interface", "reviewed_at": "19/09/2017", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  Fast connection, fast internet, great interface, super quick client support. I've bought it at a great price.\n\nCons:  There are some countries where the connection is pretty slow. If they would improve some of the south American, would be even greater\n\nOverall:  I can watch US netflix! Also to visit some foreign sites i'm not able to do without a VPN. Fast connections to most of the locations\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "Safety & Security using open wifi access points", "reviewed_at": "18/09/2017", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  This gives me peace of mind when I am out and using WiFi points in coffee shops and in airports. While they can sell your internet history as easily as the internet service provider you use at home but I have a little more confidence in them since I'm paying for the service.\n\nCons:  Connecting to the VPN does slow your internet access down, getting around 100 MBps at home, and 45MBps when running through US VPN. For me, the items that I would use the VPN for are not big data consumers, like Banking and some work related access. Don't really see a need to access out of the country currently, I have heard of some people being able to access different content on Netflix, but not something I do. When watching Netflix or Hulu I'm not connecting to the VPN\n\n\n        \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}, {"absolute_url": "https://www.capterra.com/p/166743/NordVPN/", "rating": "5", "review_title": "Seamless VPN over multiple devices", "reviewed_at": "12/09/2017", "reviewer_name": null, "category": "VPN Service", "service_name": "Nordvpn", "review_text": "\n            Pros:  All the security a VPN should offer, multiple countries and servers, and good integration across PC, Mac, android and ios.\n\nCons:  This is very challenging as to this point I have not found anything great. If I had to be picky I would say that I would like to be able to see all the servers together - when you select the obscurated server option you cannot see the others, so it forces you to switch back and forth.\n\n\n        \n            \n              Vendor Response\n\n              by NordVPN\n                on September 14, 2017\n\n              Andrew, thank you very much for your positive feedback. We are really happy that our services suits your needs! \n            \n      ", "picture_urls": ["https://cdn0.capterra-static.com/logos/150/2116219-1504255055.png"], "website_name": ""}]}]}, {"scrapping_website_name": "Binance", "scrapping_website_url": "https://www.forexbrokerz.com/brokers/binance-review", "response": [{"business_item_data": {"business_type": "Service", "absolute_url": "https://www.forexbrokerz.com/brokers/binance-review", "category": "Cryptocurrency Excahnges", "name": "Binance-Cryptocurrency Excahnges", "sub_category": "", "picture_urls": [], "original_price": "", "sale_price": "", "availability": "", "specifications": [], "website_name": "Binance", "description": ""}, "reviews": [{"absolute_url": "https://www.forexbrokerz.com/brokers/binance-review", "rating": "2", "review_title": ["Scam - Never received my money", "BNB transcation not honored - IMO BNB is a scam", "$5000 of Money taken and Support requests submitted return automatically as ", "It's in the fractions...", "Waiting for 2FA code to be reset", "Binance trades", "Stay away", "Got hacked / money stolen", "I lost my 2FA password ", "It is a scam", "Legit", "Incompetent", "Scam", "Scam"], "reviewed_at": "02/02/2018", "reviewer_name": "David Huizar", "category": "Cryptocurrency Excahnges", "service_name": "Binance", "review_text": "BNB contract address 0xb8c77482e45f1f44de1745f52c74426c631bdd52\r\n\r\nBelow is the successful transaction in which BNB did not transfer the coin. \r\n\r\nhttps://ethplorer.io/tx/0x3485b4395fe4b4f9e213033e8e26855e48f79be30cf98d19d1bc4564d448907d\r\n\r\nI have repeated contacted Binance yet they do not honor their address: [email protected]\r\n\r\n\r\n", "picture_urls": ["/files/1507118191Binance logo.PNG"], "website_name": ""}, {"absolute_url": "https://www.forexbrokerz.com/brokers/binance-review", "rating": "0", "review_title": ["Scam - Never received my money", "BNB transcation not honored - IMO BNB is a scam", "$5000 of Money taken and Support requests submitted return automatically as ", "It's in the fractions...", "Waiting for 2FA code to be reset", "Binance trades", "Stay away", "Got hacked / money stolen", "I lost my 2FA password ", "It is a scam", "Legit", "Incompetent", "Scam", "Scam"], "reviewed_at": "19/01/2018", "reviewer_name": "Brett SMITH", "category": "Cryptocurrency Excahnges", "service_name": "Binance", "review_text": "I am devastated by the apparent theft of $5000 of tokens during trading with Binance. These tokens are shown as held in an ethereum wallet using etherscan but invisible when viewed on the Binance account.\r\nWorse now, is months of non reply to support requests for help and now any more i send automatically show as \"soled\" in the status column.\r\nThis is straight out theft of my money and 50,000 Tron tokens and some CTR etc.\r\nWhat can I do about this ??? , I have screenshots that show all tokens sitting in the eth wallet and support requests showing solved the moment i submit them. I am sick with disgust.", "picture_urls": ["/files/1507118191Binance logo.PNG"], "website_name": ""}, {"absolute_url": "https://www.forexbrokerz.com/brokers/binance-review", "rating": "2", "review_title": ["Scam - Never received my money", "BNB transcation not honored - IMO BNB is a scam", "$5000 of Money taken and Support requests submitted return automatically as ", "It's in the fractions...", "Waiting for 2FA code to be reset", "Binance trades", "Stay away", "Got hacked / money stolen", "I lost my 2FA password ", "It is a scam", "Legit", "Incompetent", "Scam", "Scam"], "reviewed_at": "19/01/2018", "reviewer_name": "Eddie", "category": "Cryptocurrency Excahnges", "service_name": "Binance", "review_text": "When you trade in Binance, it \"rounds off\" the amounts you can trade. The leftover fractions stay behind, and recovering this dust is almost impossible. One way to do it would be again to deposit the coin in question and to juggle the amount deposited and the price, taking the fee into account, so as to leave nothing, or next to nothing, after a new transaction. Using BNB will reduce your fees, but it will not take care of this problem. Those bits add up, especially if you want to experiment with the odd exotic coin. I've learned my lesson and I'm staying away.", "picture_urls": ["/files/1507118191Binance logo.PNG"], "website_name": ""}, {"absolute_url": "https://www.forexbrokerz.com/brokers/binance-review", "rating": "3", "review_title": ["Scam - Never received my money", "BNB transcation not honored - IMO BNB is a scam", "$5000 of Money taken and Support requests submitted return automatically as ", "It's in the fractions...", "Waiting for 2FA code to be reset", "Binance trades", "Stay away", "Got hacked / money stolen", "I lost my 2FA password ", "It is a scam", "Legit", "Incompetent", "Scam", "Scam"], "reviewed_at": "11/01/2018", "reviewer_name": "Ch S Varma", "category": "Cryptocurrency Excahnges", "service_name": "Binance", "review_text": "Whenever I tried to enter GAuth Code I am getting a 2FA Failed. It was working for few days. I have been sending so many emails to Binance and they have autoreplying with 2 links all the time. These links take us no where. I have submitted all my documents for resetting 2FA code. Its more than 3 days now. I don't know if I will get back my coins worth more than 2K. I will wait for few more days before I draw any conclusion on them. Binance has zero customer service so far. Especially for people living in US its going to be a major shock for zero customer service. Hope Binance fix all their site traffic issues and resolve all the customers problems. I hope they raise above the customers expectations and don't burn their golden egg laying duck for greediness. \r\nRegards\r\nVarma ", "picture_urls": ["/files/1507118191Binance logo.PNG"], "website_name": ""}, {"absolute_url": "https://www.forexbrokerz.com/brokers/binance-review", "rating": "7", "review_title": ["Scam - Never received my money", "BNB transcation not honored - IMO BNB is a scam", "$5000 of Money taken and Support requests submitted return automatically as ", "It's in the fractions...", "Waiting for 2FA code to be reset", "Binance trades", "Stay away", "Got hacked / money stolen", "I lost my 2FA password ", "It is a scam", "Legit", "Incompetent", "Scam", "Scam"], "reviewed_at": "23/12/2017", "reviewer_name": "George", "category": "Cryptocurrency Excahnges", "service_name": "Binance", "review_text": "Am a new user in binance but the many experiences of people not being able to withdraw the money after trading is not encouraging at all. The few not well thought out arrogant answers by the binance team are totally not helping the situation either.\r\nPlease,kindly but urgently address the many issues raised by the several complaints.\r\nWe need to be assured that our funds are safe.", "picture_urls": ["/files/1507118191Binance logo.PNG"], "website_name": ""}, {"absolute_url": "https://www.forexbrokerz.com/brokers/binance-review", "rating": "3", "review_title": ["Scam - Never received my money", "BNB transcation not honored - IMO BNB is a scam", "$5000 of Money taken and Support requests submitted return automatically as ", "It's in the fractions...", "Waiting for 2FA code to be reset", "Binance trades", "Stay away", "Got hacked / money stolen", "I lost my 2FA password ", "It is a scam", "Legit", "Incompetent", "Scam", "Scam"], "reviewed_at": "22/12/2017", "reviewer_name": "Amir Henin", "category": "Cryptocurrency Excahnges", "service_name": "Binance", "review_text": "I got an email from binance saying that my IPA siting been changed and if I did not do that I should deactivate my account and contact binance I check my account and sure my XRP coins disappeared so I deactivated my account the problem that I been trying to contact binance but no reply multiple emails and multiple requests and no reply \r\nMy account is locked and I have no access to my funds\r\nI got screwed stay away", "picture_urls": ["/files/1507118191Binance logo.PNG"], "website_name": ""}, {"absolute_url": "https://www.forexbrokerz.com/brokers/binance-review", "rating": "2", "review_title": ["Scam - Never received my money", "BNB transcation not honored - IMO BNB is a scam", "$5000 of Money taken and Support requests submitted return automatically as ", "It's in the fractions...", "Waiting for 2FA code to be reset", "Binance trades", "Stay away", "Got hacked / money stolen", "I lost my 2FA password ", "It is a scam", "Legit", "Incompetent", "Scam", "Scam"], "reviewed_at": "21/12/2017", "reviewer_name": "Andi", "category": "Cryptocurrency Excahnges", "service_name": "Binance", "review_text": "Two days ago, someone with an IP from UK (not me) was able to log into my account, changed the API and took all my coins. I have Google Authentificator and a strong Password. The link on the E-Mail I received to disable the account while this happened didnt work at all. \r\nPlus I got an open support ticket and no answer since then... (#221188)\r\n\r\nWhat can I do?\r\nI feel highly scammed and robbed and dont trust this site at all...!", "picture_urls": ["/files/1507118191Binance logo.PNG"], "website_name": ""}, {"absolute_url": "https://www.forexbrokerz.com/brokers/binance-review", "rating": "4", "review_title": ["Scam - Never received my money", "BNB transcation not honored - IMO BNB is a scam", "$5000 of Money taken and Support requests submitted return automatically as ", "It's in the fractions...", "Waiting for 2FA code to be reset", "Binance trades", "Stay away", "Got hacked / money stolen", "I lost my 2FA password ", "It is a scam", "Legit", "Incompetent", "Scam", "Scam"], "reviewed_at": "19/12/2017", "reviewer_name": "Vince", "category": "Cryptocurrency Excahnges", "service_name": "Binance", "review_text": "STAY AWAY FROM BINANCE! They are THIEVES! I recently replaced my Iphone so I lost my 2FA password. I sent their support team all my identification that they request to reset the 2FA and all they keep doing is replying back with the same email over and over again asking for identification for resetting the 2FA. Basically, if you lose your password, you lose your money with Binance. This is happening to many people who have lost their 2FA password. Just do a search to see.  ", "picture_urls": ["/files/1507118191Binance logo.PNG"], "website_name": ""}, {"absolute_url": "https://www.forexbrokerz.com/brokers/binance-review", "rating": "7", "review_title": ["Scam - Never received my money", "BNB transcation not honored - IMO BNB is a scam", "$5000 of Money taken and Support requests submitted return automatically as ", "It's in the fractions...", "Waiting for 2FA code to be reset", "Binance trades", "Stay away", "Got hacked / money stolen", "I lost my 2FA password ", "It is a scam", "Legit", "Incompetent", "Scam", "Scam"], "reviewed_at": "17/12/2017", "reviewer_name": "jellesma", "category": "Cryptocurrency Excahnges", "service_name": "Binance", "review_text": "Binance is a scam site thy let you dispose bitcoins ore money but for withdrawals you must use Two-Factor Authentication (2FA) but if you will create IT IS NOT POSSIBLE SMS only for Chinese telephone number and Google Authentication is not working whit errors * Invalid e-mail address of failed binding.\r\nYou cannot Withdrawals from on this exchange site.\r\nOre first make Two-Factor Authentication (2FA) working and the do a deposits\r\n", "picture_urls": ["/files/1507118191Binance logo.PNG"], "website_name": ""}, {"absolute_url": "https://www.forexbrokerz.com/brokers/binance-review", "rating": "6", "review_title": ["Scam - Never received my money", "BNB transcation not honored - IMO BNB is a scam", "$5000 of Money taken and Support requests submitted return automatically as ", "It's in the fractions...", "Waiting for 2FA code to be reset", "Binance trades", "Stay away", "Got hacked / money stolen", "I lost my 2FA password ", "It is a scam", "Legit", "Incompetent", "Scam", "Scam"], "reviewed_at": "16/12/2017", "reviewer_name": "Gordon Mcgee", "category": "Cryptocurrency Excahnges", "service_name": "Binance", "review_text": "i don't know what these other people are talking about i have been trading on there for a while with over 1000$ worth im able to buy ripple , btc , eth and transfer in and out without any problem", "picture_urls": ["/files/1507118191Binance logo.PNG"], "website_name": ""}, {"absolute_url": "https://www.forexbrokerz.com/brokers/binance-review", "rating": "22", "review_title": ["Scam - Never received my money", "BNB transcation not honored - IMO BNB is a scam", "$5000 of Money taken and Support requests submitted return automatically as ", "It's in the fractions...", "Waiting for 2FA code to be reset", "Binance trades", "Stay away", "Got hacked / money stolen", "I lost my 2FA password ", "It is a scam", "Legit", "Incompetent", "Scam", "Scam"], "reviewed_at": "16/12/2017", "reviewer_name": "Stephen", "category": "Cryptocurrency Excahnges", "service_name": "Binance", "review_text": "Sent Bitcoin Cash to the to the bitcoin cash wallet, never arrived Idiots have used the same BTC wallet for the bitcoin cash its gone for good. Avoid these Morons!!", "picture_urls": ["/files/1507118191Binance logo.PNG"], "website_name": ""}, {"absolute_url": "https://www.forexbrokerz.com/brokers/binance-review", "rating": "9", "review_title": ["Scam - Never received my money", "BNB transcation not honored - IMO BNB is a scam", "$5000 of Money taken and Support requests submitted return automatically as ", "It's in the fractions...", "Waiting for 2FA code to be reset", "Binance trades", "Stay away", "Got hacked / money stolen", "I lost my 2FA password ", "It is a scam", "Legit", "Incompetent", "Scam", "Scam"], "reviewed_at": "10/12/2017", "reviewer_name": "Eugene", "category": "Cryptocurrency Excahnges", "service_name": "Binance", "review_text": "Been trying for 3 days to withdraw $200 worth of coins I purchased. Tech support is non-existent. When they do reply its with suggestions I tried dozens of times over and over again. to no avail, 2FA Binding error. Don't send your money over there.", "picture_urls": ["/files/1507118191Binance logo.PNG"], "website_name": ""}, {"absolute_url": "https://www.forexbrokerz.com/brokers/binance-review", "rating": "16", "review_title": ["Scam - Never received my money", "BNB transcation not honored - IMO BNB is a scam", "$5000 of Money taken and Support requests submitted return automatically as ", "It's in the fractions...", "Waiting for 2FA code to be reset", "Binance trades", "Stay away", "Got hacked / money stolen", "I lost my 2FA password ", "It is a scam", "Legit", "Incompetent", "Scam", "Scam"], "reviewed_at": "09/12/2017", "reviewer_name": "Dan  M ", "category": "Cryptocurrency Excahnges", "service_name": "Binance", "review_text": "Deposited 300 from Coinbase to Binance now can not login to Binance.   Attempted  to  contact  multiple times,no reply.  SCAM ", "picture_urls": ["/files/1507118191Binance logo.PNG"], "website_name": ""}]}]}]}