{"business_units": [{"response": [{"reviews": [{"category": "Hosting Service", "rating": "4.0", "reviewed_at": "10/08/2015", "review_title": null, "service_name": "NordVPN", "reviewer_name": "A R.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        8/10/2015\n    \n\n    \n\n        \n                    I started with Fat Cow recently and found it to be user friendly and available. Not sure what everyone is upset about as I have had no issue with tech support (yet).....They have been responsive, and so far the site meets my needs.Will move ahead with cautious optimism, but frankly, I don't anticipate any problems. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "31/03/2018", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Hayley E.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        3/31/2018\n    \n\n    \n\n        \n                    I hate this company so so so much. I began using FatCow in 2010, when they were still in the US and using wind power. They were so good back then. I had the same domain with them since 2010.Fast forward to 2018. I had my domain set to auto-renew each year, and maybe I turned it off or there was a glitch this year, I'll never know what happened. My domain expired on Jan 26, 2018. I got the email from FatCow saying it expired, so I logged in on January 29th to renew it. All went well, I paid for it, they charged me. I paid for domain privacy then as well. I used my domain up until March 20th, when abruptly I saw I could no longer login and there was now a cached version of my site on there. I totally assumed my website had been hacked. I renewed it and paid for it in January and everything had been working fine for 2 months. I contacted FatCow and they told me the domain now was registered under GoDaddy. After much back and forth (well mostly forth, they never responded. I had to talk to Indians on the phone that couldn't tell me a thing), I was told they sold me domain THE SAME DAY it expired. No grace period, no redemption period. They really do not care about you or your business together and will try to take advantage of you as soon as an opportunity arrives.I have a new domain now, but am only getting about 1/3 the traffic to my ecommerce site I normally would get. The squatter that bought my domain says he'll sell it to me for $900. I will never give him the satisfaction. FatCow screwed me over, and they could care less. Your domain is not safe with them. DON'T COME NEAR THIS COMPANY. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "01/12/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Ellen E.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        12/1/2017\n    \n\n    \n\n        \n                    Just wait A. R. you've been warned. They have been billing me for years yet I haven't been able to access my website. The first year I had service but when Eig took over Netfirms i had no more access. Tried numerous times to cancel even changed credit cards but they still found a way to keep using old credit cards and renewing me. Lost a lot of business since nobody could link to my website. Is there any legal action to take against this company that continues to get away with fraud scamming and hacking into our financial accounts?Is there any legal recourse to be taken against online corruption especially with a company such as EIG that has bought up all these other smaller hosting co. and since then has a long history of fraudulent activities??Tired of reading only grievances   Would like some helpful information on how to get reparation and protection from online companies that have unlawful practices and take advantage of their customers. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "23/11/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Chad V.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        11/23/2017\n    \n\n    \n\n        \n                    I was extremely happy to have found a hosting company that had what I was looking for at an extremely cheap rate. This is where my warning bells should have gone off.Warning #1 if you are planning on hosting anything more than a single page this is not the hosting platform for you. There support team is a darn joke and most of them don't speak anything more than 5 words of the English language. Warning #2 If you do have a wordpress site that has a few pages to it then good luck with it loading when more than 1 person is trying to go to your domain at the same time. It just wont happen.Warning #3 when you tell the support person that what you are experiencing is not on your end but is in fact on their end because of the error page you are getting they get defensive and then ask you if you have tried to do the task in a different browser. I had to call back 3 times and explain myself 3 different times for a lady to tell me this error message is because the file you are trying to download is too large you need to download the file in pieces. (I was trying to download my site backup)Warning #4 STAY AWAYWarning #5 don't cause yourself or your it guys the level of headache that will come with by having to deal with these guys.  Warning #6 their mail central portal has a document that says how to access your domain email by going to yourdomain.com/mailadmin but yet when you type in your domain email and the password it just goes into a spin cycle when you call support depending on who you get you might get an answer of oh it works for me, or of that is not a feature that is supported, or my personal favorite you must be typing in your password wrong.Warning #7 they do not have a audit trail of the hosting at all and heaving for bid if you give anyone access to the back end of your hosting site to do work on the database and they lock you out the support team has to email someone in the advanced support asking for you to be made whole again. They do not have the ability to transfer you to anyone in their department or anywhere else outside of their line. Warning #8 if you ask for a supervisor good luck they will tell you no one is available and then hang up on you.My advice as someone who has lots of experience dealing with this pain over the last 2 months is to run like the wind from this company. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "24/07/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Jim W.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        7/24/2017\n    \n\n    \n\n        \n                    I have to chime in here.  All of these one star reviews are actually too generous.  This company have no support or management of any kind.  I currently am trying to edit a clients website and the files will not edit.. I can't make any changes.. something is wrong over there.  There is no phone number to call and the online help window isn't working!!  I'd appreciate if anyone can tell me about a good hosting company that they like so I can move all of my files away from this nigh \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "03/12/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Spike S.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        12/3/2017\n    \n\n    \n\n        \n                    The posts here should let anyone looking at FatCow that it's the wrong place to be looking. I had massive increases in hosting cost - I wasn't paying enough attention to the auto billing to realize how massive. In addition, they were charging me for backup and security on a domain I hadn't owned for three years. And their support went from great when I signed up (early 2000s) to horrific. Best to avoid. In case anyone wants to know, I am now with InMotion on the recommendation of friends and have had excellent experience with them. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "13/10/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Greg F.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        10/13/2017\n    \n\n    \n\n        \n                    WARNING # 1 - Do not, ever, give FatCow your credit card number or even worse your bank account number, they will just take what they want with no excuses and there is nothing you can do.FatCow Billing Practices are predatory, they are not \"mistakes\" they know exactly what they are doing and they are stealing money from their clients. If you give them a credit card they will just take money that you don't even owe and call it a \"billing mistake\" if you complain. Most people don't complain so they just keep the money.USE A PREPAID DEBIT CARD ONLY! If you don't they will just take your money, FatCow is not an honest company, they are thieves, multi-million dollar thieves.WARNING #2 - The FatCow Tech Support is almost non-existent, they are outsourced to India and The Philippines, none of them know what they are doing, they barely speak English, and they don't give a damn about their clients.WARNING #3 - Don't believe their \"low pricing\" options, that is only for the first year, all the prices balloon up once you have your websites hosted there, because they know that most people won't bother to move because it is quite a hassle (but not impossible).WARNING #4 - FatCow is owned by Endurance International Group (EIG), and they own just about every major other major hosting company in the U.S. (see below), and they are all the same, they are ALL TERRIBLE.* 2slick.com* AccountSupport* A Small Orange - 2012* ApolloHosting* Arvixe - 2014* Berry Information Systems L.L.C.* BigRock* BizLand* BlueDomino* Bluehost - 2011* Directi - 2014* Dollar2Host* Domain.com* DomainHost* Dot5Hosting* Dotster* easyCGI* eHost* EntryHost* Escalate Internet* FastDomain* FatCow* FreeYellow* Glob@t* Homestead* HostCentric* HostClear* HostGator - 2012* Hostnine - 2012* HostMonster - 2011* Host with Me Now* HostYourSite.com* HyperMart* IMOutdoors* Intuit Websites* iPage - 2009* IPOWER/iPowerWeb* JustHost - 2011* LogicBoxes* MojoMarketplace* MyDomain* MyResellerHome* NetFirms* Networks Web Hosting* Nexx* PowWeb* PureHost* ReadyHosting.com* ResellerClub* Saba-Pro* SEO Hosting* Southeast Web* Spry* StartLogic* SuperGreen Hosting* Typepad* USANetHosting* VirtualAvenue* VPSLink* WebHost4Life* webhosting.info* Webstrike Solutions* Webzai - 2014* Xeran* YourWebHosting* Any buying more every day \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "06/09/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "L L.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        9/6/2017\n    \n\n    \n\n        \n                    Terrible product. Bad service. Been trying to transfer my site and domain elsewhere for over a year and they have really screwed me. Have to make a whole new URL or sign up with them again. Forget about it, even though it seems like this is they way it goes everywhere, nowadays. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "27/12/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Frank K.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        12/27/2017\n    \n\n    \n\n        \n                    Stay away!I am going to review their customer service.  I've been their customer for 4 or more years.Not sure how that happened (probably my mistake), but my domain was set to manual renewal. I realized that when my email account stopped working, it was the date of expiration. When i found out, I renewed the domain right away, went through the whole check out process and received the message saying the domain will be active in 24-48 hours. Since i needed to access my emails i contacted FatCow online support when their support rep told me that i actually need to pay extra $160 to make them to activate my domain again. When I was not happy about it, because there was nothing about it while renewing the domain, they started developing me and telling me there is nothing they can do and it is my fault and i should pay attention to such things, basically they don't care. I have a feeling that FatCow is one of those companies, that are just waiting for customer to make some kind of mistake so they can charge them for whatever fees they make up. Even though I supposed to monitor my domain renewals, I still think it is unfair that i was actually able to go through the renewal process and only found out that they want extra money after visiting their customer \"support\" department. I will never pay for any service to them again and I will recommend everyone to stay away. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "29/06/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Matt L.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        6/29/2017\n    \n\n    \n\n        \n                    Shady business practices, no refund policy for an auto-renew that i clearly did not want.  The customer service team are obviously not in the US, so they don't care about customer service as much.  Nothing they do ever helps.  I've called to cancel before, but the auto-renew NEVER EVER GOES AWAY!!!!The warning e-mails that were sent to my actual e-mail address led me to believe that I needed to do nothing in order for my account to expire, but by the time I was informed of the charge, it was well ahead of the renew date, so I did not get my money back, and according to them, domains work on a non-refund policy (which I have never heard of, and think is completely false and a way for you to trick people out of money).  I even changed my debit card # to avoid them renewing me (because they make it nearly impossible to opt out of auto-renew), but some how they got a hold of my new #.The real warning e-mails that told me that I had to stop the auto renewal conveniently for them was sent to an entirely different email address.Why do you even send out those warning e-mails if your going to renew me anyway?  The e-mail should be honest and tell me that I'm going to be charged if I do nothing (I'm a web developer and I know thats a VERY easy thing to do.)NEVER do business with these people, stick with AWS or Heroku. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "14/04/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Melanie P.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        4/14/2017\n    \n\n    \n\n        \n                    Aside from cheap initial cost followed by a 600% price increase... Have opened 4-5 trouble tickets on \"webalizer control panel will not save\". They closed all the trouble tickets but the problem still persists.They have off-shored \"support\", which makes current \"support\" non-existent. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "05/09/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Barry R.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        9/5/2017\n    \n\n    \n\n        \n                    Wanted to add SSL to my site, hosted at FatCow. Worst experience ever. I already have my SSL certificate, purchased through Comodo, but FatCow only allows certificates that are purchased through them. Unbelievable. I've never had that problem with any other hosting company, and I've used a few in my time. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "26/07/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Andrey G.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        7/26/2017\n    \n\n    \n\n        \n                    Horrible experience! All my websites are down for a week. FatCow sent me email at midnight \"We have received the complaint from the third party that a large amount of spam registrations being generated through the website\"  (I had JUST 12 registrations on website for last week) and 5 hours after that they did blocking of my account. I had 5 websites on my account and they blocked all of them without real reason. I had contact support multiple times. This is worst and extremely unhelpful support in my life. They have no qualification for this industry. They have no answers for any questions. They can only make ticket for you but nobody will take care about your ticket. I had a lot of experience with multiple hosting companies since 1998 and this is worst case in my life. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "05/02/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Paul B.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        2/5/2017\n    \n\n    \n\n        \n                    Horrible support. Have problems with my web page and they give me a ticket #. I ask will you call me back when its fixed. They respond NO we dont do that we will send you and email. I get a email saying the problem is fixed and it isn't. then I call back and explain its not fixed and they tell me it is. I tell them the problem happens when you use a mobile phone, and the tech response is we only use desk tops we dont have mobile phones. I then ask who I can file a complaint with and he says let me check.... then he gets back on the phone and says you can leave your complaint with me- I would not recommend FatCow to anyone \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "13/11/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "E O.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        11/13/2017\n    \n\n    \n\n        \n                    These guys will take your credit card info and charge it to infinity.  Beware if you have AMEX and old account numbers carry over.  My bill increased from $76 to over $300 within 4 years without any notification (no snail mail or email).  I understand the service price increases but that's over a 400%!!!  Guy on the phone was completely unsympathetic, saying I could've viewed the bill on the portal.  That may be true but literally everyone else from utilities to insurances to CCs email me a bill every month.  Not sending a bill is enough of a reason to cancel.  Regardless, I DID CHECK the portal about a week ago and made sure nothing was ready to renew, but was still charged $17 to renew a domain I haven't used since 2010.  Whatever they did was super deceptive.  I had him delete my entire account on the spot, which I guess is the only way not to renew.  It's a bait and switch service, no customer support, DO NOT EVER USE!! \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "3.0", "reviewed_at": "16/12/2016", "review_title": null, "service_name": "NordVPN", "reviewer_name": "John C.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        12/16/2016\n    \n\n    \n\n        \n                    The picture below speaks for itself.  FatCow bounced my email for insufficient space with no warning to me to increase my mailbox capacity. \n                        \n        \n                \n                        \n        \n                \n\n            \n                    \n\n            \n\n\n\n                \n                No contact for FatCow\n        \n\n\n            \n            No contact for FatCow\n    \n\n    \n\n                \n\n        \n\n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "30/11/2016", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Carrie R.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        11/30/2016\n    \n\n    \n\n        \n                    Massive incompetence.  Nearly impossible to get through to anyone except through live chat, amateurs who keep escalating the issue that does not get resolved.  I have not been able to update my website for months, then I could not publish it.  They said they published it.  It is not my website.  This morning, I insisted that they remove it immediately. It is still up.I have lost time, money, and business because of their incompetence. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "25/07/2016", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Pee P.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        7/25/2016\n    \n\n    \n\n        \n                    Avoid them like the plague. Scam. They will lure you in with super cheap hosting, then jack up the prices on everything. My web hosting for last year was $10. They just renewed my plan, but this year the hosting is $160!!!Currently trying to get a refund. These guys are clowns. CS is non-existent. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "25/03/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "T N.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        3/25/2017\n    \n\n    \n\n        \n                    This company is terrible. My advice, just don't use them.  Their automatic renewal service is all about them. To give you an idea of my woes.... I canceled back in Sep 2016.  I finally received my refund in full, 3/25/2017.  This is after I recruited the assistance of my bank and the BBB.  This company is corrupt, doesn't care about customer service. I had a cancellation letter absolving me of all cost and they still didn't want to issue me a refund. If they did, it was in pieces.  In one instance, they said renewals are nonrefundable. I would never recommend them. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "22/04/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Matt M.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        4/22/2017\n    \n\n    \n\n        \n                    Yet another 1-star review for FatCow...what else is new, right? I am shocked by how inept they are. First, everything these people are saying about the service & performance is accurate. But I'm here to talk about the ransom and hostage situation they perform when you try to get your refund from them. I cancelled my hosting account. It took me forever, but they finally agreed to refund 1 yr of my unused hosting since I paid for a 2-yr plan and cancelled after 1 yr. Well I get an email from them confirming my refund has been processed. I wait 5 days, 10 days, it's nowhere. I just got off the phone with them, speaking to multiple people for almost an hour. Basically, they sent the refund (SUPPOSEDLY) to an old card that I had that must have been expired. They told me many times \"they did their part\" by issuing the refund. I have no proof of the refund, and no way to confirm they did. They gave me the last 4 digits of a card that I don't know what it is. Mind you, nobody ever asked me to CONFIRM my card info they were refunding it to. Instead, they claim they issue a refund, I don't get it, they claim they sent it to a card (which is not active so no idea they can actually claim that), and I don't have my money. This company is a complete sham. They don't even let you speak to a supervisor or billing specialist who is the one telling me they can;t do it. It's simple...reverse the supposed credit, I give you the correct CC#, and do it. I can't imagine how many people they take like this day in and day out. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "23/06/2015", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Clay C.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        6/23/2015\n    \n\n    \n\n        \n                    Burn this place to the ground. They should not be allowed to do business. 7 months ago Fatcow made a mistake and lost my website. I did not complain, I simply asked them to rebuild it. You would think that a dot com would have no problem doing such a thing. Aprox. 4 months of pleading my case they finally listened to those \"some calls may be recorded tapes\" and whalla, they realized that it was indeed their mistake. Now, 3 more months have gone by since then. They agreed to rectify their mistake but have proceeded to do nothing. They have dis-respected my time, made countless empty promises and have missed meetings. I can not believe that this place is allowed to do business. BE AWARE, Fatcow Scam. Zach Palmer - Executive Response Claudia O. - Executive Response Eric White \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "27/02/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Brandon B.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        2/27/2017\n    \n\n    \n\n        \n                    Fatcow has become one of the worst hosting companies to host your website with. Also the support is the slowest at responding to issues. The affiliate program is a joke and the do not pay. I have hosted over 20 sites with them and they have missed 5 payouts in the last 6 months. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "21/02/2015", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Brandon M.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        2/21/2015\n    \n\n    \n\n        \n                    I've been with Fatcow for going on almost 6 years and its just steadily gotten worse and worse. Originally you could reach tech support on US soil then they outsourced. Which originally wasn't bad but steadily the wait time has gone up and up and up. Their pricing also has gone up. In the 6 years my rate has gone up almost 50 per year. Every year I have to try to negotiate a lower rate as a loyal customer. I shouldn't have to do that!! Recently and magically 5 of my clients sites somehow got Malware. Instead of locking down the affected sites Fatcow locked down my entire hosting account!! As a web designer almost 30 client sites went down for almost 48 hours!! I had clients threatening to leave my service, sue me for potential loss, etc. I couldn't get help on the phone at all it was all automated. Their tech support in Bagalore or wherever could only submit tickets. I'm in the process of migrating over to a fully US based web host. I can't wait to be done with these people!! \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "15/11/2016", "review_title": null, "service_name": "NordVPN", "reviewer_name": "G G.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        11/15/2016\n    \n\n    \n\n        \n                    Awful tech support.  They ignore you, make you wait a long time.  Lie to you and when they finally call you it's a sales call, not a tech support call.  Pay a little more and go with another company. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "25/11/2012", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Nicki S.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        11/25/2012\n    \n\n    \n\n        \n                    Horrible web hosting. Horrible customer service. I had to actually TELL their customer service how to check the speed of my website. All my sites goes down at least once a week. They always have some excuse and send the same pre-written email for how to fix it. They can't even keep a Wordpress blog live I'd hate to see how bad it is for people hosting important stuff on there.Don't use them, they are beyond horrible. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "30/09/2015", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Fred A.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        9/30/2015\n    \n\n    \n\n        \n                    These guys are TERRIBLE. I would stay away from them. They are completely dishonest - they'll sell you something, find some technicality to underdeliver on their promise, and then make you go through several layers of support hell until you give up. I would stay away. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "31/03/2017", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Bryan W.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        3/31/2017\n    \n\n    \n\n        \n                    I used Fatcow for web hosting for a while but recently, I had cancelled my service for websites several times and they still sent me notifications that I needed to cancel even though i had \"auto renew\" turned off and \"do not renew my account\" turned on. They charged me even though I cancelled. I called and waited about a half hour for an actual human to answer the phone. I finally got them to refund my money and when it went into my account it was for less than they had originally charged me. I called back and she said she needed to check with the billing department and that it was \"because of currency differences\" when they are based in the US. I asked why would you take out one sum and refund for less and she said she needs to check with billing about that. Like who wouldn't think to ask that using common sense?! Finally she came back and said that they must have miscalculated. If you do a reverse transaction, it automatically transfers the same amount. Is this something that Fatcow has been doing consistently to make more money? I wouldn't put it past them. I had to completely remove my credit cards from their service to make sure I don't get charged again. I cancelled my account and will NEVER use them again and i DEFINITELY don't recommend them to anyone. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "06/04/2014", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Ron W.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        4/6/2014\n    \n\n    \n\n        \n                    The slowest host provide I've ever had.I have two separate accounts with them each to host one website. Both are very basic and should load in a second or two. Over the last 2 months I've tested both sites and the average load time is 30 seconds. I've just contacted support but am certain (as I have in the past) I'll get a standard form letter response from them.Avoid them. I don't have anyone else to suggest. But I'm starting my research now. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "20/10/2013", "review_title": null, "service_name": "NordVPN", "reviewer_name": "William M.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        10/20/2013\n    \n\n    \n\n        \n                    I hate to give a 1 star but I've had too many problems with this company. I run a very small house cleaning businessi n CA and I only send emails out to my clients. I even used VerticleResponse for my newsletter, that only goes out a few times a year and I've been put on their spam list more than 4 times in the 3 years that I've been with this company. All of a suddent my email just don't go anywhere. It's so frustrating that I have to do damage control to keep my clients happy. When my emails don't get to my clients, I can't change write my schedules. I've never spammed anyone, but their algorhytm treats me as a low priority. There is no warning. No one monitors this either. They tried to tell me I could pay for something to keep my emails at a higher priority, but I don't fall or extortion efforts.When I told them I was not going to renew at $10 a month, and qualified the reasons why,  they didn't give a hoot about all my problems. They just changed my account not to renew./ That's just rude. Seems like they don't care about the quality of service their customers pay for.And from the rest of the complaints and the 1 star rating, others feel the same way. I don't know how they get such high reviews on the other websites. It's deceptive if you ask me.They need to remember that we have choices. If they want to be the best, they need to treat their customers, especially those trying to make a living, with more respect. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "22/01/2015", "review_title": null, "service_name": "NordVPN", "reviewer_name": "d h.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        1/22/2015\n    \n\n    \n\n        \n                    I wasn't happy with them initially, because my control options were limited.  That was more my fault than theirs.  Then I was content, though I knew I'd move my sites after my term ended.Recently, they disabled my sites without notifying me.  There was a support ticket in my account, but it had zero information.   I had to contact their chat, which gave details after a 20 minute wait \"on hold.\"  I'm not a novice.  The issue related to my account being disabled was not an issue.  It was simply them running a random scan and then, without using much common sense, saying, \"well, gee, let's shut it down.\"  Had they contacted me in a real way, I would have fixed it in 2 minutes.  Instead, my sites were down for half a day, until I moved my sites somewhere else.  They re-enabled after my sites were already moved. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "14/10/2014", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Phibka K.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        10/14/2014\n    \n\n    \n\n        \n                    Less than one star is that possible ? they used to have Decent customer service. But the past year or so has deteriorated. All of your phone calls are accepted at a a call center then you are told to fill out a \"ticket\" for online help from India. Be prepared to wait , be prepared for stupid  and irrelevant responses , be prepared for nothing to happen and zero help. Time to move on \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "05/10/2012", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Marcella S.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        10/5/2012\n    \n\n    \n\n        \n                    I've used with this company for years (as a client and as a web designer referring other clients) and I'm flabbergasted at their customer service. I've been errantly billed several times, but frankly didn't have the time to chase after them for it, as long as the refund was processed quickly. This time I was just \"hung up\" on by one of their customer service reps in their online chat environment. Same complaints as everyone else... Unauthorized billing and no explanation as to why they did it. I \"downgraded\" one of my accounts and they still billed me for it (two WEEKS before the renewal date).Web designers cringe at hosting with big competitors like GoDaddy, but I have to tell you, I've dealt with their customer service team for some of my clients and it's head and shoulders above the \"service\" FatCow offers.  Good riddance. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "5.0", "reviewed_at": "19/01/2016", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Mark M.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        1/19/2016\n    \n\n    \n\n        \n                    I have been using Fat Cow for about 5 years. I use them for Domains and Emails. In my many years of experience using customer services from all sorts of industry's, including the tech industry, I find FatCow to have one of the best. Most of the time the tech and customer service people have been very knowledgeable and helpful. They are very easy to talk to... they are human and not structured with scripts like a lot of customer service departments out in the world. I also appreciate that they are in America instead of outsourced. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "09/09/2013", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Uri E.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        9/9/2013\n    \n\n    \n\n        \n                    These guys are the pits. The deserve a negative 10 as their rating.They are expensive, their support is total inept, but what's really the real issue here is their product. Their basic hosting is something out of 1995. The MySQL database does NOT support InnoDB !!!They do not allow remote DB access - so you're basically screwed.Email relay is questionable - emails have gone missing. The IP address they publish is wrong (apparently they migrated the site to another IP without informing us), When you contact their tech support - they just want to up-sell you to their VPS product. stay away from these guys - their support is terrible, their product is terrible, just bloody awful. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "21/07/2013", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Victor C.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        7/21/2013\n    \n\n    \n\n        \n                    So far FatCow has delivered on a horrible customer support experience. On one of my accounts we have been unable to send email since Friday. It is now Sunday afternoon and still no resolution. I was told several times by chat reps as well as on the phone that the issue would be resolved in 2-4 hours. Well it has been over 24 hours and the only response I received from a support person is to send a message header. REALLY! They can log-in to my accounts and do the same thing. They have seen that email is not sending. So I  sent the header early this morning, and still no response.  FatCow is a FAT disappointment. Not a recommended hosting company by any stretch. I am using Host Metro goo.gl/4cY3d with good results and they use a standard CPANEL interface so if you need to move to or from another host. you can move. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "5.0", "reviewed_at": "30/10/2013", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Wade S.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        10/30/2013\n    \n\n    \n\n        \n                    I'm baffled at the level of reviews here. I've been a satisfied customer of Fatcow's webhosting service for many years now, with only positive results. And their services have only gotten better. I'd be willing to wonder about the legitimacy of many of these reviews because of their negativity. Just sayin'. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "5.0", "reviewed_at": "23/06/2014", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Ashley T. M.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        6/23/2014\n    \n\n    \n\n        \n                    I agree with you Wade S.  We have two websites with FatCow; one is a commerce site that we've had since 2009 and the other is an internet radio station! They both run perfectly smoothly, as do all the email accounts connected to them. As far as FatCow support, they have been incredibly helpful with any questions we've ever had. Don't use Live Chat or even support tickets; CALL them. You will without fail get someone friendly, knowledgeable, patient...and very easy to understand, if you get my drift. If they can keep an internet radio station cranking 24/7, it doesn't get much better than that. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "04/10/2011", "review_title": null, "service_name": "NordVPN", "reviewer_name": "H L.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        10/4/2011\n    \n\n    \n\n                        \n                \n\n        \n            \n    \n        \n    \nFirst to Review\n        \n    \n\n    \n\n\n                    Very disturbing, bad, expensive experience with FatCow. They forced an unauthorized renewal of a domain name, billed it to a credit card I had taken OFF the file, would not refund a cent or do anything at all. When I said I would file a complaint with Visa about the unauthorized charge, the rep actually laughed and said \"oh, sorry to hear you're going to complain to Visa\", and that was IT! Then I moved the domain to another provider but FatCow would not cooperate with terminating the account, even after the transfer was done. They continued to send harassing emails \"confirming\" additional orders for more services that I hadn't placed & trying to bill me. After 6-7 hours on the phone with 4 different CS reps (starting over from scratch each time since of course they can't communicate between themselves), I finally got a confirmation the account is cancelled, which I hope sticks this time. What a frustrating waste of time and money. I don't know if there are rules governing these big providers' conduct, but there sure needs to be. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "07/05/2012", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Zachary M.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        5/7/2012\n    \n\n    \n\n        \n                    This company provides the worst customer service of any hosting company I have used in the past 20 years. They made several mistakes and refused to take ownership of those mistakes, nor would they assist me in making it right. On par with the other complaints on Yelp. My advice don't use FatCow. \n            \n    ", "picture_urls": ""}, {"category": "Hosting Service", "rating": "1.0", "reviewed_at": "24/01/2012", "review_title": null, "service_name": "NordVPN", "reviewer_name": "Melissa H.", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington?start=20", "website_name": ["Yelp"], "review_text": "\n            \n        \n                    \n\n\n\n    \n        \n    \n\n\n\n        \n            \n        1/24/2012\n    \n\n    \n\n        \n                    The worst webhosting service in the market. they should call it Fat Lie instead of Fat Cow. They own Ipage which is as bad.  They should call it I pay instead. These guys will never help you in anything. The minute you buy the service you are on your own.  chatting with them is useless.  Try to return the service, they will not do it without charging you a penalty so the advertising money back-guarantee is not true.  You get what you pay for, yes it is cheaper but they offer much less than any other company, at least this is my experience with them.  I say avoid them. \n            \n    ", "picture_urls": ""}], "business_item_data": {"category": "Hosting Service", "sub_category": "", "original_price": "", "specifications": [], "website_name": "NordVPN", "availability": "", "picture_urls": [], "business_type": "Service", "name": "NordVPN-Hosting Service", "absolute_url": "https://www.yelp.com/biz/fatcow-burlington", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.yelp.com/biz/fatcow-burlington", "scrapping_website_name": "NordVPN"}]}