{"": {"Response": {"url": ["https://www.whoishostingthis.com/hosting-reviews/bluehost/"], "category": "subcategory", "sub_category": null, "image_src": null, "reviews": [{"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Charles Bernard", "category": "", "service_name": "", "review_text": "\n            Globally, I was very satisfied with Bluehost. Support: So far, I have not seen such a great customer support. People on lie support were very helpful even though I'm a beginner, and they gave me basic advice on what I should accomplish even when I decided to change host (reasons later).\nUptime and speed: I did not notice any issue with this aspect of hosting. My website isn't a behemoth, though, so I can't testify so much on that part. Value: As a renewing customer, I was a bit disappointed by the price they offered me for a 3 years hosting.\nI was seeing better offers elsewhere (and even for Bluehost NEW customers) so I decided to leave. The customer support did try to find a way to keep me, but it was not enough. Globally, if you're ok with the price, go all in. They're great!\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Patrick Eason", "category": "", "service_name": "", "review_text": "\n            I've been a BlueHost subscriber for the past 3 years and have had an excellent experience through them. When I first subscribed it was a matter of pricing->feature value, but the cPanel experience was weak and the upgrade process was hit and miss. Over the past three years BlueHost has resolved any issues I had with them.\nThey're cPanel is greatly improved, they're feature set is much broader with few limitations, and with their new reseller account options I can host clients without any of the problems I used to run in to. BlueHost's cPanel in particular is where the best value comes. When I started my subscription with them I was less than savvy about many things relating to hosting or marketing or anything else that would otherwise lead to solid web presence.\nThere are many included tools and promotions that BlueHost provides with the subscription that put me on the right track and led to more opportunities as I matured. Technical expertise is not a requirement as BlueHost has most of those tools available to you, but there is still enough flexibility for more savvy developers to get their hands dirty. The only one quorum I have is a lack of root level access, but that isn't a dealbreaker for myself personally.\nOverall I'd consider BlueHost as one of my favorite webhosts. There are others I've tried, but BlueHost has been the most reliable and their customer service team has always been quick and knowledgeable. For those who want a simple but reliable experience then BlueHost is the way to go; those who want complete control over their experience may not like how BlueHost does things.\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "3", "review_title": null, "reviewed_at": null, "reviewer_name": "Abby  Brown", "category": "", "service_name": "", "review_text": "\n            Bluehost support is bad. Yes you have live chat but it's entirely outsourced to third-world countries and they are painfully slow at replying. As well, I upgraded from shared hosting package to cloud hosting and they did something wrong in the transition and my website went down.\nI then had to create a ticket and it took 4 days to get an update on the ticket. As well, in terms of page speed, the \"Server response time\" is always above 1 second, which is way above the Google Page Speed recommended limit of 300ms, and this is with cloud hosting which is supposed to be fast. All in all, if you haven't chosen yet, don't choose bluehost.\nThe only reason I'm still with them right now is because it would be a pain the *** to move all my sites and contact with no downtime or seo hit. Stay away\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Kashish Kumawat", "category": "", "service_name": "", "review_text": "\n            Hi,\nI have been using BlueHost for my Wordpress Site for the past two months. Earlier I was using NameCheap hosting and now I feel glad that I switched. Currently, I'm using the Basic Shared Hosting plan.\nBlueHost's shared hosting is not only fast but reliable with good customer support. I am also using the Cloudflare CDN which BlueHost and it has really improved the site's loading speed.So far, my site has been down only for once and that was just a few days after I switched to BlueHost. However, their customer support was fast in responding to my issue and they got it resolved within half an hour.\nSince then, I haven't faced any issues with my site. Another good thing about BlueHost is their Control Panel. It is easy to use and user-friendly.\nBluehost's control panel also provides additional services like SEO based services and CloudFlare integration. I'll definitely upgrade to better plans at Bluehost once my website begins to generate more traffic. For small site owners and bloggers, I'll definitely recommend BlueHost for their excellent services. \n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "1", "review_title": null, "reviewed_at": null, "reviewer_name": "Andres  Perez", "category": "", "service_name": "", "review_text": "\n            In the past it was a good hosting provider, but now it is a shame the low quality of service, the lack of knowledge of the support staff and do not refund your money when you decide to leave. I've been trying for weeks to get back more than 500 USD and they do not, it's a shame and a shame\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "1.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Peter Schmidt", "category": "", "service_name": "", "review_text": "\n            This support is the worst ever! Support people don't even know their own system and don't want to help! Anything you ask from them they are not able to answer or they want to charge for everything.\nI would not use them ever! They are useless.... Never use them! Stay away from them!\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "3.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Dmytro Yaroshenko", "category": "", "service_name": "", "review_text": "\n            We bought a shared hosting for 3 years, the biggest mistake of my life. Value per money is the worst thing. Support was loading hours everytime I wanted to fix something.\nLeaving from this hosting after 1 year, I know there is no refund policy for the rest of the 2 years it's lost money, but I hope people who read this feedback won't choose this company. Search before you choose.  \n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "2", "review_title": null, "reviewed_at": null, "reviewer_name": "Brian Vatcher", "category": "", "service_name": "", "review_text": "\n            I have been with Bluehost for several years. I always give their support team kudos. However, in the past year, their email is getting worse and worse.\nTheir servers are black listed and they don't do anything about it. They respond with \"Try sending it again in an an hour when the servers rotate.\" This affects everyone in my business. We are working and with this kind of terrible service, we never know if your email goes through to a client or customer.\nTheir excuse is that email servers are shared so things like this happen. When I point out that email has been this way since before AOL and companies like AOL, gmail and others seem to deliver email just fine, the rep always seems to finally admit the senior management at Bluehost is not funding email support to force people to buy paid email services. IMO, email is a cost-of-doing-business type of feature.\nMeaning if I buy a car, a steering wheel is a cost-of-doing-business feature. I have a car (Bluehost) and it used to have steering wheel one hundred percent of the time. Now, the steering wheel is only there 70 of the time while I am driving.\nI then call the service department, they tell me it's not a safety risk. I should keep the car but get an Uber (Paid Gmail) to be able to get to work every day for reliability and safety. My answer is no thanks.\nI just get any other car on the market, even one like GoDaddy which I hate, and get a working steering wheel. It reminds me of the old Lily Tomlin skit about the phone company. She would always say, We don't care.\nWe don't have to. We're the phone company. At least with hosting companies, there are many options.\nIt was nice while it lasted Bluehost. I have been patient trying to let you get your act together. Good luck. \n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "5", "review_title": null, "reviewed_at": null, "reviewer_name": "Mike Otis", "category": "", "service_name": "", "review_text": "\n            Bluehost hosting service is the best service provider out there. If you do a search for web hosting providers they come up number one in each category and there is a reason for it. They are available 24 hours a day and money back guarantee was one of the reasons I picked them. I own a web development business named Cyber-Farms and the up time is critical.\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "2.5", "review_title": null, "reviewed_at": null, "reviewer_name": "jan deruiter", "category": "", "service_name": "", "review_text": "\n            I spent 139 (!) minutes on the phone yesterday trying to get them to map a domain to a subdirectory in our public_html directory. Something trivial that you can do yourself with other hosts like Dreamhost, mediatemple, pair, and so on. In the first few minutes, they messed up the existing path and then spent more than 2 hours telling me this is not possible and ended up leaving me having to migrate my site to the root on the server (where a dated site was located I had been trying to preserve).\nI have worked with dozens (100's?) of hosts since I started web dev in 1996. This was THE worst I have experienced. Luckily I only have 3 clients with these ppl. Unreal.\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4", "review_title": null, "reviewed_at": null, "reviewer_name": "Troy Thiessen", "category": "", "service_name": "", "review_text": "\n            I purchased a 3 year hosting plan from BlueHost on a Saturday. They assigned me a temporary domain name which support told me would last from 25 minutes to 5 hours. During this time I was able to access Wordpress and start putting the page for my blog together.\nAfter 5 hours I contacted BlueHost live chat to ask how long it would take for my domain name to become active. The person on chat never seemed to understand my problem. I even copied and pasted the error message from their site that explained the situation but to no avail.\nI couldn't see how my blog looked or access email while the domain remained with a temporary address. On Sunday I tried 2 more times with live chat but couldn't get my problem resolved. I tried again on Monday and after chatting for a few minutes I realized that I wasn't going to have my problem resolved and asked for a refund.\nThe person took my information and said that I would be getting my refund. The refund hadn't been posted to my credit card account on Tuesday so I called customer support and talked to a person who understood my original problem and offered to solve it. I said no, I would just like to get my refund.\nThey told me that I wouldn't be getting the refund for my domain name purchase because the person who was processing the refund on Monday didn't complete the process and it had been more than 3 days since I had purchased the domain name and they would only refund that purchase during the first 3 days. (By the way, Tuesday was 3 days after Saturday) I received an email detailing my refund (less the price paid for the domain name) on Tuesday but it hadn't been posted to my credit card on Wednesday. I filed a claim with the credit card company and they have issued me a provisional credit. I know that stuff happens but when a problem is brought to the attention of a support person the problem should be worked on.\nThe live chat people should have been able to solve my problem or pushed it up to someone who could. If you use BlueHost I would recommend that you use their phone support instead of live chat for even the most simple problems.\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4", "review_title": null, "reviewed_at": null, "reviewer_name": "Jen Braaksma", "category": "", "service_name": "", "review_text": "\n            Well, overall I think the service is okay. I am an English teacher and I use Bluehost for my blog about writing. I use their WordPress hosting service and I am satisfied with the service, although there are some flaws.\nPros:\n-Easy setup\n-Very good uptime (all the time)\n-Good speed\nCons:\n-Support is not great\n-The price is higher than other hosting\nDuring my last semester of teaching I was approached by one of my students who said he could optimize my site and get many more readers quickly, but found some security flaws in the site which should be fixed first. He offered to fix it himself for free, but first I contacted support. They did not do much and claimed the site was in good standing with security.\nThey have their own \"intrusion detection/prevention system\" which stops their service from getting hacked, but I found out it doesn't actually protect my website. I reluctantly let the student fix my site after giving him my account details and he managed to find all kinds of flaws from the inside as well. He fixed most of them within a couple of days, from bad configuration, bad plugins, and hiding my personal email/account.\nI'm not very good with this kind of stuff but was astonished by how much the student was able to do that BlueHost was not able to do. The student also showed me that there were much cheaper hosting plans I could have gotten, and sure enough he was right, so I don't think the value is great for this host. Other than all that, the first setup of the website was really easy, only a few clicks and it was ready. Everything went smoothly and although the site isn't super fast, it is up 100% of the time (or very close, I don't know what happens when I'm not on it.)\nOverall I give this host somewhere between 3/4 stars.\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Mohan Polydath", "category": "", "service_name": "", "review_text": "\n            I wanted to setup my company website, after comparing and reading reviews of many webhost, I finally found BlueHost, believe me I had the best experience with bluehost, their cpanel have all the features and helped me a lot to setup my website in just a single day, I found the web hosting price in my budget, I would really recommend bluehost for any web hosting needs.\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Saikat Ghosh", "category": "", "service_name": "", "review_text": "\n            Bluehost has a very nice list of features, and the best of them being the 'Unlimited Bandwidth\" in a very low cost, cheaper than many others as of the quality of service that Bluehost provides, but what I don't like about the host is that they have a good customer service but some of their employees keep turning rude at some moments!\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Danish Ali", "category": "", "service_name": "", "review_text": "\n            I'm using BlueHost Since last 2 to 3 Years, I found BlueHost to be reliable and customer friendly hosting service. Their 24/7 customer support is among the best.That’s why I love this Hosting Platform, and they give all time Something Amazing Like 150$ foAdvertisingnt oAdWordsds. I'm Happy and Feel always Free about my Hosting Issues. I'm using their Shared hosting Plan and Get Everything Unlimited.\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Deepjyoti Barman", "category": "", "service_name": "", "review_text": "\n            This is best hosting company for law budget customer with Indian perspective. It delivers budget plans with offer on the occasion of the Independence day. It has a variety of CMS within the server.\nIt helps to make a good website within a minute. Good security with Linux based server. I give them 4.6 out of 5. \n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "2", "review_title": null, "reviewed_at": null, "reviewer_name": "Alian nadeem", "category": "", "service_name": "", "review_text": "\n            I registered my domain on Bluehost. I chose a monthly package which I think should deduct approx $10 monthly. I made sure that everything is good to go.\nSo when they processed my order, it showed that I selected an yearly package and they deducted $120 from my account. I contacted their support and they were not admitting at first after I showed them screenshot of my order, They agreed to give me my refund but they agreed to give only $60 so I decided to use the hosting. \n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "5", "review_title": null, "reviewed_at": null, "reviewer_name": "Asad Khan", "category": "", "service_name": "", "review_text": "\n            I have been using Bluehost for almost a year or so, it was so tough for me, to get started my blogging career with hosting issues. I was using a local hosting company before, with no support and which was in the dark. I don't know, what other reliable option available out there, but I was left alone, although the company was closed because of their problems.\nBluehost packages are so accurate that they're made by, keeping the exact requirements of a site owner, in mind. They are very optimized regarding pricing, features, and security. They know and they've best and exact solution at the correct time.\nI would recommend others for this particular hosting. I love them, until they continue their hard work and I 'll use them.\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "3.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Neil Haffey", "category": "", "service_name": "", "review_text": "\n            Very disappointed in the level of support I received to resolve an SSL certificate renewal. The wildcard SSL in question was set to auto-renew but is was not being applied. Customers to my website were receiving an insecure error.\nBluehost support's solution was to just wait it will apply eventually. Sounded like they didn't really know what was happening. So I waited 5 hours.\nStill no new SSL cert. I called again. This time they said it was Comodo's fault and told me to call Comodo even though the SSL cert was automatically purchased on Bluehost site.\nWhen I called Comodo they said they needed the Comodo order number. Well, I don't have the comodo order number because I purchase the SSL cert on Bluehost's site. Been on hold now for 25 minutes with Bluehost to try and get the Comodo order number because it was not on my Bluehost invoice for the SSL cert. Uggggg........\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "1", "review_title": null, "reviewed_at": null, "reviewer_name": "Dav Vand", "category": "", "service_name": "", "review_text": "\n            I have been with Bluehost for almost a half year. Several times my email has been down. Customer support at Bluehost is not very helpful.\nIn some cases I was given feedback that their servers were down for maintenance. Down for maintenance!?! Why would a emai hosting be down for maintenance during peek working hours in Eastern time?\nThe answer was that they have several customers on the west coast and in Australia. Last time I checked the majority of the working population is in the eastern part of North America. What a joke.\nI am also continuing to have several issues with my email not being able to receive. In some cases it seems to think my inbox is full. Seems ridiculous when I don't even have 500 emails in my inbox. I will be switching soon.\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "4.5", "review_title": null, "reviewed_at": null, "reviewer_name": "muhammad waleed", "category": "", "service_name": "", "review_text": "\n            BlueHost ranked as my number 1 web host. Because of their outstanding rating,\nand BlueHost give you a long list of features and plans which is easy to use, Which suit every user 100%. According to my knowledge BlueHost host more than a 500,0000+ domains and manage more then 10,000+ of servers across many cities of 3+ countries and approximately, The last 30+ days BlueHost give an up-time of more then 99.00%.\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}, {"absolute_url": "https://www.whoishostingthis.com/hosting-reviews/bluehost/", "rating": "2.5", "review_title": null, "reviewed_at": null, "reviewer_name": "Martin Rudinec", "category": "", "service_name": "", "review_text": "\n            Don't believe the hype. I've been with Bluehost for many years, and watched it get worse over time. It makes me sad, because they used to be very good back in the day, and I was happy with their service.\nIt's super slow now. Even if you install a clean empty WordPress, the page load times are awful. You run out of patience way before you get to set it up properly.\nMy bills kept getting bigger for no apparent reason, and even after an upgrade to the \"performance cloud\", my WordPress site didn't get any faster. They're only interested in sales, not so much their existing customers. I strongly recommend looking somewhere else for a fast reliable hosting.\n\n                         \n                    ", "img_src": ["https://media.whoishostingthis.com/2/v241/images/host-logos/bluehost.png"], "website_name": ""}]}}}