{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "17/10/2016", "review_title": "“Beware of One.com”", "service_name": "services", "reviewer_name": "Jessica S.", "absolute_url": "https://www.sitejabber.com/reviews/one.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Like many others, I went for their free one year web domain, with their promises of \"no strings attached\" \"Money back guarantee - no questions asked\" \"No hidden fees\". As a freelancer, I set a company up with a free domain and used my own name to initially set up the domain. The company never switched the info to their name and never used the services. Suddenly I am getting harassed by One.com since it's been a year and I owe them $36 some plus a $12 late fee. I figured like most free trials, if unused/unpaid for, they just cancel your account and that's that. Not keep it open and continually come after you for late payments. Granted, perhaps in the fine print they mentioned that you had to cancel 30 days before the expiration period or get charged, but it's still a super shady business model. They are profiting from other's misfortune with their shady services. After contacting them, they did offer to remove the late fee but had very little remorse, and when I tried to pay, my credit card held the payment due to potential fraud by Chase. Way to go, One.com. There website was easy to use, but their business practices are terrible.", "picture_urls": null}, {"category": "", "rating": "1.8", "reviewed_at": "18/04/2016", "review_title": "“Fraud Fraud Fraud”", "service_name": "services", "reviewer_name": "Larry G.", "absolute_url": "https://www.sitejabber.com/reviews/one.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "At the time I signed up for this site all basic web service was completely free. I am assuming in a nice semi-hidden way they let me know that if I didn't cancel this \"trial\" that I would be billed. I took no action on my account. Never used their web building service. And soon forgot about them. Went to their site as a learning experience on website building. So 6 months later I received a bill for $30+, and additional 12.99 late notice fee. No phone support is offered to discuss issues with them. A complete disconnect. So we went back and forth with emails and in the end they had no sympathy. No one should pay for a service that was not used. Companies get paid once a service is actually used, no freebies for businesses. And get a phone. You're supposed to be a professional business.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "19/03/2015", "review_title": "“Great product, cheap as chips but Crap tech support”", "service_name": "services", "reviewer_name": "Odette K.", "absolute_url": "https://www.sitejabber.com/reviews/one.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Cheap as chips, all up and running in no time at all. A fully functional website, domain and unlimited email addresses all within about 24 hours and for about a Tenner ! Seriously impressed with that but......... my attempt to receive support was not great. Support is there via chat and they do respond but.... not really helpful or able to help. Thankfully I resolved the problem well sort of. I switched on spam filer on email and found out by someone informing me that mail was bouncing. one.com support were pretty useless and never got back to me. Thankfully I realised that the spam filter was the only change, switched it off and voila was receiving mail once more. Never heard back from support at all as for some reason unbeknown to me they had to escalate my issue to some other technical department blah blah blah.. and you and I know that means passing the buck ! It may have been a bit of a catastrophe had they not come back to me and had my incoming emails continued to bounce !!!  If you can provide your own support and fingers crossed it keeps running then its great. If you are less tech savvy and need any help, .beware. Fingers crossed all ticking over nicely again. oooo and unlimited email addresses is a nice addition as is free https security cert . I may give tech support another try just to see if it gets any better.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "09/12/2014", "review_title": "“Such a fraud”", "service_name": "services", "reviewer_name": "Haylee B.", "absolute_url": "https://www.sitejabber.com/reviews/one.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Such a fraud. Shouldn't be allowed on the internet. Waste of my time.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "25/07/2014", "review_title": "“If your looking to set up a web site with very little...”", "service_name": "services", "reviewer_name": "gren S.", "absolute_url": "https://www.sitejabber.com/reviews/one.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "If your looking to set up a web site with very little cost, then try this company. Easy to use, with templates, your up and running in no time. You can have loads of email addresses. Everything is there to help you", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "19/06/2009", "review_title": "“dont give you any real info hides real details con”", "service_name": "services", "reviewer_name": "Andy M.", "absolute_url": "https://www.sitejabber.com/reviews/one.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "dont give you any real info hides real details con", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "18/03/2009", "review_title": "“automatically renewing of contracts”", "service_name": "services", "reviewer_name": "Roger B.", "absolute_url": "https://www.sitejabber.com/reviews/one.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "automatically renewing of contracts - Both myself and the OFT think that the \"terms and conditions\" of \"one.com\", to automatically renew the contract of a web site, if the buyer does not cancel 35 days prior to end of said contract is not to the customers benefit.  Myself and many others have fallen into debt by their ability to bury this fact in their small print.  Also their debt company in Denmark, even though an email address is given, does not reply to any emails sent to them and make it most difficult to pay the demands from them.  WEBSITE PURCHASES BE VERY AWARE OF ONE.COM's  \"TERMS AND CONDITIONS\"", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "18/03/2009", "review_title": "“Automatically renewing of contracts”", "service_name": "services", "reviewer_name": "Sitejabber User", "absolute_url": "https://www.sitejabber.com/reviews/one.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Automatically renewing of contracts - Both myself and the OFT think that the \"terms and conditions\" of  \"ONE.COM\"  to AUTOMATICALLY RENEW  a contract for a website, if the buyer does not cancel the contract 35 DAYS PRIOR to the end of said contract, IS NOT TO THE CUSTOMERS BENEFIT.  Myself and many others have fallen into debt by this CONCEALED TRICK in their contract.  Also their DEBT company in DENMARK does not reply to questions sent to the email address provided and make things most difficult to pay the demands from them.  WEB SITE PURCHASES BE VERY AWARE OF THEIR  \"TERMS AND CONDITIONS\".", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/one.com", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/one.com", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "07/06/2018", "review_title": "“Good hosting service”", "service_name": "services", "reviewer_name": "Shiv s.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am a customer of hosting Raja since 2 years and I am extremely happy with the provided by hosting Raja. Whenever I faced any issue their support team solved my issues on priority basis. All I can say is excellent support and really one of the best web hosting company.", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "04/06/2018", "review_title": "“Customer support was really really rude at customer.”", "service_name": "services", "reviewer_name": "Praaveen V.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Hosting Raja\n\nTheir hosting service is really bad. \n\nSharing my experience with http://hostingraja.in (http://hostingraja.in)\n\nWe have hosted our site at hostingraja. It was a down for while. We tried reaching them to ask about the reason and status. \n\nSupport person said that our team is busy right now and cann't handle the request.\n\nTried again to reach them didnt pick the call, again from the new number picked and terminated the call with out answering.\n\nCustomer support was really really rude at customer. \n\nPlease dont waste money on hosting at http://hostingraja.in (http://hostingraja.in)\n\n---------------------------------------\r\nUpdate\n\nHostingRaja\r\nI have proof for site gone down and your support team didnt respond. I have audio proof for asking me to remove from mouthshut.\r\nI ready to show anyone here.\r\nHow can you expose my private data in public. you can reply to the review you don't have rights to expose my data.\r\non ''updating the wrong review on the social media to get REFUND.''\r\nYou thought cheap like you by posting the customer private data.\r\nCUSTOMER BE CAREFUL WITH THESE GUYS HERE IS THE EXAMPLE OF EXPOSING THE CUSTOMER DATA AND RUDE REPLY IN PUBLIC.\r\nWe are ready to move in legal for exposing by data and false complain on me.", "picture_urls": null}, {"category": "", "rating": "3.3", "reviewed_at": "01/06/2018", "review_title": "“Right now my servers are getting good response time”", "service_name": "services", "reviewer_name": "jennifer m.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have hosted my server last 2 years with Amazon,  They deployed everything on one single server. Then I moved my server with hostingraja after checking their customers feedback. Right now my servers are getting good response time, The magic here is hosting raja deploy with 2 different servers one is for website and one more server for DB, which I didnt think about it and no one suggested me that before, Good prevention has taken care by these peoples. Thanks to hostingraja!!!", "picture_urls": null}, {"category": "", "rating": "3.3", "reviewed_at": "30/05/2018", "review_title": "“Thanks to hostingraja support team for giving informative ideas”", "service_name": "services", "reviewer_name": "Neeraj M.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am using hostingraja VPS server for my website. I used to share my admin details to developers, colleagues etc and my admin details will be controlled by everyone. But after moving to hostingraja their team members explained me about administrative privilleges which mean my admin details will only be controlled by me. They explained me about the importance of server administrative privileges. Which my old hosting provider failed to explain. And also i came to know about the firewall settings which are necessary for securing the website. Thanks to hostingraja support team for giving informative ideas and i hope the same service will be offered in the future", "picture_urls": null}, {"category": "", "rating": "3.4", "reviewed_at": "29/05/2018", "review_title": "“I am truly thankful I use HostingRaja,”", "service_name": "services", "reviewer_name": "deepak s.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am truly thankful I use HostingRaja, By mistake  i wiped out some files on my private server, Usually, I didn't monitor files on my server frequently because of busy with my business promotion. When I contact their support team for some other help that time they only said in my website some files are deleted few days before. Their tech team was able to assist in getting everything back to the way it was before. Maintain the same service guys all the best.", "picture_urls": null}, {"category": "", "rating": "3.3", "reviewed_at": "24/05/2018", "review_title": "“Hostingraja servers are the best value for money.”", "service_name": "services", "reviewer_name": "Vinay k.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Hostingraja server are the best value for money. I used their dedicated server pack for my three business websites, their server speed and security system is excellent. These guys are provide me everythign what I need for my website server and security. Now my customers realize the superfast loading time for websites.\n\nMainly price is important for all business people, so initially before purchase I was gone through most of the company price I realize this will be the best price I was looking for dats y the main reason I'm with Hostingraja server right now. They're the best", "picture_urls": null}, {"category": "", "rating": "3.3", "reviewed_at": "11/05/2018", "review_title": "“Good service so far”", "service_name": "services", "reviewer_name": "chhaya c.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have purchased VPS Hosting from HostingRahja and using their services since 1 year for my 2 website. Very rarely I am facing any issue and whenever any issue is their I can contact their support team team via live chat or toll-free.\r\nSo far I am happy using their service and customer support.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "11/05/2018", "review_title": "“using HostigRaja sevices since 1.5 year”", "service_name": "services", "reviewer_name": "Tom R.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am using HostigRaja sevices since 1.5 year and I am truly satisfied with the of customer support offered by Hosting Raja. \r\nSo far they have given me a 99.98% Uptime as well as 24*7 Customer Support. I highly recommend Hosting Raja for you if you are looking for quality web hosting services in India.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "08/05/2018", "review_title": "“I am sharing my experience”", "service_name": "services", "reviewer_name": "Griffin A.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am sharing my experience to who plan to start the business online for their business. I was planning to buy one server which is performing best for business. \r\nSearched a lot and finally found one Indian company for my website. I personally thanks to set up my server with expert support. Their services are recommended \r\nespecially for startups.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "08/05/2018", "review_title": "“Hosting Raja calls me and asks me to remove my reviews”", "service_name": "services", "reviewer_name": "Gagan S.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Since my update on the website. Hosting raja has been calling me and asking me to remove the review. I am not willing to remove the review as it is a genuine review. I have also told them that I will complain to the Information and Technology minister Mr Ravi Shankar Prasad through mail and twitter if they do something to my account.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "11/04/2018", "review_title": "“Stay away - worst ever experience”", "service_name": "services", "reviewer_name": "Ravishankar S.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I've been their customer for last 2-3 years. It's always a painful experience. They don't care about downtime and unfit for this industry segment. I've phased out all my servers after a lot of impact on my business. Please stay away from them if you're serious about your business.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "07/05/2018", "review_title": "“Using HostingRaja services since 3.5 years”", "service_name": "services", "reviewer_name": "Rahul K.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been using HostingRaja services since 3.5 years.\r\nThey offer very good customer support service. Whenever there is any isuse with my hosting account, they responded very fast and resolve my issues.\n\nFurhuremore, they offer web hostign at affordable rates.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "17/04/2018", "review_title": "“Good service so far”", "service_name": "services", "reviewer_name": "Shiv W.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Few months back I was searching for a web hosting service for my website, I came across Hosting Raja user reviews via google search. I found some good and some bad reviews about their service but mostly good reviews were there. AFter reading the reviews I bought VPS hosting plan for my business website and so far I am happy using their hosting services. I recommend HostingRaja if you are searching for quality web hosting in India and affordable rates.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "13/04/2018", "review_title": "“Hosted 2 Websites with HostingRaja”", "service_name": "services", "reviewer_name": "satheesh w.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have purchased VPS server from Hostingraja for my 2 websites and it's been more than 1 years since I am using their service. So far I am happy with their service. Whenever I am facing any issue, I can contact their technical team via live chat which is one of the best thing about HostingRaja.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "11/04/2018", "review_title": "“Best Option for VPS hosting”", "service_name": "services", "reviewer_name": "john s.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am using VPS hosting servies  of HostingRaja since 1 year and so far I am very happy with their services.I will recommend HostingRaja for VPS hosting servies for everyone looking for secured hosting alternatives. Their servers are fast and reliable, whenever I call them they respond to me quickly and give me a resolution very quickly.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "19/03/2018", "review_title": "“Using VPS Since 1.5 years”", "service_name": "services", "reviewer_name": "AAditya a.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am using VPS hosting from HostingRaja for my 2 website and I have got plenty of server space. As per me HostingRaja is a best and reliable hosting provider in India. Their hosting packages are available at cheapest rates.\r\nOne of the best thing I found with HostingRaja is customer support team available via live chat.\r\nI recommend Hostingraja to everyone searching for best VPS hosting at affordable rates and i recommending them because I am a customer of HostingRaja since 1.5 years.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "01/03/2018", "review_title": "“Worst and hectic service!”", "service_name": "services", "reviewer_name": "Peehu S.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Forcefully keeps customers engaged so that they cannot leave. Unexpected billing and 99% downtime. Worst Service one can ever get! I would never recommend this to anyone and also trying to leave from my end which is becoming hectic as I am being said to pay a bill before leaving. Even cannot transfer my own domain.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "28/02/2018", "review_title": "“GOod Service So Far”", "service_name": "services", "reviewer_name": "gimson c.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am using HostingRaja Unlimited hosting plans from last 6 months and it works very well for my website. Their customer support is much better then other providers. Service is worth for money. \r\nAs per me this is one of the best hosting option available for small and mid sized business because I have also hosted my business website and personla blog with them. \r\nI would definitely recommend HostingRaja for those looking for best in class hosting solution at affordable rates. You will never feel disappointed with their services.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "14/02/2018", "review_title": "“HostingRaja is doing their job!”", "service_name": "services", "reviewer_name": "stephie s.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I would definitely recommend HostingRaja for web hosting servides because of the excellent features they provider that other hosting companies can't. Whatever problem I am facing, customer support is very important and HostingRaja provide 24/7 customer support so I never have to worry about any issue. Their hosting cost is also less as compare to other providers.\r\nOne of the best feature of their hosting plan is user friendly control panel. We do almost every task with the help of this cpanel tool.\r\n I highly recommend HostingRaja expecially if you ate looking for best VPS hosting in India with excellent customer upport.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "13/02/2018", "review_title": "“Best hosting provider with best customer support”", "service_name": "services", "reviewer_name": "Carol V.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I an using HostingRaja services since 1 year and my website performance in excellent. Service provide by Hostingraja is excellent and I can contact anytime to their support team via, toll-free as well as live chat.\n\nI would love to mention HostingRaja support team member name Awani who helped me alot in solving the issue i was facing with my website. She is well knowledgeable about technical stuffs.\n\nI would recommend HostingRaja to everyone.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "10/02/2018", "review_title": "“Hostingraja great support”", "service_name": "services", "reviewer_name": "victoria m.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been using the Hosting since from Last 2 years the persons from technical support helped me in a super manner with quick support and I want to mention the person name who recently helped me Mr. Vignesh and look the call on priority bases and resolved my issue. I really appreciate your support desk.\n\nI also referred me friends so please other people also help this company.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "10/02/2018", "review_title": "“site down time guaranteed”", "service_name": "services", "reviewer_name": "manju l.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have hosted with hostingraja.in, site do not work during peak business hours, site down. i noticed only recently, i requested support several times, no use. \n\nselect a service up at least 99% of time, because we get business only if site is up, apart from this if site is down during google crawling it will reduce the rating of site.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "09/02/2018", "review_title": "“They didn't give you money back under 30 days”", "service_name": "services", "reviewer_name": "Sayak B.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "When I buy their Hosting plan, they tell me that we can cancel your plan & refund you at any time under 30 days, without asking you any question. But they didn't keep their promise. After 15 days later I faced some resources/RAM related issue. Then I tell them that, I want to cancel the plan & I want the refund. But they directly denied to give me the refund. But my friend tells me that Godaddy & Bigrock give him refund under 30 days without asking any single question, they only ask feedback & reason.\n\nHostingRaja tells me that they give money back under 30 days, without any reason. But they didn't keep their promise!\n\nThey just tell me that \"Hamare taraf se koi Technical Problem nahi hai\"   But   \"Bhai Saap Hosting may kabhi Koi technical problem hota hai keya? Maine toh kabhi nahi suna\"\n\nVery Bad!!!", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "09/02/2018", "review_title": "“Impressed with The Quality of Service”", "service_name": "services", "reviewer_name": "Ajay K.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am with Hosting Raja since 1 year and i really love their services and support team. Their support team is always available and quick support impressed me a lot.\r\nHostingRaja is good option for those who do no have or having less knowledge of coding because their support team is very skilled and alaywas their help ythe clients.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "24/01/2018", "review_title": "“Very poor service”", "service_name": "services", "reviewer_name": "Sumeshwar P.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Don't take service from them. There service is pathetic. Please don't use there services.                                                                          ,                                           ,", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/hostingraja.in", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "26/02/2018", "review_title": "“Worst hosting + least concern about client”", "service_name": "services", "reviewer_name": "yousuf i.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Doesnt' get any worse than this. WebHostingWorld.net are not at all concerned if you site is down and you are losing business.", "picture_urls": null}, {"category": "", "rating": "2.1", "reviewed_at": "08/09/2017", "review_title": "“Huge fiasco!”", "service_name": "services", "reviewer_name": "K G.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Cheap is cheap!\n\nI signed up with them less than a week ago. My long-standing, reputable, and functional website was transferred to these scammers for a short period of time. The website, emails, and everything else stopped working as soon as they were transferred to webhostingworld.\n\nI pulled out my embarrassing mistake from their claws very quickly because: 1. The site never saw the world through their eyes! 2. The emails stopped working and I lost business that week. 3. Now I have to correspond with my clients to re-establish my reputation. And it's not easy to do. My clients trust me on the quality of my work and my product. My products, my service, the quality of my communication with the client, and everything else is a part of my business integrity. When I mistakenly signed up with webhostingworld, I temporarily compromised my integrity. 4. Their 30-day money back guarantee promise is a bogus. I submitted a ticket with them. It's like throwing a bottle with a message into the ocean with some communication effort. And it's like being on an island in the ocean screaming for help. Wilson! My ticket was never addressed. Does this ring the bell? 5. They make their money by advertising very cheap plans and charging thousands of people for a promise they don't deliver. When people realize that they paid for nothing, it's too late. The fee is small, so people stop fighting in their efforts to get their money back. As a result, you have lost a small amount of money, your time on the Internet, your reputation with some of your clients (who are inherently patient for the most part, thank Goodness!), and your sanity. And they have collected their undeserved profit while you are trying to get back on your feet.\n\nMy advise to you, don't make the same mistake I did. You get what you pay for. And, in this case, it ain't worth it. Never sign up with this company!\n\nP.S. I did allow more than 48 hours for the site to propagate on their so called \"server.\" And I was very patient with their excuses.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "11/05/2017", "review_title": "“Worst hosting with least concern about client”", "service_name": "services", "reviewer_name": "RAMESHWAR S.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Doesnt' get any worse than this. WebHostingWorld.net are not at all concerned if you site is down and you are losing business. They keep on changing servers and your site goes down, database gets disconnected, site goes down. They will disconnect service because you did not pay on due date even though due date not yet started. Very disgusting. Go find another host but never waste your time and money on WebHostingWorld.net.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "24/11/2016", "review_title": "“Web Hosting World dot net Buyer beware”", "service_name": "services", "reviewer_name": "Retha W.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I subscribed to Web Hosting World dot net (my 1st 5 posts cant include links per Scam Rules), and the beginning was great. I had the functionality needed to run my 24 hour web store. However as my needs grew, the company stop doing or performing certain duties such as forwarding a copy of the transcript when chatting to my email account. Instead, they send their bias overview so I have to print screen to save a copy. Then the database STOPPED working, first I was told that we are updating your database then it would happen while I was working on the website.  Then someone changed the name of my database from wbandt to bbandt??? I have a screen shot of it also. Then they disabled my options to send emails and I got an error stating  we do not authorize the use of this email account to send bulk mailbut I am a business?!?!? And businesses send bulk mail?? Then the customer service agent called my mail SPAM??? Wtf? But would only allow me to send mail from my cellular device or ipad. \r\nThen I was not allowed in my cpanel, they would change password, and give me 3 minutes then log me out and I get a message saying you have exceeded the login time now they will not allow me to delete files. This is serious because the content of our files are private and sensitive. They disable the function to delete files from database in cpanel and access to certain script in cpanel. These issues are a security breach. When asked WHY my database and other issues were happening, I got NO answer but we will send a ticket to next levellike Comcast does (but that is another story). Since using their hosting company I have lost privilege to post ads on my site as the companies are saying I no longer have the traffic???? But other analytics who point to my site says I get at least 90 clicks per daymy site has ZERO visitors according to Web Hosting World dot net.  I am now waiting for them to allow access but just decided to delete the databases altogether. For some odd reason I believe they have files somewhere!?!? Its Thanksgiving Folks so I am gonna organize records for your deliberation. Simply put, this company is DEATH to businesses that rely on the website for branding. They are real cheap, but you will take a greater loss by using them.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "30/09/2016", "review_title": "“Rzoável - Reasonable”", "service_name": "services", "reviewer_name": "Jhon P.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Tive vários problemas de lentidão e quedas dos meus sites, no entanto o suporte deles é bem rápido!\r\n\r\nAgora por exemplo meus sites estão on mas o deles OFF.\r\n\r\nI had several problems of slowness and falls of my sites\r\nhowever their support is very fast!\r\n\r\nNow for example my sites are on but their OFF.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "28/09/2016", "review_title": "“Scammer”", "service_name": "services", "reviewer_name": "Hasan B.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "webhostingworld review\r\nthis company is simply not a company  .....\r\n\r\nits just a one person companey with very cheep servers\r\nthey Promise 30 days moneyback but don't Believe this ball$#*!\r\n\r\nsever is very slow and its not about the speed of the connection the machine its self i think they are useing pantium 1 ...\r\n\r\nthey or he change my server at the first it was ok after 2 days its the same slowleness\r\n\r\nscripts are full of bug's from almost 180 script u can get 3 or 4 working right .. i regester a domain on sep 2 then after 2 day i cheak up the domain and still not yet regester  in sept 4 i ask to not regester it and Guess what when i request to Cancellation of my account and refound my money  they regester the domain right away  .....\r\nand keep ignoring my Cancellation requests\r\nDownload the photo so you can read it\r\n\r\nBusiness Name:\t\r\nAPSC InfoTech & Software Solutions Pvt Ltd (The recipient of this payment isNon-U.S. - Verified)\r\n\r\nPaypal cant  return my money \r\n\r\nYou may see the screenshot of my conversation with them before they terminate my account", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "05/02/2016", "review_title": "“Good service”", "service_name": "services", "reviewer_name": "Sheetal j.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "For my WordPress hosted sites I have gone with Webhostingworld.net .I have used HostGator in the past but I find Webhostingworld.net provides the best packages for my needs.\r\n\r\nThey have the easy install of WordPress we expect from all hosting services but also a great uptime record and costumer support.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "27/01/2016", "review_title": "“Avoid them”", "service_name": "services", "reviewer_name": "Le I.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I had several accounts with them. The price was low and that was my mistake. They closed the access to the customer area and access to the control panel of several of my accounts without warning. I contacted support and repeatedly told me that they will enable the accounts but nothing has happened till today. Lost several customers because of them. Avoid them is loss of prestige and money", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "30/12/2015", "review_title": "“Thanks Webhostingworld.net for providing best services.”", "service_name": "services", "reviewer_name": "Robert C.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have setup an account for 1 year with Webhosting world company, I heard from my friend who is already customer of this company, this is very nice to customers and make sure care of users. From my experience I noticed that he was right. I have planned that I will extend my hosting time with this company\r\n\r\nThanks\r\nRobert", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "20/11/2015", "review_title": "“The Best Demon I Know”", "service_name": "services", "reviewer_name": "Frederick O.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "As the saying goes, \"the demon you know is better than the angel...\". I've had my ups and downs with Web Hosting World but I'm overall satisfied. Most problems are fixed via chat and if I'm honest, with them, you actually get more than what you pay for. I won't use it for top projects where reliability is key especially for zero-tolerance clients. I've however used it for projects that have gone ahead to shake the WWW including 247 Nigeria News Update which is recently migrated to blogger due to it's 50000 daily hits", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "28/07/2015", "review_title": "“Very Arrogant and mean”", "service_name": "services", "reviewer_name": "Venkat K.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "What Andrew C mentioned just below, I am also facing the same issue. They just closed my account saying its usage is 30% and asked to pay 84$ immediately within a day. I am with this WHW for several years and without any courtesy they sent an email to pay the invoice and the account is closed. I never know that my site is down. I am not receiving emails and they stopped everything.\r\n\r\nIn their website they promote that they provide unlimited disk space, bandwidth,etc. If that iscase how the CPU usage is more? This is the worst behavior and they cannot treat a customer like that. Its something they need money and close the account and moving all the customers by force from Bronze to Gold immediately. if the 30% hit you move to Gold plan then why do you have Silver plan then??", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "28/07/2015", "review_title": "“Arrogant crooks”", "service_name": "services", "reviewer_name": "Andrew C.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been using webhostingworld.net for several years and was happy with their \"bronze\" service at $1 per month! But now they accuse me of using 30% of their CPU time (I was uploading data to myy website) and put me on their \"gold\" plan for $84, effective within 24h. If I don't pay they shut down my website and e-mail server. I cannot transfer my website within 24h and I refuse to pay their blackmail charge. This is a poor way to run a business. Here is their message to me:\r\n\r\n\"During a routine audit we checked that your account \"[website name]\" is using more than 30% cpu usage on the server , unfortunately we will not be able to continue you on brone plan.\r\n\r\nWe have upgraded your invoice to gold , if you wish to continue with us you need to pay the invoice\r\n\r\nYou can login to your client area to view and pay the invoice at\r\n\r\nHowever if you do not wish to continue , you are requested to move your accounts untill the 28th of July since on 28th of July if the invoice is unpaid we will proceed with suspending and removing your accounts and no longer offer further service.\"", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "06/07/2015", "review_title": "“Scam Artist”", "service_name": "services", "reviewer_name": "David B.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Used the site for almost 3 years, was happy with the service UNTIL now, they said I used to much CPU and put me on the more expensive plan.  Billed me $84 and held my domain ransom until it was paid.  I have no website only email and get about 25-50 emails a day.  If that overloads their servers, that ought to tell you something.  Avoid at all cost..", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "07/05/2015", "review_title": "“Webhostingworld.net”", "service_name": "services", "reviewer_name": "Jay S.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Webhostingworld.net are scammers! I CANNOT SEND SMTP AND THEY SWITCH IT OFF and offering NO explanation!", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "05/04/2015", "review_title": "“Possibly the WORST COMPANY IVE EVER USED!!!”", "service_name": "services", "reviewer_name": "kai h.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Been with WHW for 3 years now and the last 6 months all I've had is downtime, problems and bulls*t from them.  They don't keep their servers up date date and are insecure, their speed and platform responsiveness is absolutely terrible and their support is just the worst ever.  It took them 3 days to get an installation of Prestashop right and when I go to customise and setup the site itself, it falls over as there is simply no resources available..  I have an absolute stack of support tickets that prove that they are in breach of the SLA yet they do nothing about it...  DONT GO WITH THIS COMPANY AT ALL AS YOULL BE DISAPPOINTED, FRUSTRATED ADN RIPPED OFF...", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "02/11/2014", "review_title": "“this website very very bad and  them delete my data...”", "service_name": "services", "reviewer_name": "ahmed s.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "this website very very bad and  them delete my data  and not tack backup from data and server ever hour down\r\nand delete ticket wen i make it so them delete my data \r\nand when i complain then suspend my account", "picture_urls": null}, {"category": "", "rating": "3.0", "reviewed_at": "09/02/2014", "review_title": "“I am with WebHostingWorld for 5 years now...”", "service_name": "services", "reviewer_name": "please k.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am with WebHostingWorld for 5 years now...\r\nI was looking for a cheap hoster and found it with whw.\r\nThe start off was $#*!ty, having problems. They couldnt get my site up and register my domain. I paid with paypal, after claiming money back via paypal, they got rude and upsad. Telling me I should close the disput at paypal or I will loose all, money and hosting. Also they told me paypal will not give refunds on virtual goods.\r\n\r\nSo I thought $#*! it.. Ill roll with it and see whats happened.\r\nThey set up my hosting and domain. After 6 month they had some issues and lost all my data without having a backup. \r\n\r\nSo from now on I am always backing it up myself. Support is over all quick, if you are polite. If you getting upsad and express it, they wont help! :-D\r\n\r\nI have different accounts now as its really cheap and giving me all I need...\r\nI wouldnt mind if they are more professional and friendlier. But as long as they are dirt cheap, it works for me.\r\n\r\nIts a company you shouldnt invest to much into. And always back urself up :-DD\r\n\r\nPs: watch out. When you pay stuff in advance to get extra 3 month, they never been setted correctly!!! I always needed to inform them, that I paid in advance and want my extra month. They always adjusted it, but not without asking/telling!!", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "17/01/2014", "review_title": "“I was with Webhostingworld.net for 2 years”", "service_name": "services", "reviewer_name": "Robin P.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I was with Webhostingworld.net for 2 years. After the first year the hosting continued to go down hill. It was more like 75% uptime. They must have started me off on the good server, then after a time moved my site to a less functional server or something. The customer service had gotten so bad that they would simply paste a link in the chat to direct you elsewhere. General questions like \"why is my site down\"? Would now require a support ticket. I moved my site to another host, it costs more, but I am getting what I pay for...so-to-speak. I referred WHW hosting to others in the past who either ended up retrieving a refund before the end of 30 days which WHW makes very difficult; or if they missed the 30 day money back, they simply moved their site. I moved my sites, but WARNED others that WHW was a frustration but an inexpensive way to get set-up....THAT'S ALL!!!. Unfortunately, not many people are as patient as I was.\r\n\r\nI am now building a site for a customer who insisted on inexpensive hosting just to get the feel of managing her own website. So I came back to WHW. I knew what to expect, but I am here to enlighten others that after 3 years it has simply gotten worse. \r\n\r\nMy new experience: It has been 3 days and the site is still not activated. The temporary url does not work either. For the last 3 days I have been told that the site will be up in just a few hours. The home page states \"Free Set-up and Instant Activation\", that's fine if in your language \"instant\" means 3 days; regarding the 30 day money back guarantee, on the second day that the site was not up I asked how I go about getting a refund, I have been continually told the site would be up in just a few hours. Going into day 4 I am still being told to wait just a few hours.\r\n\r\nMY RECOMMENDATION: $1.00 a month is appealing when you are setting up and designing a site. BUT!!! you are getting what you pay for. The home page Boast are NO LONGER TRUE! They were when I used this hosting for my sites for about 6 months, 3 years ago, NOT ANYMORE!!! The customer service is 24/7 HORRIBLE. If you venture in for the appealing $1.00 a month deal, just forget customer service, and put in a support ticket, you will spend less time waiting for an email than you will on a chat with customer service.\r\n\r\nAlso, I am pretty sure all of those other recent comments about how good the service is were written by the staff or the owners. But if you want to test the comments try it. They OFFER a 30 day money back guarantee???? At least that's what it says on the home page. Just remember if you use Paypal to pay for the service, I hear Paypal does a pretty good job of getting you your money back for you.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "10/12/2013", "review_title": "“I am beginning to see a pattern”", "service_name": "services", "reviewer_name": "A F.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am beginning to see a pattern. One of my client's domains was simply erased, all the html/php files, e-mail accounts, ftp accounts, all of it just gone. They got the e-mail and ftp accounts back in a few minutes but not the files.  They offered no explanation as to how or why it happened and got defensive when I asked to know how it happened so that I could avoid it in the future.\r\nThey apparently have no access (or don't know how to access) the basic server logs that would tell us the who, when and how of the failure.\r\nThey seem to just not care. Very bad if you want to give good service to your clients but can't get it from your provider.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "14/11/2013", "review_title": "“THEY ARE WORST EVER POSSIBLE”", "service_name": "services", "reviewer_name": "HOSTPRO N.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "THEY ARE WORST EVER POSSIBLE\r\nIF ANY ONE WANT TO LOSE MONEY GO THEM\r\nI AM RESELLER 1HOSTPRO.NET AND MY EXP. WITH THEM ARE VERY BAD", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "23/10/2013", "review_title": "“I recently made the switch Webhostingworld.net after...”", "service_name": "services", "reviewer_name": "Steve P.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I recently made the switch Webhostingworld.net after hearing a lot of good things about them from my friends and colleagues, and I'm glad I listened. The service is great, I've never had issues with my site being down and the fact that they made it easy for me to set up a blog on WordPress has made me a fan. Also billing team is so prompt and   sorted my double payment issues  within 5 mints. I'd recommend their service to anyone who is looking to set up any kind of website.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "07/09/2013", "review_title": "“Total and complete scammers”", "service_name": "services", "reviewer_name": "CBR R.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Total and complete scammers. Deleted the data accidentally and would not put it back again, saying backups had been \"lost\" NEVER REFUNDED MONEY. TOTAL SCAMSTERS  - AVOID WEBHOSTINGWORLD.NET -  This is a fraudulent website with among the lowest service standards and the rudest customer service staff on the Internet. A big THUMBS DOWN for these scammers! Don't waste your time and don;t throw away your money.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "22/04/2013", "review_title": "“Im very impressed by how genuine and personable the...”", "service_name": "services", "reviewer_name": "Carolyn W.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Im very impressed by how genuine and personable the customer service is at webhostingworld and know that my future work will be in good hands!!", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "17/04/2013", "review_title": "“Im a customer of webhostingworld for more than 3 years...”", "service_name": "services", "reviewer_name": "Leatrice G.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Im a customer of webhostingworld for more than 3 years now, with very positive experience. In this one year of hosting, I had only once an email problem, when their server was down. This at the very beginning of the subscription. Today Im still a happy customer of them and I found this page with a nice review and wanted to leave a positive response. Congratulation for the great work and for keeping my business live.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "04/02/2013", "review_title": "“Hi Friends”", "service_name": "services", "reviewer_name": "Cidy S.", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Hi Friends\r\n\r\nI write here to share my experience with WebHostingWorld.Net\r\n\r\nOn April  2012 I bought a webhosting and domain (Bronze Plan) with total amount $ 27.00 USD and I paid it with PayPal on that day. Then I tried to write on my webhosting page but when I wanna to publish my website, my domain name is still unregistered then I wrote an email to billing@webhostingworld.net, and they replied that my domain still in processing Please feel free to contact us back in case of any further information. Thank you, Branda Taylor, Technical Support Department, WebHostingWorld Inc\r\n\r\nAfter waiting for long long time but my domain name is still unregistered, I re-wrote an email  but till this day February 5,  2013 they never reply my email again.\r\n\r\nIs Really Scam ?", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/webhostingworld.net", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "19/05/2016", "review_title": "“Hosting-marketers.com is the best host for broadcasting (Wowza)”", "service_name": "services", "reviewer_name": "Luca B.", "absolute_url": "https://www.sitejabber.com/reviews/hosting-marketers.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been using Hosting-marketers.com for broadcasting to my relatives  and friends. I wanted to be independent and do not depend on the rules on the various video hosting services. I started account with them. It was 100% new stuff  for me. But with help of super fast and very polite and friendly stuff of Hosting-marketers.com I managed to setup my web site and my first broadcasting.\r\nI was in contact with Carla and on my stupid (I do believe they were stupid)  I always got very fast and helpful responses from Carla. Together we managed to setup everything and I become some kind of expert.\r\nSo their customer service is absolutely amazing and helpful!\r\nI do recommend them to everyone!", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/hosting-marketers.com", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/hosting-marketers.com", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "04/06/2018", "review_title": "“No Problems!”", "service_name": "services", "reviewer_name": "Kurt G.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "This host is fast and responsive whenever I contact them and their pricing policy is simple and affordable for the webmasters with a tight budget. Their tech staff is helpful for me and they are skillful and knowledgeable.", "picture_urls": null}, {"category": "", "rating": "3.4", "reviewed_at": "11/08/2017", "review_title": "“Horrible support”", "service_name": "services", "reviewer_name": "Dustin K.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I got transferred to their advanced domain support team. I was told they would contact me through email. A week later still no response and I cannot use the service I am paying for...", "picture_urls": null}, {"category": "", "rating": "3.8", "reviewed_at": "09/06/2017", "review_title": "“Good for Wordpress Sites”", "service_name": "services", "reviewer_name": "Jenna B.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have used Bluehost for more than 5 years. They are well optimized if you are running a Wordpress site. That is their specialty. The one complaint I have about them is the customer support. The wait time is long. And once you get them on chat they are chatting with ten other people at the same time so that entire process is very long as well. Call them instead of trying to use chat if you are short on time. They no longer have a ticketing system at all. So, it's chat or phone only.", "picture_urls": null}, {"category": "", "rating": "3.8", "reviewed_at": "07/06/2017", "review_title": "“They never reply email”", "service_name": "services", "reviewer_name": "James X.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "They never reply custom email, even i have ticket number.No once, twice. If you want use their hosting, Think about it.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "01/04/2017", "review_title": "“BlueHost earned name--blue in the face from frustration of dealing with them”", "service_name": "services", "reviewer_name": "thecolokid s.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "14 tech support phone calls in 2 weeks should be a red flag. Heck, it should be an arsenal....don't walk--RUN the other way as fast as you can. I host my personal email as well as business email and website through BlueHost and have for more than 3 years. Suddenly in the last year their serve tanked, as has my website and mail numerous times.\r\nFirst let's talk about overall run time.  My website has been down more than 6 times in the last 8 months.  For a small business, that is a death sentence. It was even down the day I was scheduled for a redesign with my webmaster--great  My email went down several times as well, randomly, and I never knew it.  Then the biggie.\r\nThey shut off my accounts and turned off my website without notification.  It turned out they had expired. Well, I had called them more then 6 times, spending more than a total of 4 1/2 hours on hold trying to renew my accounts without ever being able to reach anyone.\r\nSo I renewed (don't ask me why), and they turned everything back on. The very next week I received a maintenance notice that they were doing \"emergency\" work on my server to protect my information and provide better service and my email would be down for 2 hours overnight. I awoke the next morning to NO email, past or present, so another 45 minute call for them to locate my emails and then reload them.\r\nLet's talk about tech support.  I bought a new iPhone and changed from an android, so needed new settings.  That took 3 phone calls.  And then, after they reset my account, it took another 5 phone calls to get the correct settings for my iPad and iPhone, with each tech person telling me something different.  They told me they could only provide me one solution and if that didn't work, I had to call back. Really????\r\nTech support hold times average 30 minutes to 50 minute just to reach a live person.  They all will confidently provide you their working solution, but often it is incorrect, causing frustration and the need to start all over again.  There are no supervisors to talk with and they have removed any process by which you can file a complaint.\r\nBottom line--they were once in the top 10 hosting companies consistently and now are consistently omitted from the top ten list.  I think that says it all.\r\n\r\n***Update 4/10/17 Email was once again totally wiped out. Took 47 minutes on hold, 19 minutes of issue \"resolution\" for them to tell me they didn't know what the issue was, but they could do a restore of the last backup from 3:23 am today.  So they did, and there were no emails since 4/2/17.  I tried to move service to another host company and BlueHost locked up emails.  Nothing is easy with this inept company.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "18/10/2016", "review_title": "“Excellent Customer Service”", "service_name": "services", "reviewer_name": "Auction B.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I've experienced nothing but excellent customer service in setting up our account. I researched several companies for my hosting needs and am so pleased I decided to go with Bluehost.", "picture_urls": null}, {"category": "", "rating": "2.7", "reviewed_at": "17/08/2016", "review_title": "“BLUE HOST IS THE BEST”", "service_name": "services", "reviewer_name": "larry p.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been with BlueHost for over ten years.  Has everything been perfect?  Of course not.  There have been a few hiccups here and there.  I don't know what those who give this less than a five are doing, but it is certainly not the BlueHost I have known over all these years.  Their tech support is outstanding.  Always helpful and knowledgeable.  Yes, there was a time where it took up to 30 plus minutes to connect.  That has mostly be solved now.  But, for me, I would rather rate for good service than to get someone who doesn't know that they are doing fast!  I have never had a problem or question go unsolved or unanswered.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "15/06/2016", "review_title": "“An Angel in Bluehost”", "service_name": "services", "reviewer_name": "Germaine C.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Bhavani was really an angel who is able to help me solve my issues after my attempts to fix my website. Without her quick and professional skills, i might still be struggling. Thank Bhavani.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "23/03/2016", "review_title": "“POOR SERVICE KIDS TRYING TO BE $#*!Y ADULTS”", "service_name": "services", "reviewer_name": "margaret c.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "POOR SERVICE MONEY HUNGRY COMPANY.  ASTRONOMICAL WAIT TIME, TRANSFERRED AROUND TO AVOID DEALING WITH PROBLEMS\r\nTOOK MY MONEY FOR 3 YEARS PRE-PAY AND DISCONNECTED MY DOMAIN.  DISORGANIZED COMPANY AND DANNY ASHWORTH THE OWNER HIDES FROM THE PHONE CALLS\r\nBEWARE OF THIS COMPANY GO ELSEWHERE", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "08/11/2015", "review_title": "“Stay away! hungry for money and loss of time & sites”", "service_name": "services", "reviewer_name": "Umair R.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I've been user of Bluehost for past 2 years. 1st year everything was going seems great but then suddenly my sites went down after every couple of weeks. They said my sites is being attacked of Malwares, and then they recommend to purchase their another security (SiteLock) services for keeping sites secure.\r\n\r\nThis is all bull***t, if thats the case than my sites could have went down from first month. I've been user of Bluehost for past 2 years. 1st year everything was going seems great but then suddenly my sites went down after every couple of weeks. They said my sites is being attacked of Malwares, and then they recommend to purchase their another security (SiteLock) services for keeping sites secure.\r\n\r\nThis is all bull***t, if thats the case than my sites could have went down from first month. So i warn you to choose this at your own risk.", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "17/09/2015", "review_title": "“Hungry for money, slow in action”", "service_name": "services", "reviewer_name": "Fawad H.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "These people would just take your site down without a reason. My site got hacked once, and they wanted me to buy their DOCTOR package of 200$ dollars to fix it. I somehow fixed it by spending a whole night. Few days went by and they took down my site again, this time without concrete reason. Their ultimate aim is to leech off you and grab as much money as possible. These f****** wasted 6 months of my hardwork.I want my 100$ refund", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "01/04/2015", "review_title": "“Very cheap prices”", "service_name": "services", "reviewer_name": "Paul C.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I used Blue Host for my site based on the novel I wrote called Isaac the Runner. They allow unlimited email accounts, space, hosting and file transfer. The prices are very cheap. If you want a web site, I'd recommend Blue Host. That's about it.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "09/02/2015", "review_title": "“I have been their customer for nearly 4 years now and...”", "service_name": "services", "reviewer_name": "augusto f.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been their customer for nearly 4 years now and I have experienced a very good service. When I reported a problem they responded and solved my issues fairly fast.", "picture_urls": null}, {"category": "", "rating": "2.0", "reviewed_at": "27/03/2014", "review_title": "“Good for your website hosting”", "service_name": "services", "reviewer_name": "Nick H.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Good for your website hosting", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "23/01/2014", "review_title": "“My site has run on bluehost over 3 years”", "service_name": "services", "reviewer_name": "JesusK M.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "My site has run on bluehost over 3 years. run good.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "21/02/2013", "review_title": "“An absolute nightmare”", "service_name": "services", "reviewer_name": "Michael G.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "An absolute nightmare. My CPanel experience was not good. Don't get duped by their BBB rating or affiliate reviews. Customer service is hit or miss. When something goes wrong - they don't take responsibility. I cancelled the same day I signed up. Stay away!", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "23/09/2012", "review_title": "“I am using http://www.bluehost.com as my web hosting...”", "service_name": "services", "reviewer_name": "Gi D.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am using http://www.bluehost.com as my web hosting service for more than one year now. And I must report what it's going on with my account on this web hosting because it's unbelievable! It's a nightmare.\r\nI am having problems with my cpanel and email's password; I am having problems with my websites, which suddenly start missing pages, missing files ... I strongly believe somehow Bluehost is an unsecured system. Someone inside bluehost is infiltrating into my bluehost cpanel and deleting and changing passwords, files and databases. Alternatively, letting someone else have access to my account login info to do all these things mentioned. Because I don't believe on internet ghosts, must be someone! \r\nSometimes I am not able to log into my cpanel with my own password; sometimes I make uploads through FTP, and the files doesn't get uploaded they just vanish; today all pages from my e-commerce are missing. I have contact them about all these matters at abuse@bluehost.com. However, it doesn't stop the insanity.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "28/08/2012", "review_title": "“Great hosting site”", "service_name": "services", "reviewer_name": "bruce b.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Great hosting site.  Highly recommended.\r\n\r\nI'm a pretty experienced geek.  So when I call for assistance I'm never happy to get connected to an ESL person named \"Justin\" with an Indian accent and who only knows how to read a script.  That won't happen to you at bluehost.  \r\n\r\nBluehost is reasonably priced with acceptable performance on their shared-hosting plans.  They don't spam me 4 times a week with sales promotions either.\r\n\r\nIf you're looking for 'nix-based hosting, particularly with drupal.  Just go to their site and sign up.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "05/07/2012", "review_title": "“Never had a problem with Blue Host, except their pricing”", "service_name": "services", "reviewer_name": "Amy G.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Never had a problem with Blue Host, except their pricing. When I signed up, it was implied the domain and hosting fees were locked in, but they keep increasing (by a lot). Excellent hosting though - the cPanel has all the features most anyone needs, and the servers are virtually never down.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "02/01/2012", "review_title": "“Was down too often than online”", "service_name": "services", "reviewer_name": "max d.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Was down too often than online", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "10/09/2011", "review_title": "“Stay away!”", "service_name": "services", "reviewer_name": "Brooke S.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Stay away!\r\n\r\nMy domain was stolen and their customer service is all over the place, am having a very hard time.  About a year ago I was worried my account had been compromised by some developers that used to have access to it, I wrote them with these concerns and they assured me everything was fine.  At that point I was busy with work and did not have time to re-purpose the domain, recently I wanted to bring her back to life and attempted to access by domain via bluehost.  I was unable to do so, my account had been stolen and the name had been changed.  I am no longer the owner of the account. \r\n\r\nI have had 2 agents over the phone confirm that they can see a lengthy support history with me.  We also found that in the bluehost TOS it states that one must give written consent to transfer ownership of a domain or a court order must be issued (section 4, A).  Neither of these happened, but they transferred ownership anyways, breaking their own TOS.  The last agent over the phone said that if I sent in my bank statements showing the original hosting charges and a copy of my photo ID via email they would restore the account to me.  Then via email they told me I needed to get a court order.  WTF?  Upon realizing I was being told different things by different people, I called back to get the name of the last person I spoke with.  The agent was extremely rude and said that they had no record of me calling.  Seriously guys... this is unnerving and you have a very mixed bag of agents and answers.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "24/09/2010", "review_title": "“They have unrealisting CPU limit, don't allow sites...”", "service_name": "services", "reviewer_name": "Suhail M.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "They have unrealisting CPU limit, don't allow sites with good traffic. If you have heavy traffic site avoid this.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "12/06/2008", "review_title": "“my favorite web hosting provider is bluehost”", "service_name": "services", "reviewer_name": "Rich P.", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "my favorite web hosting provider is bluehost - I have tried many other hosting options including one's like godaddy and verio, but after reading reviews of web hosting companies, it seemed like everyone really liked bluehost. They cheap, they have free domain name registration forever, great support, dedicated IP, and support all of the code that I need. I think pretty much everyone should be using them and I see no reason to go to other companies for hosting anymore. Plus, I have never really noticed any downtime from them.", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/bluehost.com", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/bluehost.com", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "25/07/2014", "review_title": "“Awesome Web hosting company the Future Hosting”", "service_name": "services", "reviewer_name": "John P.", "absolute_url": "https://www.sitejabber.com/reviews/futurehosting.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Awesome Web hosting company the Future Hosting.", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/futurehosting.com", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/futurehosting.com", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "06/06/2018", "review_title": "“Poor very poor”", "service_name": "services", "reviewer_name": "jarrow m.", "absolute_url": "https://www.sitejabber.com/reviews/hmchosting.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "You are on your own , even if you pay like us, a 100 dollars a year. \r\nWhen we ask for help nobody answers , and even if they do , they are to bored to explain. So yes, my rating after 5 year collaboration with them is zero . \r\nsorry HMC but other services provide Top service and less money for 10GB space!!!!", "picture_urls": null}, {"category": "", "rating": "4.3", "reviewed_at": "18/10/2016", "review_title": "“Great work. super fast resaults!”", "service_name": "services", "reviewer_name": "Archi Y.", "absolute_url": "https://www.sitejabber.com/reviews/hmchosting.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Reagan built a website for our company and it is super effective, easy to manage and turn to be really affordable. Timing was great too. Definitely will do business again.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "11/08/2016", "review_title": "“Very Impressed!”", "service_name": "services", "reviewer_name": "Diane D.", "absolute_url": "https://www.sitejabber.com/reviews/hmchosting.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Reagan wandered into our shop several months ago and said he could re-work our website.  He offered me a great price and over about 8 weeks we totally created a new site.  Reagan was helpful, always willing to go find answers to anything he didnt know.  Responsive to any little quirky thing I wanted like a more purple color.  He made sure everything was working at every step and took care of the technical things I didnt know how to do.  This was a good investment and I would highly recommend Reagan and HMC hosting / McClellan Software development.\r\nThanks\r\nFigments Tea Shoppe", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "20/12/2015", "review_title": "“Great Portfolio Website Creation!”", "service_name": "services", "reviewer_name": "Joshua V.", "absolute_url": "https://www.sitejabber.com/reviews/hmchosting.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Fast, efficient, and professional website design! Site has gotten me multiple job offers! A+", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "04/11/2015", "review_title": "“Great Customer Service!”", "service_name": "services", "reviewer_name": "manny r.", "absolute_url": "https://www.sitejabber.com/reviews/hmchosting.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "These guys helped from start to finish with our website, and provided web hosting for us. I really recommend these guys. Friendly customer service.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "02/11/2015", "review_title": "“Fantastic service, VERY reasonable in price!!”", "service_name": "services", "reviewer_name": "Nicholas B.", "absolute_url": "https://www.sitejabber.com/reviews/hmchosting.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I own a small business in New Mexico, and these guys were very professional in regards to helping me with a new website, and they were also very reasonable in cost!! I HIGHLY recommend their services!!!", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/hmchosting.com", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/hmchosting.com", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "12/06/2018", "review_title": "“Always there!”", "service_name": "services", "reviewer_name": "Jimmy T.", "absolute_url": "https://www.sitejabber.com/reviews/walkerhosting.co.uk", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Customer service is 2nd to none! By far the most reliable and knowledgeable company i have come across to date. Last year i migrated my server to Walker Hosting and now i have 4 dedicated servers with them. I look forward to doing business with them as it is always a pleasure.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "05/11/2017", "review_title": "“Amazing Quality Service”", "service_name": "services", "reviewer_name": "Stuart J.", "absolute_url": "https://www.sitejabber.com/reviews/walkerhosting.co.uk", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Dealing with people in IT can often be difficult when you are reliant on their knowledge and ability. Having the right partners is imperative, and working with a company like Walker hosting running your server makes life so much easier, I can't stress enough how good these guys are. After using various companies we found Walker hosting, nothing is too much for them, their support system is reactive and they communicate. We run ecommerce sites and having the right company to run your servers is paramount, we have found that in Walker Hosting. If you are thinking of working with them, I would 100% recommend them.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "04/11/2017", "review_title": "“Unbeatable”", "service_name": "services", "reviewer_name": "Jon T.", "absolute_url": "https://www.sitejabber.com/reviews/walkerhosting.co.uk", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "By far the best hosting company Ive used, and I have used a lot. Customer service and effort is always 10/10 every time.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "03/11/2017", "review_title": "“Amazing and flexible service”", "service_name": "services", "reviewer_name": "Or P.", "absolute_url": "https://www.sitejabber.com/reviews/walkerhosting.co.uk", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am a a client of almost 100 hosting companies and I must say that WH provided better service then any of the others.\r\nI was a client of countless of hosting companies that had slow and lazy support reps that act like they don't even want to solve my problems. WH was totally different from anything I have experienced before. They were fast, kind, and flexible. I'm really impressed by both their tech support and sales reps.\r\nI rarely write reviews on companies but this one deserve it.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "02/11/2017", "review_title": "“First class support”", "service_name": "services", "reviewer_name": "Michael P.", "absolute_url": "https://www.sitejabber.com/reviews/walkerhosting.co.uk", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I've had a few issues with Wordpress sites over the past few months. I'm not the most technical and Walker Hosting have helped me sort out all the issues.", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/walkerhosting.co.uk", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/walkerhosting.co.uk", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "23/09/2016", "review_title": "“Great service, great hosting Provider”", "service_name": "services", "reviewer_name": "Harish K.", "absolute_url": "https://www.sitejabber.com/reviews/hostingproviderindia.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Basically I am website designer and Developer and tried & tested almost all reputated hosting companies in India as well as USA. I am blessed with having found the best Web Hosting company ever. Great service, great hosting, and the staff are amazing especially guy name Harish Kumar. Great hosting packages at lowest price in India, your site is never down. Just does not get better than this company.", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/hostingproviderindia.com", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/hostingproviderindia.com", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "07/11/2016", "review_title": "“Outstanding Customer Service and Tech Support - In Motion Hosting”", "service_name": "services", "reviewer_name": "Vann B.", "absolute_url": "https://www.sitejabber.com/reviews/inmotionhosting.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "As a web developer since 1995 I have worked with dozens of hosting companies over the years. I found In Motion Hosting through a client who was using them for their website hosting. About two years ago I purchased a VPS package with them and after a few months, I began moving a number of client websites over to the new VPS. I currently have about 35 client and personal hosting accounts within the VPS (Virtual Private Server).\r\n\r\nFor most website developers, having a responsive support team for troubleshooting websites is a necessity. Getting support is very straight forward. For non critical issues, I will open a support ticket and typically these tickets are responded to within an hour or two. They also offer online chat for more immediate issues and you can also talk to a support team member by phone.\r\n\r\nWHAT IS SUPPORT?\r\nSupport is not where the hosting provider tells me how to build a website or how to install specific software on the server or how to tweak website code.\r\n\r\nSupport is help configuring the server or assisting when a WordPress website suddenly has a white screen or won't connect to a database. Or it is help when a website is moved from another server and the website is not displaying correctly on the new server.\r\n\r\nSupport is also help bridging the gap between what I can do with my WHM (Web Host Manager) dashboard and more complex situations where I need help getting pointed in the right direction.\r\n\r\nIn my opinion, In Motion Hosting sets a good example of how great customer service, a can-do attitude, and a consistent follow-through on technical issues all go together to create a great customer experience.\r\n\r\nHOSTING VALUE\r\nOften web developers gravitate to the lowest cost hosting companies, which is fine in theory. Who doesn't want a lot for very little?  But my experience has shown that you get what you pay for.\r\n\r\nTypically, low cost hosting services cut corners in order to provide extremely low cost hosting and often this means tech support suffers. I have learned this lesson the hard way.\r\n\r\nI have also learned that my time is valuable, and hosting companies like In Motion Hosting who are responsive and helpful make my job easier and actually save me time. The last thing I need is for a technical issue to drag on for several days and for a client to have a problem with their website that drags on and on.\r\n\r\nWith In Motion Hosting I have the confidence that they are there to help me when I need help and they keep everything running smoothly.\r\n\r\nI believe their pricing to be competitive and while they are not the least expensive, they are not the most expensive, and for me, they provide value.\r\n\r\nRecently I added a second VPS and I will soon have another 10 or so websites moved over from my old hosting company.\r\n\r\nLastly, I am not being paid to offer this review.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "08/08/2011", "review_title": "“Switched to InMotion after a TERRRIBLE experience with...”", "service_name": "services", "reviewer_name": "Kathy H.", "absolute_url": "https://www.sitejabber.com/reviews/inmotionhosting.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Switched to InMotion after a TERRRIBLE experience with Netfirms, that caused site to be down for 5 days.  Hugely better customer service, (that's not in India) and very helpful.  Great features for the price too.  Highly recommend them.", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/inmotionhosting.com", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/inmotionhosting.com", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "01/02/2016", "review_title": "“Warning about Webhostinghub.”", "service_name": "services", "reviewer_name": "Alan J.", "absolute_url": "https://www.sitejabber.com/reviews/webhostinghub.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "After reading some good reviews (How many are posted by them?) we decided to go with Web hosting hub. We found their support staff to be good but limited in what they could do.\r\n\r\nThey then received an INVALID and fraudulent DMCA take down request which they had been notified of in advance, instead of just removing the image and contacting us they totally suspended our account without any warning and would not even allow us to remove the content.\n\nEven when we offered decisive proof that the request was invalid their unethical and unprofessional legal department acted totally wrong and refused to activate us again.\r\n\r\nNow despite any or all good things one may read about this unbelievably bad hosting group and their incredibly incompetent legal department it is of no use when your website is suspended and they will not act in accordance with their many boasts about how \" the customer comes first\"\r\nThis seems to me to be false and misleading advertising from this very bad hosting organization.\r\n\r\nIf anyone is thinking of going with them I suggest you look elsewhere if being up and running is of any importance to you.", "picture_urls": null}, {"category": "", "rating": "2.8", "reviewed_at": "14/10/2013", "review_title": "“I am highly impressed with the service provided by...”", "service_name": "services", "reviewer_name": "james s.", "absolute_url": "https://www.sitejabber.com/reviews/webhostinghub.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am highly impressed with the service provided by webhosting hub. They are really reliable and easy going. easy to handle service and great support ultimately turned to be the best user experience. services are affordable. I have hosted and registered almost all of my websites from webhosting hub.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "14/10/2013", "review_title": "“I like webhostinghub very much”", "service_name": "services", "reviewer_name": "Arthur B.", "absolute_url": "https://www.sitejabber.com/reviews/webhostinghub.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I like webhostinghub very much. These people are really nice. they are always ready to help you with good service.", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/webhostinghub.com", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/webhostinghub.com", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "30/01/2018", "review_title": "“Horrible. Run.”", "service_name": "services", "reviewer_name": "wolke a.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "1) They claim \"24/7\" phone support on their website. All calls go to voicemail. They do not return calls. Later, I've been told they do not answer phone calls and I should use the ticket system\r\n2) They do reply to tickets. As unhelpful and rude as they can. \r\n3) I am on the \"business\" plan. Yet, I am not allowed to store as much as ONE recent backup on their server. \r\n4) When there was a technical problem caused by them, they restored an ancient backup without my permission and deleted several posts and pages - the work of days. \n\nHORRIBLE COMPANY. RUN. \n\nYou will see more reviews like this in the future. From the older positive reviews, I figure this was a good company at one point. \n\nIt's not anymore.", "picture_urls": null}, {"category": "", "rating": "4.5", "reviewed_at": "13/11/2016", "review_title": "“Reliable performance and excellent support”", "service_name": "services", "reviewer_name": "Russell S.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "When I signed up to 247-host 11 months ago, I was somewhat skeptical about server performance and support considering the low monthly cost. I had switched from a dedicated server to a VPS (with more memory and bandwidth) for a monthly fee of one-third of what I was paying before. So there had to be a catch, huh? \r\n\r\nFortunately I was wrong! Server performance has been excellent; uptime has been 100%; and when I needed support (mostly issues due to my own fault) it was prompt and always solved the problems.\r\n\r\nIt is great to have not have to worry about this component of my technology consulting business. I highly recommend 247-host to anyone looking for a cost-effective and reliable hosting service!", "picture_urls": null}, {"category": "", "rating": "3.8", "reviewed_at": "29/01/2016", "review_title": "“Very good host”", "service_name": "services", "reviewer_name": "Gordon W.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been with Arvixe for several years. Due to their lack of support, I started looking and found 247-Host. I am now in the process of moving my VPS account from Arvixe to 247. I had a service request pending with Arvixe for about 15 days before I got any response. At 247, service is excellent and very prompt - I have been getting a response in minutes instead of days.", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "22/06/2015", "review_title": "“Customer's Reviews”", "service_name": "services", "reviewer_name": "Othem A.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am customer of 247-Host, my experience of this company is good! I consider that support department is strongest part of this company. A swift 24 hour, multifaceted service delivering well. The support representatives can write perfect English, have good intelligence level to understand what I am saying.\r\n247-Host is surviving in tough business as it up time is great. My forum would never go down If youre a beginner and need help in almost everything, Id recommend 247-host.", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "17/06/2015", "review_title": "“A GOOD HOSTING COMPANY INDEED”", "service_name": "services", "reviewer_name": "hises j.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "247-is a good choice when it comes to selecting a reliable hosting.  The features they offer for a suitable price and sound technology are all near perfect.  My personal observation is that their team is friendly and help as I needed was readily available. So they offer good features at low price and on top of it reliable backup service. I have Hosting service with 247-host for my websites and will continue in near future too. I also recommend this company to the readers here. May be it help someone who is looking for decent web hosting service.", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "28/05/2015", "review_title": "“My review about 247-hosting”", "service_name": "services", "reviewer_name": "Larry E.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Solid Hosting. Recommended due to following reasons:\r\n\r\n1) Good support. \r\n2) Low Prices.\r\n3) Good server speed and up time.\r\n4) Old /experienced company with little or no hiccups in the processes.\r\nI would highly recommend 247-Host.com !", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "09/05/2015", "review_title": "“THANKS FOR 247-HOST”", "service_name": "services", "reviewer_name": "JamesH H.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Through this review I want to express my thanks and satisfaction with 247-host / their staff. Last night I inadvertently deleted my entire public_html directory, and it caused my main business website to go down. For obvious reasons it pressed the panic button inside me, have to rebuild the entire website? how much time? effort ? Money ? almost cried was in a hot mess!\r\nSO. I thought it was a long shot, I called 247-host, the technical support who just calmed me so, so instantly, telling me I had a package with them which would allow daily backups. also he educated me on how to take own backup from Cpanel, because I had never done one! I opened a ticket online to get a file restore. This man went above and beyond my expectations, and gave me hope.\r\n\r\nWithin an hours I got my website back, up, running, haha no new website to make, thank you 247-host.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "25/04/2015", "review_title": "“Apreciable Hosting”", "service_name": "services", "reviewer_name": "Thomas W.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I really appreciate 247-host for good work they are doing. 247-Host have been fantastic company for my web hosting. Their email and web servers, have never given me trouble. billing is reliable, prices are super cheap and their service and attention to details in just wonderful. In 247 host all features are useful for customers like publishing of web deployment. It is configured well and works good without any problems.\r\n\r\nI wish 247 also cotinue to work as they are. Good work.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "19/04/2015", "review_title": "“STRONGLY recommend 247-Host.com for web hosting of business, why So?”", "service_name": "services", "reviewer_name": "Natividad B.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been with 247-Host.com for about a year and I can say that their support is \"up to the Mark\", quick and intelligent.\r\nI have never liked that dumb \"how can I help you\" and than \"One of our staff would get back to you\" types of response.\r\nThe persons handling the support must be well trained to handle issues and give correct prompt replies to customers.\r\nThe techs at 247-Host.com walked me through what to do so as to make our transition as painless as possible.\r\nThey know it well and are doing it well.\r\nWell done 247-host, keep it up.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "03/04/2015", "review_title": "“Dependable”", "service_name": "services", "reviewer_name": "Tom B.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "247-host in not only one of the most affordable company in web hosting industry, but their overall service, particularly up-time is the most impressive. It has been over 99%, and my site hasn't gone down in months - by far one of the best, I have experienced in web hosting. Account setup speed, billing, technical support, server speed, features, and the general attitude towards dealing customers, I find these guys have worked out everything well, which is sign of a well settled company.\r\nI'd refer anyone to 247-hostfor a near perfect hosting experience to date and I would surely not hesitate in recommending them.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "23/02/2015", "review_title": "“Good Poeple to Be With”", "service_name": "services", "reviewer_name": "Hasna Y.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "247-host is a company with quick, fast and easy services. True value for Money as they say. Tech support - efficient - to the point - hassle fee. Pleasant change for market trends which are vague / time-consuming responses. Their support staff usually provides the information in the first few minutes without having to put me on hold and ask someone else. The staff really tries at every level to understand needs, rather than try to read a script at every turn. I recommend 247-Host to anyone looking for hosting option which is reasonably priced and good to work with.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "20/02/2015", "review_title": "“247-Host is disgusting!”", "service_name": "services", "reviewer_name": "Michael A.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I chose 247-Host after doing a lot research and saw it getting lots of good reviews. I signed up for shared hosting and proceeded to move several domains to my account.\n\nAlmost immediately I had a small issue where the system didn't respond for about 10 minutes every day from about 7am. I assume this is due to backups being performed. Bandwidth was ok, but other hosts have much faster page load times.\r\n\r\nMy trouble started when I woke up one morning with my entire account suspended. At 2am I had received an email from 247-Host informing me that one of my domains was causing too much load on their servers, CPU usage was 100% and I should sort it out. At 4am I got an email telling me that they had suspended my account due to the issue.\r\n\r\nI also had irate people shouting at me because their emails (which are for business) were now not working. This is a big issue. Surely their tech's could have taken down the offending page without suspending everything?\r\n\r\nThey then accused me of violating their terms of service by running an IRC chat on their server. Their technical knowledge is obviously very limited because they can't tell the difference between running an IRC server and LINKING to an IRC CLIENT in an iframe. They tell me this script was causing the issue:\r\n\r\n1. There is no way linking to a script that IS NOT on their server can cause the CPU to run at 100%\r\n\r\n2. I moved the site to a new server and the CPU load sits at a constant 0%.\r\n\r\nI deduce therefore that their server configuration is screwed up.\r\n\r\nI subsequently cancelled my account and asked for a refund of the remaining term which they refused to do, because I violated their term of service.\r\n\r\nThe obviously have no clue what they are doing.\r\n\r\nAll I can say is, STAY AWAY FROM THIS HOST!", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "19/02/2015", "review_title": "“My Favourite Domain Hosting Service”", "service_name": "services", "reviewer_name": "Betty R.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Ive used 247-Host and my experience is great! Their support is strongest part of their service. Not only its swift, but its 24 hour, whether it be through e-mail or live. The representatives understood and can write perfect English. Also, uptime is great. My forum would rarely go down if too much is going on at once, but the staff would assist in restoring things to keep service moving. If youre a beginner, and need unlimited almost everything, Id recommend 247-host.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "26/01/2015", "review_title": "“If  one wants to host a traffic rich and script laden...”", "service_name": "services", "reviewer_name": "Carey E.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "If  one wants to host a traffic rich and script laden website, you have to spend I would recommend 247-host. They provide private rocking servers, SSL, dedicated IP etc for their Platinum plan. They provide support at the fastest and websites run blazing fast, I can assure based on my personal experience with them. Well to this good web hosting company. 5 Stars.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "19/01/2015", "review_title": "“The BEST”", "service_name": "services", "reviewer_name": "Amanda J.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "The BEST. I've been with several hosting companies and 247-host.com are the best for me. Extra cheap reselling and the server was only ever down once in ten months for about 40 minutes. Great hosts, superb prices!", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "11/01/2015", "review_title": "“Points for 247-host”", "service_name": "services", "reviewer_name": "Quintin G.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Points for 247-host \r\n-- ONE -- low cost.Very low indeed  TWO -- No downtime THREE --  quick Support.\r\nEverything seems in place and working well.  I think they just need to keep doing what they are doing. \r\nYou know,  its not very common with people to come out here and to praise your service provider.\r\n Its only that when one is happy like me with services as my website is working well.", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "04/01/2015", "review_title": "“Top Notch”", "service_name": "services", "reviewer_name": "Lorene D.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Top Notch. Best people to be with. I selected them because of good reviews about them. I thought I must let others know about them. Lot can be said, but every one knows what is hosting about and these reviews are there to help others in avoiding bad guys and selecting good one.\r\nSo 247 is my recommended host as I have experienced them to be good.", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "29/12/2014", "review_title": "“I have just discovered that my website had disappeared,...”", "service_name": "services", "reviewer_name": "Sean L.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have just discovered that my website had disappeared, I could not find the site via Google search.\r\nI went straight to 247-host member login area, and clicked through for an online consultation with a technician. In a matter of seconds I had a person to speak with who was warm, welcoming and personable.\r\nShe found what the issue was, and the matter had a solution minutes later. This problem related to an expired domain (with another source).\r\nI recommend 247-host highest for your warm and welcoming service style that top-geared for customer service and complete satisfaction. With my limited web skills, your readily available assistance inspires my confidence and my trust.\r\nThanks so much.", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "24/12/2014", "review_title": "“I have been with 247-host for a couple of months now...”", "service_name": "services", "reviewer_name": "Mark W.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been with 247-host for a couple of months now and if you have to choose between hosting companies, go with 247-host, hands down. These guys are the best in the business in terms of web hosting while offering a plethora of other neat features, and i do mean a plethora. Their up-time is near perfect and their pricing also follows that suit. Go with 247-host, you wont be disappointed!", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "08/12/2014", "review_title": "“I had couple of problems concerning domain name and...”", "service_name": "services", "reviewer_name": "Nena C.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I had couple of problems concerning domain name and website hosting. The customer service helped me with huge attention to the level that each and every single issue continues to be fixed. I am just so much satisfied with the help of 247-host,I wanted and received to discuss this excellent experience. Thinking about the value they provide, possibly one of the best hosting service provider on earth.", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "01/12/2014", "review_title": "“I have been with 247-host for about 4 months now and...”", "service_name": "services", "reviewer_name": "Jeniffer F.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been with 247-host for about 4 months now and I will have to say that their Customer Service is absolutely amazing! If I ran into trouble, they are they are always ready to help. Even when I have had trouble in an area they do not typically give support in, if they can help, they will. And if they do not know, they will send me an email with instructions on where to find the help I need. I would recommend 247-host to anyone and everyone who has their own website. You will not find better support anywhere.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "23/11/2014", "review_title": "“I tried two or three web hosting companies before using...”", "service_name": "services", "reviewer_name": "Easter W.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I tried two or three web hosting companies before using web hosting hub. I am a beginner and required more help than maybe other people who would use a web hosting service might need. However, I found web hosting support extremely helpful at all times online chat questions are answered almost immediately I am enjoying hosting my blog and learning all the time.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "14/11/2014", "review_title": "“We have initially come across 247-host 12 months back...”", "service_name": "services", "reviewer_name": "james t.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "We have initially come across 247-host 12 months back and from that time until now, I must say that we have been overwhelmed by the hassle free IT environment that they are providing in addition to the personalized support from their friendly staff, With 247-host, I can trust them knowing that our IT infrastructure is in safe and capable hands. I wish them all the best and look forward to our continued business relationship.", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "10/11/2014", "review_title": "“I am very happy with 247-host”", "service_name": "services", "reviewer_name": "Russell O.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am very happy with 247-host. I were looking for a hosting solution for years and happened upon 247-host about a year ago. I can now host multiple sites and not worry about down time. I feel confident that my client's sites are secure. Their technical support is really good. I have used their tech support periodically throughout the year. Mostly for installation instructions and add-on instructions. They have always been knowledgeable, friendly, and politely supportive.", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "10/11/2014", "review_title": "“I am very happy with 247-host”", "service_name": "services", "reviewer_name": "Amanda S.", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am very happy with 247-host. I were looking for a hosting solution for years and happened upon 247-host about a year ago. I can now host multiple sites and not worry about down time. I feel confident that my client's sites are secure. Their technical support is really good. I have used their tech support periodically throughout the year. Mostly for installation instructions and add-on instructions. They have always been knowledgeable, friendly, and politely supportive.", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/247-host.com", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/247-host.com", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "14/02/2016", "review_title": "“Perfect Web Hosting Reviews from India”", "service_name": "services", "reviewer_name": "sumana k.", "absolute_url": "https://www.sitejabber.com/reviews/hostingcharges.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I was in search of finding deals and best hosting providers from India. I got hostingcharges.in from google search and was happy to see listed out all indian hosting providers. Got discount coupon also. Great web hosting community.", "picture_urls": null}, {"category": "", "rating": "3.8", "reviewed_at": "07/03/2014", "review_title": "“HostingCharges.in really a best hosting review website...”", "service_name": "services", "reviewer_name": "veena d.", "absolute_url": "https://www.sitejabber.com/reviews/hostingcharges.in", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "HostingCharges.in really a best hosting review website in India, where I was able to find complete Indian Hosting Providers. helpful for newbies, keep it up.", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/hostingcharges.in", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/hostingcharges.in", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "19/03/2018", "review_title": "“I can recommend hostingsource web host without reservation”", "service_name": "services", "reviewer_name": "Cerys H.", "absolute_url": "https://www.sitejabber.com/reviews/hostingsource.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Great! Thank you so much for your hard work. Out of all the people I have had to deal with in this process you have been the best! Their customer care and relation systems are worth all praises.", "picture_urls": null}, {"category": "", "rating": "4.4", "reviewed_at": "08/02/2018", "review_title": "“An outstanding and reliable web hosting service”", "service_name": "services", "reviewer_name": "Gladys L.", "absolute_url": "https://www.sitejabber.com/reviews/hostingsource.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "No issues gets unsolved... Got various levels of support personnels, so no issues gets unresolved. I am a hostingsource customer for two months. Everything is good so far and for every request i have, the RH support is great and solves every problem that i have.\r\nIt is nice to have the backing of the web hosting provider again.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "15/01/2018", "review_title": "“Hostingsource is good for hosting e-stores and blogs”", "service_name": "services", "reviewer_name": "Karl J.", "absolute_url": "https://www.sitejabber.com/reviews/hostingsource.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Hostingsource support is always fast, very succinct, helpful, friendly and straight to the point. Overall I can recommend this host to anyone needing an excellent hosting service but if you are just looking for a website space consider getting the help of a developer and leave the account management to companies that get paid to handle the technical problems.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "13/11/2017", "review_title": "“I do recommend hostingsource web hosting service”", "service_name": "services", "reviewer_name": "Steffanie P.", "absolute_url": "https://www.sitejabber.com/reviews/hostingsource.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Well, after several weeks of research I decided to sign up with HostingSource web host and bought their ssd vps hosting plan (for $8/mo) because I have found it to be stable host which was able to serve all my demands. I have been using its services for 8 months and once I had downtime, but their unrivaled support solved it immediately.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "20/08/2015", "review_title": "“Worse Hosting Company I ever dealt with”", "service_name": "services", "reviewer_name": "Allen L.", "absolute_url": "https://www.sitejabber.com/reviews/hostingsource.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "First of all they quoted me a dedicated server price on the first invoice they raised that price by $20.00 dollars a month. When I complained about it they cancelled my service before the end of the first month even through I have paid for that month in advance.  This is a production server and they deleted my server data without even telling me. Do NOT use them you will be sorry.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "03/10/2014", "review_title": "“One thing I must say about hostingsource.com is that...”", "service_name": "services", "reviewer_name": "Alexa T.", "absolute_url": "https://www.sitejabber.com/reviews/hostingsource.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "One thing I must say about hostingsource.com is that they have excellent customer service. When you use the online chat, someone answers pretty much instantaneously. You can't ask for more than that! And they are willing to help you out in any way they can.\r\n\r\nI've had my website with them for a number of years. It's solid as far as being up and running at all times.\r\nI love the prices. The server was down for about 15 minutes one month. That's pretty good up time!", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "06/06/2014", "review_title": "“I have been very satisfied with HostingSource thus...”", "service_name": "services", "reviewer_name": "Melo P.", "absolute_url": "https://www.sitejabber.com/reviews/hostingsource.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been very satisfied with HostingSource thus far. They respond quickly to concerns, and provide a top notch bargain price host. They were always quick to respond (usually within 15-20 minutes) with the solutions to my issues (or my dumb questions). They are quick and very friendly.\r\nGreat control panel interface, and many options. \r\nThe site has only been down a very minimal time during the time I host my site with them, it loads fast and the service is really professional.\r\nThey could do with a bit more space per user, but otherwise, I have been super impressed, so impressed, I now have 3-5 family members & friends using them.\r\nYou can go with this Host because you will not regret it!", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/hostingsource.com", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/hostingsource.com", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "21/05/2018", "review_title": "“Web site provider ALWAYS having site problems”", "service_name": "services", "reviewer_name": "Teri S.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "For many years Webs.com has always had technical problems, sites do not work properly or are not accessible at all. Horrible site builder. And they keep trying to get the users to upgrade to a PAID service. NO WAY would I pay for such a horrible service provider when I know that my site would not be accessible half the time.", "picture_urls": null}, {"category": "", "rating": "1.6", "reviewed_at": "09/05/2018", "review_title": "“Dishonest people. Be careful!! Tiffs!”", "service_name": "services", "reviewer_name": "Yori D.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I forgot to update my new credit card so when it supposed to be renewal for my domain they just took it. So when I realize my website doesnt work after 3 weeks I was told to pay $1500 for each domain and they can let me have it back. Real crooks!!! Stay away. Unless you looking to be out of business.", "picture_urls": null}, {"category": "", "rating": "1.1", "reviewed_at": "04/05/2018", "review_title": "“Crooks - 2nd Unauthorized Withdrawal Done by Webs.com - Unmaintained Site”", "service_name": "services", "reviewer_name": "rejoice a.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Horrible. No customer service. I had to do a research to find their phone number even though they stated on the site that I need to speak to a rep in order to get my refund for THEIR UNAUTHORIZED WITHDRAWAL from my funds. My institution will reverse the payment and refund the money that they stole. Btw, anyone needing to call them, it is 877--611-3285 and also sign up for gethuman.com/call-back/Webs-com ti talk to a human being.  After getting my refund I am done with them forever. Please find another website hosting company. At least one with a legitimate contact info offered on the site. This one has zero customer service.I just fell upon this url and it explains why Webs.com has no customer service and all of the unauthorized automatic payments made them. The site is owned by Vista Print and Vista Print chooses not to maintain the site. It is simply on auto pilot. NO ONE WORKS THERE ANYMORE accept a few virtual assistants that do not know anything about the product and can not solve any problems because they are not the problem solvers. Vista Print is and they do not want to be bothered with the problems of webs.com, just interested in getting money from the automated unaturhorized/.STOLEN money. Therefore, I will no longer be using Vista Print either. Here''s the site: www.sitebuilderreport.com/webs-review", "picture_urls": null}, {"category": "", "rating": "1.4", "reviewed_at": "11/03/2018", "review_title": "“Atrociously unprofessional”", "service_name": "services", "reviewer_name": "Andrea H.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "They made a mistake in processing a monthly payment plan set up in paypal as an automatic payment. So they sent me a threatening email stating that if I didn't pay within 48 hours they would close down my website and post a nasty message. I figured they had made a mistake so responded to their email but received no reply. They closed the website with a nasty message about not paying my account, all over the front page for everybody to see. So, I removed all my content and posted another message on the front page, underneath their nasty message about the website no longer being active and have now moved to a more professional server after being with them for 6 years. Absolutely disgusting.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "20/02/2018", "review_title": "“Woe to those who use Webs”", "service_name": "services", "reviewer_name": "Kevin C.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I pay for two websites. Today I sent them a ticket for a problem, and they have not even acknowledged receiving it. I have problem after problem trying to use this website. Today I wanted to change a theme--but the themes won't display. They have gone from okay to bad to deplorable. Every improvement ... hasn't been ... it has just made everything worse. I am getting out as soon as I decide who to go with next. They will get no more of my $$$$$. They are not even worth even a penny of your money.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "03/01/2018", "review_title": "“DO NOT GO WITH THIS HOSTER”", "service_name": "services", "reviewer_name": "Kevin G.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "If I could I would give Webs.com ZERO stars\r\nThey have gone from a half decent hoster at reasonable prices (still useless support) many years ago to a hoster that is far more expensive, less features and still woeful support\r\nAVOID AT ALL COSTS - see my review below for more details -\n\nI raised a support ticket 48 hours ago regarding a problem and replied to the email from Webs support 11 hours ago. I have now submitted 6 requests to their support\r\nTHE PROBLEM STILL REMAINS.........\r\ni still have other web sites with Webs but are now very seriously considering hosting them all elsewhere\r\nWebs support has always been woeful in trying to resolve \r\nissues both in terms of time and resolution Initially (many years ago) the hosting cost was cheaper and the hosting had more useful build qualities. They are not cheap any more but the chat support you have to now pay for\r\nMy experience is based upon having hosted (and still have hosted with them) several web sites with them for longer than 10 years", "picture_urls": null}, {"category": "", "rating": "1.4", "reviewed_at": "27/11/2017", "review_title": "“Utter shambles!”", "service_name": "services", "reviewer_name": "Ian R.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Was okay (ish) for most of the time we had the free version, but needing greater storage we 'upgraded' to 'Premium' and now have a worse service!\r\nCalendar will not update the 'Upcoming Events' on the home page properly. We have some events coming through, but not all. Customer service has been useless! Never thought upgrading would lead to a worse service!", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "07/10/2017", "review_title": "“Zero Stars.  Worst company on the planet....Stay far away from Vista Prints Webs.com”", "service_name": "services", "reviewer_name": "Donalee W.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "At one time Webs.com was fun, now it's a bloody nightmare.  STAY AWAY FROM THIS COMPANY, IT IS A VISTA PRINT PRODUCT AND IT IS GARBAGE.  Over a year now nothing but ongoing problems AND ISSUES and downed wewbsite, and features disappearing, and functions not working, glitches, and site not loading.  It has wasted hundreds of hours of my time trying to get help, and getting none. Support is non existent, Chat support can't help with anything.  These guys are total bozos, and don't know how to fix a damn thing...\n\nAny company would be better than this one.  Sadly I am stuck with it.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "14/09/2017", "review_title": "“Why not ZERO stars? How about they owe me a star?”", "service_name": "services", "reviewer_name": "David M.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am a high school German teacher. I rely on my webs.com hosted website for my classroom. Instead of being able to keep my students working and motivated in class, I have to tell them flat out that my website is down for the day or longer, and that we need to use paper copies of the work we are completing. (www.cashgerman.com)\n\nI also run a non-profit business called the Pennsylvania Equality Project. I have been unable to update the page to the degree I would like several times over the past few months. Every time I go to either page for updates, I am reminded that webs will be updating their servers on 9/20/17 from about 2 hours. I don't need the constant reminder of what they plan to do for me in several days. I want some answers about why my pages keep getting DNS errors. I am paid up through February on my German site, and through mid-October on my non-profit page. When these agreements each expire, I am moving my business to another website hosting platform. Goodbye Webs. You won't be getting any more money from me.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "20/07/2017", "review_title": "“hold your $#*! captative”", "service_name": "services", "reviewer_name": "Jane H.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "they are really incapable of handling anything .. stcik with go daddy site .. this is bull$#*! .. hate this bull$#*! mohamid site", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "06/07/2017", "review_title": "“don't waste your precious time or money with these bozos”", "service_name": "services", "reviewer_name": "Peggy K.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I was with them for years , The site went from so so to nightmarish awful. They have MAJOR serious IT issues and horrible customer service .", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "18/05/2017", "review_title": "“Unbelievable garbage. DO NOT WASTE YOUR TIME OR MONEY AT WEBS.COM!”", "service_name": "services", "reviewer_name": "Frank M.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I pray that people see this post before they waste any of their time or money at Webs.com. It is a complete joke and should be taken down forever. The entire builder is VERY buggy, usually deleting information even though it says it saves it. even the images uploaded won't even show up half the time. The last straw was when i just typed out a couple hours of information only to see it get deleted out of nowhere and was completely irreversible even though it said it had been saved. Never again should anyone be subjected to the incompetent nature of this terrible website builder, you deserve better people. If I could I would give Webs.com a negative 1 billion stars. They probably could win an award for the worst website builder ever created. Again, please do not wast your time or money at webs.com, you will be disappointed.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "21/04/2017", "review_title": "“Horrible customer support, failing services”", "service_name": "services", "reviewer_name": "Beatrice A.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "We have been using webs for years with a premium account and it used to be a good value for a decent price. Not anymore. It has become impossible to upload files, to edit files, to get anyone from tech support to give you an idea how long they might need to fix the problem - oh yes, they admit to having one, which doesn't help much either. The whole service has become so terrible that I would love to give it MINUS 10 stars.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "20/04/2017", "review_title": "“Use to be good, now not!! (shame)”", "service_name": "services", "reviewer_name": "Andrew C.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "What is happening with your web site builder. If i am lucky enough to access the editor I then cant do any thing with it, like posting HTML code onto it. Is there a problem like your going out of business or something. Use to be a damn good site and user friendly. andy-coleman.com", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "01/03/2017", "review_title": "“I hate That I had to Give Them Any Stars”", "service_name": "services", "reviewer_name": "Tracy D.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been with Webs.com since 2009 and u until about a year ago I had no problems other than the fact that they use a lot of outdated apps for their contact, blog, and calendar features.  One would think that by now they would have had developers integrate social media plugin's and a means for bloggers to monetize their blogs.  As it stands you would need to have a blog on another platform and then incorporate the link to that page into your website navigation.  But I digress.\r\n\r\nMy real issue with webs is that they have suffered numerous lengthy outages that have taken down user website and ability to access their dashboards, without ever notifying us.  I would learn my site was down by potential customers, or users of my e-blast who couldn't access content via links in my newsletters.  Calling them is only accessible to their premium subscribers so the rest of us are at the mercy of their chat platform.  I am not sure if Erin ad Mary are the only two employees or if those are the standard names used for their CSR's.  It doesn't really matter because they rarely have anything to say other than our engineers are working on it.\r\n\r\nCurrently, users are experiencing the inability to upload images and video to their sites.  I came across this issue two weeks ago when I tried to upload a photo for my newest blog.  So much for keeping content current\r\n, and by the way, this impedes my ability to to create new e-blasts.  As it stands I am paying an annual subscription that I either can't access or can't utilize all of its promised features.  In addition I can't use my e-newsletter service that is for the purpose of sharing content from my site.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "26/02/2017", "review_title": "“WEBS SUCKS”", "service_name": "services", "reviewer_name": "Dio v.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "No problems solved, no communication; worst customer service ever experienced.... probably going out of business and broke soon.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "20/02/2017", "review_title": "“Not as good as they used to be”", "service_name": "services", "reviewer_name": "Joanne S.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I've been using Webs.com since I first started publishing, back in 2010 or so. They were very simple websites, but they were easy to build and it was free. I eventually paid for my own domain. But the 10 pages I used to be able to have on the free site suddenly said I couldn't go over 5, with no warning. So...I sucked it up and I paid for premium (so that I could use unlimited pages) which required me to sign up for a premium package. But I was adding the premium before my domain had expired and the started package includes a domain. So I went into their forums and specifically asked if the \"free domain\" I would get from the starter package could be used for my current domain. I was told, \"Oh yeah, sure,\" that the \"coupon\" i get would be automatically applied to my account. But it didn't. The time came that my domain was expiring (a domain name that is now attached to every book I've published). When I inquired why this wasn't happening, the guy who emailed me back said something along the lines of, \"Oh sorry, she was wrong, the coupons can only be used on NEW sites.\" So, I paid to keep my domain, because transferring the domain somewhere is a pain and I didn't have enough time to look into it. I still have that \"free domain\" coupon, because I can't use it. \r\n\r\nSometime last year is when I started noticing the big problems. Website pages would lag on loading, or the site would go down completely. It always came back up and I still had at least a year on my domain. But one day, the site builder stopped working. Long story short, I found they deleted the theme I only just a week prior switched, rendering it useless. Without even bothering to tell me. I found out when my website wouldn't publish. \r\n\r\nThen the site builder went down. I couldn't even access my dashboard, let alone pay for a subscription had I wanted to. Nothing worked. And apparently it happened to hundreds of sites and the only answers we were given was along the lines of \"we're working on it.\" \r\n\r\nEventually, the problem got fixed, but it went down again recently. I currently canNOT turn off my \"auto-renew\" on my domain (and I want to because they're not getting anymore of my money). Odd pictures just started showing up on my published website. As in, pictures that aren't even in my files. And the pictures that were supposed to be there were still in my files. It made no sense. I had to re-upload the very same pictures. Something I've had do a lot over the last couple of years. \r\n\r\nSo I went looking into their help forums. They used to leave threads telling us what problems they were noticing etc. Suddenly there are NONE of these threads. Just a very generic \"help\" menu. I sent them an email, telling them about the problems i was having, but heard nothing.  \r\n\r\nAlso, they send me a LOT of spam when they have sale on premium packages. I'm already a premium member, yet they still send me these. At least 1 every day. Oh, and when you sign up for the premium packages, they also don't tell you that their \"premium themes\" don't apply to the \"starter\" package (which I only subscribe for so I can get unlimited pages). You have to pay for the more expensive package if you want anything other than a no-frills theme. \r\n\r\nI have a few months left before my domain runs out next (I paid for 2 years; they never told me 1 year was possible. I only found out from other users on their FB page), but I'm going to take the time to transfer my domain somewhere else. Because the site just isn't as good as it used to be anymore and I'm sick of it. If I end up losing my domain name I'm going to be really angry.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "10/02/2017", "review_title": "“STAY AWAY”", "service_name": "services", "reviewer_name": "Michael L.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Once they have your domain, you're screwed. Their support is terrible, they'll just run you around for ages while your web presence suffers. Take my advice and use someone else! Research them before you buy, their fb page is full of complaints about their poor service!", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "02/02/2017", "review_title": "“No more service from WEBS!!”", "service_name": "services", "reviewer_name": "Georgia O.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I've been a user of WEBS since almost from the start. I created my first website with them somewhere in 2002. Never had a problem until the end of 2016.\r\n\r\nMy website has been suffering outages and completely all my images and photos have been corrupted or disappeared.\r\n\r\nTheir services just simply acknowledges your queries, and then forget about you.\r\n\r\nTry and find another web host, this one does not work!!   >:(", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "28/01/2017", "review_title": "“Don't use webs.com for your business website”", "service_name": "services", "reviewer_name": "Jules M.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I starting using webs.com in 5th grade to build stupid websites for my friends because it was free to use and I liked building websites. Fast forward to the summer of 2015 when I decided I wanted to create a professional website for my photography. I used webs because it was the cheapest option and the only site I felt comfortable using. At first, I loved the look of my site and I felt like a real professional. When I started looking at other photographers' websites for inspiration and guidance, I began to notice how unprofessional my site looked compared to theirs. I decided to reach out to webs.com and asked to transfer my domain in early 2016 and was told I couldn't. I just stuck with the site hoping I could make it look more professional but couldn't. Now a year later, I'm FINALLY just being able to transfer my domain to another service that has more professional templates and is easier to contact. I requested a domain transfer on Janurary 21, 2017 and was told that the transfer would be complete on Janurary 28, 2017 at 1:55AM. It is now 12:30PM on Janurary 28th and my domain still hasn't transferred. When I contacted the support team, I was told that they would let the senior techs know about my situation and they'd complete the transfer. When I asked to speak to a supervisor or a senior tech, I was told that they're not available on weekends and theyll take care of my request on Monday. I've never experienced such unprofessionalism from a company before. I can't wait to break away from webs and start my site from scratch. \r\n\r\nIf you're looking to create a website for your company, stay away from webs.com because they're unprofessional and your site will look unprofessional.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "12/01/2017", "review_title": "“Webs.com sucks!”", "service_name": "services", "reviewer_name": "Rose N.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "The site never work, the reps always blame you instead of themselves, and when you provide them screenshots, they ignore you and lock the topic you're trying to talk to them in. Oh, and to speak to a live agent, you must be a paying person. If not, get ignored.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "11/01/2017", "review_title": "“site is frozen”", "service_name": "services", "reviewer_name": "kuljeet s.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "very bad services from webs i have just created free website on webs and getting We're sorry, this site is frozen.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "07/12/2016", "review_title": "“WHAT HAPPENED”", "service_name": "services", "reviewer_name": "anita s.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been a premium member for over 6 years...there has always been issues, but usually get resolved.\r\nIn late October, there was a serious issue, and many websites have been rendered useless...and not free sites, the paid ones.\r\nGoing on 2 months now, with my site not usable, I have tried every avenue to get a response from Webs---- EMAIL, CHAT, 2 FACEBOOK PAGES AND THEIR SUPPORT PAGE...nothing.\r\nThey have gone from a decent company, to a shameful company that has ZERO support for paying customers.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "06/11/2016", "review_title": "“Site always broken”", "service_name": "services", "reviewer_name": "Dale M.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Site was down yesterday, and still down today.  Can't revise existing web pages because the \"pages\" page won't open up to allow edits.  I would move my site to another provider, if the pain of doing it wasn't so high.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "03/10/2016", "review_title": "“I no longer recommend this service”", "service_name": "services", "reviewer_name": "Ed W.", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been using webs.com for a few years and was satisfied until now. After renewing my subscription for another 2 years, I discovered that my website had disappeared. When I tried to access my account, my password was no longer recognised. I tried to get a new password using reset password, but I did not received any reset password emails. Afterwards I tried to contact support and only received automatic responses. Customer service is very poor indeed. If my email were not good, then why did they send me a questionnaire just the other day?", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/webs.com", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/webs.com", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "07/06/2018", "review_title": "“Gigapros hosting service is outstanding, professional...”", "service_name": "services", "reviewer_name": "Henry L.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Gigapros hosting service is outstanding, professional and complete. They researched my clients issue and solved it in less then 3 hours. I had been working on the problem for over a week. Well worth the money and with the 'money back if we can't fix' was a huge factor in my decision to give them a try.", "picture_urls": null}, {"category": "", "rating": "4.8", "reviewed_at": "21/04/2018", "review_title": "“It will take 72-96 hours to set up a dedicated server...”", "service_name": "services", "reviewer_name": "Orgasmic S.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "It will take 72-96 hours to set up a dedicated server after I was told it would take 48 hours. Had to prove it was my id and card which I understand but wasn't displayed when you signup for service.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "19/03/2018", "review_title": "“They are great! Recommend Gigapros hosting!”", "service_name": "services", "reviewer_name": "Heberto C.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "What I like most about Gigapros is not only it's user-friendly control panel that lets me and my group of webmistresses to work at our own pace and our own styles, but also it's very friendly and accommodating technical support. As we are just ordinary people who had the crazy idea to put up a fan site, we had qualms about our capacity to understand the ins and outs of creating, launching and maintaining a website. But Gigapros' control panel proved easy to use, provided instructions, and offered various alternatives to match our needs. Not only that, but their Technical Support was very supportive as well. It was icing on the cake that their services were affordable, too.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "09/03/2018", "review_title": "“Great customer service”", "service_name": "services", "reviewer_name": "Teri M.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Great customer service. I pestered a lot of them and wasn't always kind to them. \r\nGigapros team still give me prompt, professional service and have solved all my problems and defused all of my worries.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "31/01/2018", "review_title": "“Really perfect VPS hosting services”", "service_name": "services", "reviewer_name": "Dominik H.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Great customer service. I pestered a lot of them and wasn't always kind to them. \r\nGigapros team still give me prompt, professional service and have solved all my problems and defused all of my worries. Contact them directly if you need to consult with experts.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "26/01/2018", "review_title": "“Best price for VPS accounts  Gigapros is great host.”", "service_name": "services", "reviewer_name": "Vihtori W.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I can't say enough good things about Gigapros host. Great support that is available by phone 24x7. \r\nActually I called them so that I understand their package. Finally I signed up with them. I had no idea about them but after three months I can about them and it is really good.\r\nTop web hosting provider to deal with.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "11/01/2018", "review_title": "“Good job, Gigapros team is professional”", "service_name": "services", "reviewer_name": "Senka S.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I don't have anything to complain about Gigapros host. I like that they are also proactive about virus infections if they happen. Even if you are a novice when it comes to maintaining a website, this will not hinder you from being hands on with your own website. It is very easy to navigate the site builder and the servers are fast.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "13/12/2017", "review_title": "“Deceptive Advertising, horrible customer service and RESOLD MY SERVER!”", "service_name": "services", "reviewer_name": "Randall L.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am beyond disappointed in this company. First I ordered a server and they had a deal ADVERTISED that if you pay for a quarter adding cpanel was free so I purchased it and paid for quarterly in advance. They made me jump through hoops for my credit card sending in scans and all that then they approved it and said they were setting up the server (but they lied). After waiting a whole day they send me a email saying I have to pay $115 extra to get cpanel WHICH THEY ADVERTISED FOR FREE. We went back and forth and they refused to honor what they advertised then they write and tell me they resold my server. The server that they CHARGED ME FOR and which they were supposedly SETTING UP. So they have been lying to me the whole time, misrepresenting what they are selling then reselling after charging my card and trying to downgrade me to a inferior server seems a lot like FRAUD to me.\n\nThis is horrible customer service. They should honor what they advertise and at least provide the server they sold me and CHARGED ME FOR.\n\nMy hope is somebody from Gigapros in management will care enough about me as a customer or at least about the negative publicity to contact me and offer me a fair resolution. I am not asking for more than I paid for just what I paid for and it made right.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "13/12/2017", "review_title": "“Very kind, easy to work with. Thanks Gigapros!”", "service_name": "services", "reviewer_name": "Albina C.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Don't look any further just go for gigapros web host and you will be happy like now I'm from the bottom of my heart. I am impressed dealing with these guys. Good experience.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "26/10/2017", "review_title": "“Good job  Gigapros web host is nice provider”", "service_name": "services", "reviewer_name": "Beyzanur B.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am very pleased with the service provided by gigapros. \r\nThey are very professional and have designed a user friendly website.\r\nWhen I had some questions, their intellectually gifted support team always willing to help and explain me everything I needed  really skillful they are. They are able to customize any features I needed and pass on the savings.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "26/10/2017", "review_title": "“I am very pleased with the service provided by gigapros”", "service_name": "services", "reviewer_name": "Janet N.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am very pleased with the service provided by gigapros. \r\nThey are very professional and have designed a user friendly website.\r\nWhen I had some questions, their intellectually gifted support team always willing to help and explain me everything I needed - really skillful they are. They are able to customize any features I needed and pass on the savings.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "10/10/2017", "review_title": "“I can say that Gigapros is TOP reliable host!”", "service_name": "services", "reviewer_name": "Yunka J.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "The application packs they now support also help facilitate almost effortless setup of great commonly used web based applications. I am very much satisfied by their customer service, they are available 24/7 and provide instant service whenever required.\r\nGigapros is cool web host. I recommend their services.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "05/10/2017", "review_title": "“Can't go wrong with Gigapros host  it is really good one!”", "service_name": "services", "reviewer_name": "Franko H.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Uptime is good as my sites are always up. I was pleasantly surprised by the backup tools you provide which I did not expect at all. Good web host! Their control panel includes everything you need. Whether you're an expert user or a beginner it is very easy to use.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "24/08/2017", "review_title": "“It turns out that Giga Pros has been simply a pleasure...”", "service_name": "services", "reviewer_name": "Semen G.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "It turns out that Giga Pros has been simply a pleasure to deal with as I know anyone who needs\n help appreciates the relief one feels when they can readily contact a real, live person quickly and who is knowledgeable enough to answer your questions.\rTheir customer support is great. Any ticket I've put in has resulted in a real e-mail response within\n       10-15 minutes. The responses are clear, informative, and not at all condescending.\rI love the add-on open-source scripts - the PHPBB2 bulletin boards in particular.\rI consider these guys well worth the price.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "24/08/2017", "review_title": "“Decent company to deal with!”", "service_name": "services", "reviewer_name": "Martin H.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Decent company to deal with!\nBeen hosting with Gigapros company for quite a long time, and I'm very impressed indeed.\rThe crazy part is that I get support responses in HOURS, not days. Most of my questions are answered in less than 1-2 hours, which is fantastic. Now, I do want to say that this decent web host has been responsive in its dealings, which cannot be said about many\n       other companies. Overall, this appears to be a decent company that is really trying to make a good name for itself in the web hosting business.\rPrice is great!\rGigapros has impressed a lot of people in the last two years, including me.", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "24/08/2017", "review_title": "“I have been using Gigapros's Personal Plan”", "service_name": "services", "reviewer_name": "Semen S.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been using Gigapros's Personal Plan - 2 for over 1 year\n What I want to recommend to others is their customer service. Every time I got some questions, I ask them online, no waiting times, there is always some one waiting there online to help us, it's just amazing. \rParticularly impressed with the live chat customer service support - extreme\n      ly helpful.\rThey are very keen on maintaining their level of service, security, and professionalism. Like I said, I like them.\rThank them a lot", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "24/08/2017", "review_title": "“Amazing Web-host!”", "service_name": "services", "reviewer_name": "Tom V.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Amazing Web-host!\nHaving come from a really crap host to Gigapros, the support is great, the load speed is great and the uptime is also good... they have a 99.9% uptime guarantee!\rI especially love their support. They're easy, friendly and they seem to really care about their clients.\rAmazing Web-host!!!!!!", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "24/08/2017", "review_title": "“Great Web Host!”", "service_name": "services", "reviewer_name": "Fagundo F.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Great Web Host!\nI have 3 sites (on VPS) with Gigapros. Customer service is second to none. All my support requests are handled under 5 minutes. They even re-installed my content management system for me after they found out the problem I had stemmed from me installing the wrong version. they help with things like Htacess files, and almost any web admin question you\n       have.\rExcellent value, features, reliability", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "21/08/2017", "review_title": "“A little over a year ago I was looking for a host to...”", "service_name": "services", "reviewer_name": "Royce B.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "A little over a year ago I was looking for a host to set up one of my sites\n The choices were daunting, to say the least. After reading countless reviews of many of the top rated hosts, Gigapros was among the top candidates. So, I decided to try them and host my web site makmakmen(dot)com.\nMost everything I wanted to do just worked, and any problem\n      s I had were quickly solved by their self-support. The customer service is prompt and always give me the information I need to make my website function the best.\nThe server uptime and overall speed performance are outstanding and consistent.\nTheir pricing is competitive in my opinion..\nThink that I will stay a long-term customer! Good hosting provider", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "09/08/2017", "review_title": "“Outstanding support!”", "service_name": "services", "reviewer_name": "Benigna C.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Outstanding support! All the staff at Gigapros.com have always been extremely fast, knowledgeable, helpful and flexible. I have used many, many hosting companies over the years and have yet to find a service close to this quality.\n\nKeep up the good work!", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "07/08/2017", "review_title": "“Why does the rating system only go up to 10?”", "service_name": "services", "reviewer_name": "Kyle K.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Why does the rating system only go up to 10? I am amazed at the customer service here, the speed of the servers, everything! I've never experienced such good hosting at any price and to find Gigapros.com at this price is incredible.\n\nP.S. I'm REALLY hard to please!", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "04/08/2017", "review_title": "“Perfect Uptime, Speedy connection  Great Hosting Service!”", "service_name": "services", "reviewer_name": "Rene S.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "The technical support I have received from Gigapros.com has been second to none. \r\nTickets are answered almost instantly and the advice has always been spot on! I can't imagine ever going elsewhere for hosting.\r\n\r\nI can give you guys 4/5.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "04/08/2017", "review_title": "“The technical support I have received from Gigapros.com...”", "service_name": "services", "reviewer_name": "Rene S.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "The technical support I have received from Gigapros.com has been second to none. \r\nTickets are answered almost instantly and the advice has always been spot on! I can't imagine ever going elsewhere for hosting.\n\nIf I could give you guys 11/10 I would.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "01/08/2017", "review_title": "“Absolutely wonderful support system, particularly from...”", "service_name": "services", "reviewer_name": "Linda B.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Absolutely wonderful support system, particularly from Peter, always courteous and answers questions and solves problems in record quick time. I wouldn't go anywhere else! The best customer service I have experienced with any hosting provider.\n\nRecommend Gigapros hosting! They are superb, I like almost everything about their service.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "19/07/2017", "review_title": "“I would recommend GIGAPROS VPS Hosting”", "service_name": "services", "reviewer_name": "Erik V.", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I can say there are lots of web hosts out there in the hosting services market. I have heard that those sites who say 'TOP 10 web hosting providers to deal with' are not so reliable in terms of supporting their customers because of the big number of clients and they have no time to solve the troubles they face.\r\nOne of my friends recommended Gigapros VPS hosting to transfer some of my web sites to US.\r\nI paid via paypal, setup was fast. Moreover, their customer support helped me with migration - I am very thankful for that. Pricing is suitable for my budget (I have so many useful features and free staff). \r\nRecommend this nice hosting. Gigapros is the best one!", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/gigapros.com", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/gigapros.com", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "08/08/2010", "review_title": "“The forum is clean, simple and easy to use, it's pure...”", "service_name": "services", "reviewer_name": "Lauren G.", "absolute_url": "https://www.sitejabber.com/reviews/hostingtalkforum.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "The forum is clean, simple and easy to use, it's pure professional is a lot more pro-active than WebHostingTalk, a lot more updated, as Tyler A. has said above I totally agree with his statement above. HostingTalk not only met my expectations, but exceeded them. I have very high standards for my business and HostingTalk came through with flying colors.", "picture_urls": null}, {"category": "", "rating": "3.5", "reviewed_at": "06/08/2010", "review_title": "“I am extremely happy with this new hosting forum”", "service_name": "services", "reviewer_name": "Alex B.", "absolute_url": "https://www.sitejabber.com/reviews/hostingtalkforum.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am extremely happy with this new hosting forum. There are a lot of hosting forums out there but this one by far is the most friendliest. I really enjoy browsing it because of its speed and wonderful design. There are couple big sites out there that are totally covered in ads and are WAY to slow. This has at the moment no advertisements but probably will have in the future. Hopefully it won't have to many. I also like the fact that it is using the latest forum software. Which not only helps improve the speed but has a lot of nice eye candy ;)\r\n\r\nThe mods who run the forum are great people and don't abuse their powers like some other forums I know.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "06/08/2010", "review_title": "“I find that the site is clean, simple, and very easy...”", "service_name": "services", "reviewer_name": "Tyler A.", "absolute_url": "https://www.sitejabber.com/reviews/hostingtalkforum.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I find that the site is clean, simple, and very easy to navigate. The site to me seems to be a more simplified and more upgraded version of WebHostingTalk. The content of the site is very nice and the threads on the forums are very well placed. everything on the site screams professionalize. \r\n\r\nI suggest that everyone who is interested in web designing, website hosting, or they are a business owner, take the time and join the site. It will surly be worth your time. \r\n\r\nThanks,\r\nTyler A.", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/hostingtalkforum.com", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/hostingtalkforum.com", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "17/01/2018", "review_title": "“Using VPS SInce 2 Years”", "service_name": "services", "reviewer_name": "Sarah K.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Its been 2 years since I am using VPS hosting services of HostingRaja\n\nHeardly i have faced any issue with their services and in case I am facing any issue their technical support team is always available to resolve it. Their support team is very polite and always listen my queries properly and act on that immedietely.\r\nSo far I found HostingRaja is one of the best hosting company to host any kind of website.", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "16/01/2018", "review_title": "“Good Support with Affordable Pricing”", "service_name": "services", "reviewer_name": "Sunaina S.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I came to know about HostingRaja through one of my friend as he was hosting his website from them from past two years. I thought if one of my close friend is referring me to HostingRaja it must be a really good service. I am happy that my friend has referred me to a good hosting company. I purchased an unlimited hosting package and hosting my three websites with them. Thier service is excellent with comparitively affordable price.", "picture_urls": null}, {"category": "", "rating": "3.3", "reviewed_at": "14/12/2017", "review_title": "“Best Hosting Service so Far”", "service_name": "services", "reviewer_name": "agustin j.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "One of the best hosting company in India and I don't think that any other hosting provider can offer you services like HostingRaja. It is one of the reliable hosting service company which I have used for my website. 24*7 customer support via live chat is really help help, amazing hosting plans with great features. Really impressed with HostingRaja and recommend for every website owner who wants to experience awesome services at affordable rates.", "picture_urls": null}, {"category": "", "rating": "3.3", "reviewed_at": "07/12/2017", "review_title": "“hostingraja support not good from Livemnc web host team”", "service_name": "services", "reviewer_name": "Siva c.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I was used hosting raja dedicated server from last 6 months buy suddenly my websites goes down and ask from support team and they told me this is development issue for that need to \n\ncheck with your developer, and devloper told us its hosting provider issue, my all 3 websites down for 2 days but hosting raja tech team is not help me at all final i switch my server \n\nwith Livemnc and they migrate my dedicated server with in 2 or 3 hours with few hours downtime and now my all three websites are working fine,  Livemnc done free of cost my old \n\nprovider Dedicated server data migration to new server with all 70 Mail i9d's.\n\nTech support helped to move my project without any problems, there is no data lost. Thanks, you are the best!\n\ni am recommend Livemnc DaTa Center", "picture_urls": null}, {"category": "", "rating": "3.4", "reviewed_at": "18/10/2017", "review_title": "“Good Hosting Service Provider in India and Budget Friendly”", "service_name": "services", "reviewer_name": "Eesha L.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have hosted my website with HostingRaja, HostingRaja is top among web web hosting services provider in India, As a customer i got excellent service from them and their support is great, they provide free migration for me.\n\nIf you are planning to create and host your website, try HostingRaja because they are very reliable compare to other service providers. Their custom cPanel tool is very easy to use and all the required options are available in cpanel.\n\nRecently I upgraded my account from shared to VPS hosting and their support team helped in A-Z of upgradation. Loved their services..\n\nOverall value for money hosting provider.", "picture_urls": null}, {"category": "", "rating": "3.3", "reviewed_at": "13/09/2017", "review_title": "“Good option for web hosting at affordable rate”", "service_name": "services", "reviewer_name": "Ritvick S.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I bought a web hosting package from hosting raja an year ago. I am happy to say they have given me a very decent service so far. I started with a shared hosting service, but as my business and website grew I opted for a VPS service. Though I faced some issues like downtime and slow speed but they technicians were always available to assist me. I would suggest hosting raja to every Indian who are looking for a web hosting service.", "picture_urls": null}, {"category": "", "rating": "3.3", "reviewed_at": "11/09/2017", "review_title": "“Using VPS Hosting service of Hosting Raja since 2 years”", "service_name": "services", "reviewer_name": "Daksh S.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am using VPS Hosting service of Hosting Raja since 2 years.\r\nWhenever we are facing any issue with our web hosting account there technical support team member Mr DineshMP is always there to help me. He is having great knowledge and skills. Hosting Raja is one of the best place to get hosting for your websites at reasonable rates. The service provided by company is very good. Their website is fast enough even opens on slow internet connections. Their support team member are very friendly and cooperative. If you are looking for cheapest VPS Hosting must give a try to Hosting Raja.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "06/09/2017", "review_title": "“Using  VPS Since 1 Year”", "service_name": "services", "reviewer_name": "Shalini s.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am using Hosting Raja service since 1 year for my 2 domain and have taken VPS. I must say service is good and customer support team is very helpful. Whenever I am facing any issue, I just need to submit a ticket or sometime it is getting resolved in the live chat session becuase their live chat is available 24/7. I would recommend Hosting raja to everyone.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "15/08/2017", "review_title": "“Prompt resolution of issues and good service”", "service_name": "services", "reviewer_name": "Arijith M.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have hosted my clients websites Hostingraja since few years, when we face some issues and then immediately contact them through chats and calls, \r\ntheir response is very fast and make me happy of their way of solutions. They are giving good support and  problem solving with in short time period.\n\nAll the very best to the team HostingRaja. Keep this guys..", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "07/08/2017", "review_title": "“Hosting Raja is giving me a Decent Service”", "service_name": "services", "reviewer_name": "Peter M.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am customer of Hosting Raja for the past one year. I want to say that they have very less web hosting price packages, with a decent cuomer support.\r\n\r\nThe main reason I am sticking with their services are because they have given me a good web hosting service so far. Whenever I contacted the support team they helped me to resolve my query.\r\nI hope they keep the same type of services in the future as well.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "06/08/2017", "review_title": "“DO NOT GO FOR HOSTING RAJA FOR HOSTING”", "service_name": "services", "reviewer_name": "Jenil P.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "VERY HELPLESS when you are losing business becuase others mistake\r\n\r\nAwani was the employee, even botthered to reply\r\n\r\nHi Guys,  I need to be really sure when you chose hsoting raja for hosting your website.\r\n\r\nFor sales, they will like behind you and call and explain everything. But for support they should be rated in - minus stars. I am continously trying to contact over phone- I called them more than 50 times full ring in last 24 hrs, not even single call was picked up.\r\n\r\nThrough email: the message is noted by them and but not reply. If mailed them 10 mails, then I will get 1 mail from them saying we are checking, again mail them 10 times. no reply.\r\n\r\nOn chat they are really irresponsible and not bothered at all. as if they are setting for timepass. They do not even care that the person who is complaining and lossing his business.\r\n\r\nFelling Helpless", "picture_urls": null}, {"category": "", "rating": "2.0", "reviewed_at": "04/08/2017", "review_title": "“Excellent Customer support Since 4 Years”", "service_name": "services", "reviewer_name": "Aarav a.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I just wanted to tell everyone how happy I am as a Hosting Raja Customer. My company has been a customer of hostingraja since 2013 and I could not even imagine running my business without you guys. I must say the server is great ad extremely fast, but more importantly, the level of customer support is unmatched. \r\n\r\nI have never faced any single bad experience over the hundreds of support calls I have made in last 4 years.I would like to praise Miss. Awani one of the support team member of Hosting Raja in particular. Whenever I submit any ticket, \r\nI felt like she remembers my name, I have never experienced like just another person by her or anyone else there in support team. Time after time Miss Awani has gone above and beyond to provide me with excellent support and her impressive knowledge, expertise and skills always make sure that whatever issue I am facing is resolved immediately.\r\n\r\nThank you Hosting Raja for all of the excellent service/support over the years.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "03/08/2017", "review_title": "“Great customer support”", "service_name": "services", "reviewer_name": "Ram K.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Great service provider for first time web site owner like me. I am very happy and satisfied I chosen Hosting raja (after comparing other hosting service provider). Their customer/technical support team is outstanding. \r\nThey are always available, always responsive and always paitent with my queries and issue. Hosting Raja has a winning combination going. Great hosting service, great customer support.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "02/08/2017", "review_title": "“Best Indian Hosting provider”", "service_name": "services", "reviewer_name": "Shivanya S.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "When I first bought domain and hosting from HostingRaja I was little skeptical because I never heard about it before.\r\n But I selected hostingraja because this is an Indian hosting company. \r\nAfter many years down the line I am very happy that I did not selected those foreign expensive service provider. \r\nHOSTINGRAJA'S technical support is very responsive and helpful. Recently my website was not working properly. \r\nI raised a ticket and they resolved in a fraction of time. Their turn around time is around 30 minutes for a ticket but I think now they should revise it and make it less than 30 minutes", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "02/08/2017", "review_title": "“Worst Service provider Company”", "service_name": "services", "reviewer_name": "Megha G.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Worst Service with 99.9% downtime and no support at all. Database doesn't get connected smoothly and sometimes not at all. Support team is very rude and a real bad experience.", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "03/07/2017", "review_title": "“Very Fast Support”", "service_name": "services", "reviewer_name": "Manish K.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am using of hosting Raja services since 2 years and I am extremely happy with the provided by hosting Raja. Whenever I faced any issue their support team solved my issues on priority basis. All I can say is excellent support and really one of the best web hosting company.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "03/07/2017", "review_title": "“very good Services”", "service_name": "services", "reviewer_name": "SHalini s.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Hosting services provided by Hosting Raja are very good. I Purchased unlimited hosting from hosting raja around 1 year back and its been an awesome experience so far. Truly Hosting Raja is a king of Web Hosting industry.", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "30/06/2017", "review_title": "“don't buy worst service”", "service_name": "services", "reviewer_name": "sandy k.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "server is very slow always down don't buy they not refund amount ,Pls don't buy any thing with hosting raja. they are not refund money as they promise irritating customers servers are very slow always down.they promise refund with in 30 days if u not satisfy. I asked 20 time to refund my amount even I offer deduct some amount and return but they are not refund.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "11/05/2017", "review_title": "“Good Option for Cloud Hosting”", "service_name": "services", "reviewer_name": "Akheel A.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Hi, I got Cloud Hosting from Hosting Raja, their sales team was prompt in selling me the hosting services.\r\n\r\nAfter placing the order and completing the payment and my service was setup very quickly.\r\n\r\nThere were some small glitches with the server configuration and setup, which was solved by the Hosting Raja support team.\r\n\r\nOverall I would say Hosting Raja is a decent Cloud service for a decent price.\r\nI really want to thanks to my friend to suggesting me such a good Cloud hosting service provider. \r\nStill my website is not live because some work is pending.", "picture_urls": null}, {"category": "", "rating": "4.0", "reviewed_at": "06/04/2017", "review_title": "“Hosting Services and Domain registration”", "service_name": "services", "reviewer_name": "Raju L.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "We just wanted to thank you for the quick set up you did for us. We are not professional web development company and thought it would be stressful. Your team were so professional, courteous and hard working, especially Jyoti, who is a gem - she really has such a calm and patient demeanor-and she helped up set our site www. studio895 .in in no time. The follow ups from her end after a month too delighted us. Thank you Jyoti and your team from all of us here.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "06/04/2017", "review_title": "“Support is nice.”", "service_name": "services", "reviewer_name": "Shweta G.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "My site was not opening from sometimes. But within contact to the support at hosting raja, it is working well within few minutes.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "06/03/2017", "review_title": "“Good VPS Hosting Services”", "service_name": "services", "reviewer_name": "Mary W.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I purchased VPS Hosting plan from Hosting Raja 9 months back, I would say I have gained many new customers after I have started Hosting with hostingraja, even many of my clients have told me that my website is much more faster than it was before. I am happy that whenever I contact. Hosting Raja support members they are quick to respond to my queries be it day or night. I hope they continue to give their good services to me.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "17/02/2017", "review_title": "“Quick Support”", "service_name": "services", "reviewer_name": "Manmeet V.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Hosting Raja is a No.1 hosting provider company. I am a using hosting Raja services from last 3 years. I found that everything you get here very fast like if you have any problem then your query will resolved very fast. I will suggest for buying new domain or hosting service you should choose only hosting raja. My Domain Name : sellerfriend.in", "picture_urls": null}, {"category": "", "rating": "1.0", "reviewed_at": "15/02/2017", "review_title": "“Good Option for Unlimited Hosting”", "service_name": "services", "reviewer_name": "Shushovan D.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am using hosting raja for last 1 year. Earlier I was using basic plan. Now I am using Unlimited Plan. I will use business plan in my future. I will not only say that hosting raja is best it is best of best. I am an owner of a Software Development company named Nest Web Infotech. Whenever I face any problem regarding server issue I send a request to hosting raja to resolve my issue they fix the issue with 1 hour. I am happy with Hosting Raja.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "14/02/2017", "review_title": "“best Web Hosting company ever”", "service_name": "services", "reviewer_name": "Balvant J.", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I am blessed with having found the best Web Hosting company ever. Great service, great hosting, and the staff are amazing. Everyone I refer to them loves them as much as I do. I have been with them so long I cannot remember when I was not. When I started out I was with free hosting service by another company, but the tech and hosting support was just not there. I design on evenings and weekends and Hosting Raja get back to me on my time when I (and my clients) need them. Great packages, your site is never down and you can count on your clients always being able to find you. Just does not get better than this company. Sincerely, http://www.amarugujarat.org VPS Hosting Balvant Jat", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/hostingraja.in?page=2", "scrapping_website_name": "services"}]}{"business_units": [{"response": [{"reviews": [{"category": "", "rating": "0.0", "reviewed_at": "30/03/2016", "review_title": "“service is second to none”", "service_name": "services", "reviewer_name": "Andrew M.", "absolute_url": "https://www.sitejabber.com/reviews/smart-web-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Well in my opinion Smart-web-host.com hosting service is second to none. I have used 4 hosts before them and none of them were able to satisfy my not really high demands. They are offering the most popular control panel which is user friendly and comes with script autoinstaller that is easy to use. Uptime is high as possible to get for my low price. The most important side of hosting service for me is support and they have beaten all their competitors on this field. They reply in minutes in a polite manner and are able to solve any question, even the dumbest ones (which are to be honest appearing frequently). For now I love Smart-web-host.com solutions that deliver to me all needed features for low price, recommend them to you, folks.", "picture_urls": null}, {"category": "", "rating": "4.3", "reviewed_at": "25/03/2016", "review_title": "“amazingly quick and easy”", "service_name": "services", "reviewer_name": "Zander v.", "absolute_url": "https://www.sitejabber.com/reviews/smart-web-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Once I chose Smart-web-host everything was amazingly quick and easy. I did expect things to move faster than at my previous bad experience host, but I did not expect things to go as fast as they did. To date I have had one outage, as reported by Uptime Robot it lasted less than 3 minutes. Load times are always very fast. In summary for now I am proud and totally satisfied customer of respectful Smart-web-host company and would recommend them to everyone.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "18/03/2016", "review_title": "“I'm pleased with Smart-web-host”", "service_name": "services", "reviewer_name": "Jasna D.", "absolute_url": "https://www.sitejabber.com/reviews/smart-web-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I find Smart-web-host top-notch from many perspectives: ease of use, availability of staff for questions/ help, customer service oriented, and good value. With them I am confident that if I have any problem it will be resolved with expediency and professionalism. Stability has been 100%. No downtime in a solid half-year. With my plan I get all the usual software, Wordpress installs a breeze and easy to use cpanel works flawlessly. All-in-all I'm pleased with Smart-web-host, it will be very hard to find another one host with such a quality service.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "11/03/2016", "review_title": "“I am really thankful”", "service_name": "services", "reviewer_name": "Anasztaizia B.", "absolute_url": "https://www.sitejabber.com/reviews/smart-web-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I had appalling service from previous web host and are very pleased with Smart-web-host. Server runs great, no problems with it or customer service and to be fair I consider the package to be excellent value for money. Their support guys have provided even better customer service than I had been used to. Their mentoring has meant a great deal to me and I look forward to their continued support. Looking forward to acknowledge their help with a deep sense of gratitude. I am receiving service based on quality optimized server that gives me top-notch uptime and performance for my websites. I am really thankful for this high level hosting service I get for that low value I pay.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "04/03/2016", "review_title": "“glad to find them”", "service_name": "services", "reviewer_name": "Somer A.", "absolute_url": "https://www.sitejabber.com/reviews/smart-web-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "After several bad hosts over the years I am glad I have found Smart-web-host.com.\r\nPrice was very reasonable, much less that I had before.  \r\nThe customer service is the bomb - fast response and high skills. They are very dedicative to customers and very caring which most companies lacks this days.\r\nTheir network is really great and they do short latency to many other networks and points. \r\nI'm not sure how these guys work to keep their servers up, but I am pretty sure they are doing great job for making my websites stable and problem free. \r\nIt feels great to know and say where our websites reside, it is a pleasure working with them.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "26/02/2016", "review_title": "“Friendly, fast, efficient”", "service_name": "services", "reviewer_name": "Laura D.", "absolute_url": "https://www.sitejabber.com/reviews/smart-web-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "Smart-web-host is a top tier hosting company with great prices, great support staff, and at least highest uptime, maybe even 100%. I can only say positive and amazing things about them. I have had the pleasure of doing long term business with them. The technical support is phenomenal and you can rest assured that everything will run and operate smoothly as a result. They are always courteous and approachable to all concerns. Friendly, fast, efficient and top-notch - that is what Smart-web-host are!", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "19/02/2016", "review_title": "“Don't bother with any other service”", "service_name": "services", "reviewer_name": "Abdul M.", "absolute_url": "https://www.sitejabber.com/reviews/smart-web-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "The reason I chose Smart-web-host.com was because I couldn't find a bad review online about them. Their team know how to maintain the servers and keep the software packages up to date. Their servers are high power and not oversubsribed.  Since day one we are at 100% uptime and i get .12 avg response and low loads. Their support team have always answered my questions right away and accurately. Don't bother with any other service. Use Smart-web-host for any your hosting need, they are reliable and get the job done.", "picture_urls": null}, {"category": "", "rating": "0.0", "reviewed_at": "16/02/2016", "review_title": "“Recommend”", "service_name": "services", "reviewer_name": "Virgilio D.", "absolute_url": "https://www.sitejabber.com/reviews/smart-web-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "If you will ask me what negative words can I share about Smart-web-host.com I'd say nothing. I didn't hear anything on them before started using them. Of course they are not perfect but close. My last month uptime 99.92% according to pingdom monitoring. Websites are loading blazing fast. I always get assistance from technical team on demand. My expectations of quality service came true. After almost a year paradise with them I'd like to share this impressions with you and recommend them to everyone.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "12/02/2016", "review_title": "“Smart-web-host rocks”", "service_name": "services", "reviewer_name": "Rochelle K.", "absolute_url": "https://www.sitejabber.com/reviews/smart-web-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "With Smart-web-host.com you get what you pay for. Loading speed of website increased dramatically when I switched to using their hosting. My websites are up almost 100% of time. The service to get things repaired are quick - usually within 1 hour, but generally about 15 minutes for me. The last four tickets I raised were responded to in an average of 8 minutes, and all of them resolved immediately. The technicians take time to give me the right explanation even if I don't understand right away. I hope to continue my relationship with them.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "29/01/2016", "review_title": "“cool experience”", "service_name": "services", "reviewer_name": "Martins R.", "absolute_url": "https://www.sitejabber.com/reviews/smart-web-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I just want to let everyone know that my hosting experience with Smart-web-host has been really cool. After seeing their promo discount and plans on their website I decided to give them a try and I think that was the best choice I have ever done. No downtime in several months, good response times to all my ticket requests. Support staff always quick, knowledgeable and efficient. Approximate response time was 20 minutes, it is best time I ever seen delivered from a host. Performance of my account is ok, loading speed is high. Overall experience is perfect, I am thankful for their top notch service.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "22/01/2016", "review_title": "“No hesitations”", "service_name": "services", "reviewer_name": "Thomas S.", "absolute_url": "https://www.sitejabber.com/reviews/smart-web-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I believe you really can't get any lower than price they are offering their plans, like they are almost doing it voluntarily. I am using them for a short while, however I had opened more than 5 tickets on several small issues and they did lots of optimizations to please me and reply my requests. I have not operated any uptime monitoring but I do not remember my websites being down at all when I was working on them or while doing random checks. Recommend Smart-web-host without hesitation for anyone who seeks good quality shared hosting.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "13/01/2016", "review_title": "“I want to show my appreciation”", "service_name": "services", "reviewer_name": "Ellen S.", "absolute_url": "https://www.sitejabber.com/reviews/smart-web-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "I have been with them for several month already and I am totally amazed with the affordable prices and high reliability of service they provide. \r\nMy initial interaction with their sales support was great, as well as others. Since they helped me move and setup my websites everything is working smoothly. Network connection is fast and control panel, cPanel, is user friendly. Sometimes I receive errors due to wrong configuration of my database but it was because I have not configured cms properly.\r\nI just want to show my appreciation to Smart-web-host for their killer services.", "picture_urls": null}, {"category": "", "rating": "5.0", "reviewed_at": "19/12/2015", "review_title": "“top level of reliability”", "service_name": "services", "reviewer_name": "Sean L.", "absolute_url": "https://www.sitejabber.com/reviews/smart-web-host.com", "website_name": ["Sitejabber Online Business Reviews and Complaints"], "review_text": "My overall experience with Smart-web-host is definitely outstanding. Now I would share some detailed information. In reality, I moved to them because of their low prices, but I was not disappointed at all. I have received all what I need from hosting provider that I could name reliable: 99.95% of uptime, fast connectivity and quick tech support. They usually responded in less than three minutes. I don't know how these guys do it. They reply to my tickets faster that I have time to answer back to them. Because I rarely have trouble with stability or performance, most of my support tickets were regarding other issues like errors from mysql, wordpress etc. From my personal experience now you can make conclusion about their level of reliability, but I would say it is top.", "picture_urls": null}], "business_item_data": {"category": "", "sub_category": "", "original_price": "", "specifications": [], "website_name": "services", "availability": "", "picture_urls": [], "business_type": "Service", "name": "services-", "absolute_url": "https://www.sitejabber.com/reviews/smart-web-host.com", "description": "", "sale_price": ""}}], "scrapping_website_url": "https://www.sitejabber.com/reviews/smart-web-host.com", "scrapping_website_name": "services"}]}