{
    "business_item_data": {
        "business_type": "",
        "absolute_url": "https://www.amazon.ca/Logitech-Proteus-Spectrum-Tunable-910-004615/dp/B019OB663A/ref=lp_1233055011_1_1/143-2822029-6939659?s=pc&ie=UTF8&qid=1527932389&sr=1-1",
        "category": "Video Games",
        "name": "Logitech G502 Proteus Spectrum RGB Tunable Gaming Mouse (910-004615)",
        "sub_category": "",
        "picture_urls": "",
        "original_price": "",
        "sale_price": [],
        "availability": "Available from",
        "specifications": "",
        "website_name": "",
        "description": ""
    },
    "reviews": [
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Best mouse I've ever used",
            "reviewed_at": "13/06/2016",
            "reviewer_name": "Mike melo",
            "category": "Video Games",
            "product_name": "Logitech G502 Proteus Spectrum RGB Tunable Gaming Mouse (910-004615)",
            "review_text": "Best mouse I've ever used. I'm not a gamer but I'm a computer security engineer. Needless to say I'm on the computer all day I have relatively large hands and the mouse doesn't feel small. Great feels, love all the controls and the free spin is great. I personally do not like weights in my mouse so I do not use them. The response settings are awesome, various different levels so there isn't too big of a jump between them allowing for better and more comfortable control. I would recommend this mouse to all users no matter the application.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "3.0",
            "review_title": "The mouse with the wheel of plastic remorse",
            "reviewed_at": "08/10/2017",
            "reviewer_name": "Yawhann",
            "category": "Video Games",
            "product_name": "Logitech G502 Proteus Spectrum RGB Tunable Gaming Mouse (910-004615)",
            "review_text": "For a gaming mouse, I always look for four things: - comfort for a hybrid palm/claw grip - two thumb buttons - clicky, tactile wheel - decent weight This mouse feels and looks solid. But the added weights didn't add any value as the default weight is just right for me out of the box. The RGB lights are a nice touch but unnecessary. Unless you want swagger, it's not a feature one would go for. Thank goodness I want swagger. As soon as I got this in my hand, it felt more solid and comfortable than I could have guessed from the product photos. However, this mouse ends up feeling second-rate compared to the superior G900 and the budget-friendly G403. Especially with the G403, the G502 Proteus Spectrum is lacking in the palm comfort and just feels too noisy in terms of button placement. The worst part about this mouse has to be the wheel. The wheel is plastic with a metallic finish, which makes for terrible finger grip. Sure, they made it tactile, but it feels wrong and cannot compare to a rubberized wheel. This decision is quite possibly the worst thing that Logitech has ever made with their mice. For something I'd be holding on to for hours at a time, you'd think this mouse would be able to beat out the cheaper G403, but it just further proves that price isn't everything, and that's why I love Logitech. I will probably use it on my backup server where my mice rarely get used, which is just a waste of $120. If I hadn't picked up the G403 or G900, I probably wouldn't have buyer's remorse. On its own, it's not a bad mouse, but it's certainly not the right mouse for me. Said no cat ever.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Wonderful mouse, glad to be rid of Razer",
            "reviewed_at": "14/08/2017",
            "reviewer_name": "Diarmuid O'Dyna",
            "category": "Video Games",
            "product_name": "Logitech G502 Proteus Spectrum RGB Tunable Gaming Mouse (910-004615)",
            "review_text": "Wonderful mouse, this is coming from a previous user of a Razer Mamba Chroma TE which I had the sensor die on me for no real reason. Took the opportunity to swap to this mouse and never looked back! The grip I prefer far better, with a nice place for your thumb to rest, the button placements and the amount or great. (Not too many, not too few). The weight system is awesome to have, I currently have it loaded to full weight because I prefer a heavier mouse but you can also make it quite light! The cable is braided and is durable, as is the general build of the mouse. However, one thing that disappointed me is the paint or whatever material is used to colour the mouse wheel black is coming off in areas I use often. Though it doesn't affect anything. The sensor is wonderful, as it should be! It is considered one of, if not the best sensor on the market right now! A big step up from Razer. Lastly the software is very good! It's a no BS type of style which is great especially coming from Razer's terrible software. The only complaint I have for it is that it doesn't scale in 4K and is near impossible to read on small displays.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Nice",
            "reviewed_at": "29/10/2016",
            "reviewer_name": "Abram",
            "category": "Video Games",
            "product_name": "Logitech G502 Proteus Spectrum RGB Tunable Gaming Mouse (910-004615)",
            "review_text": "G9x died, they no longer make it. This one seemed to be the most suitable replacement. A bit taller than the g9x, but I'm starting to like it better. Weights (with which you can distribute the weights better than other mice), work well, but a couple placement areas are too tight. had to take a scalpel to a few. long, braided cord. Good button feel, excellent grip, good software, excellent, acceleration-free sensor. I'd prefer the DPI switch button not be so far forward, but that can be easily changed with teh software. All buttons are easy to reach for my stubby fingers. My one complaint is the wheel. Very flimsy feel.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "4.0",
            "review_title": "Good mouse, functional, unstable software",
            "reviewed_at": "17/07/2017",
            "reviewer_name": "Andrei Mazanik",
            "category": "Video Games",
            "product_name": "Logitech G502 Proteus Spectrum RGB Tunable Gaming Mouse (910-004615)",
            "review_text": "Comfortably fits in an adult man's hand. It is so light that I instantly inserted all five metal weights inside. The cord is long and sheathed in fabric. Pressing buttons is effortless. The \"DPI Shift\" side button is normally out of reach and is not a problem other reviewers have had. The Logitech Gaming Software is unstable and will sometimes drop your button bindings, even in the middle of a competitive OverWatch match. Can assign twelve commands to buttons in OverWatch. Simply switch to \"Recognize game profiles\", select OverWatch and drag commands to buttons.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "4.0",
            "review_title": "Great gaming mouse, but can still be improved.",
            "reviewed_at": "09/05/2017",
            "reviewer_name": "Amazon Customer",
            "category": "Video Games",
            "product_name": "Logitech G502 Proteus Spectrum RGB Tunable Gaming Mouse (910-004615)",
            "review_text": "I purchased this mouse about 6 months ago, and so far it has been working quite well for me. The interface to customise the mouse is intuitive, and easy to use. I haven't had any tracking issues yet, and being able to modify the weight of the mouse is quite helpful to get the best experience on whatever size mouse pad/area you use (I find if you have a small area to play with, making the mouse high sensitivity and heavy works best, while a large play area allows for low sensitivity and light configuration). The mouse has been mostly good for me, but there are a couple area's I feel it could improve upon. First, one or two of the weights are a bit tricky to remove from my mouse. This is somewhat of a good thing, because the weights won't come loose mid-game, but I think a tool to remove them could be included. Secondly and more importantly, the cable on the mouse is not able to be easily replaced. This means that a damaged cord will require the mouse to be mailed in for repairs or you could take a crack at opening the mouse and trying to repair it yourself if you like, or of course you could end up replacing the mouse entirely. A mouse this expensive should really be able to easily swap out damaged cords.",
            "picture_urls": "",
            "website_name": "AMAZON"
        }
    ],
    "Product URL": "https://www.amazon.ca/Logitech-Proteus-Spectrum-Tunable-910-004615/dp/B019OB663A/ref=lp_1233055011_1_1/143-2822029-6939659",
    "Listing URL": "https://www.amazon.ca/b/ref=s9_acss_bw_cg_pcgrid_3c1_w?node=1233055011",
    "Product Image": "https://images-na.ssl-images-amazon.com/images/I/41xxUrMt7nL.jpg"
}{
    "business_item_data": {
        "business_type": "",
        "absolute_url": "https://www.amazon.ca/NETGEAR-N300-WiFi-Range-Extender/dp/B00L0YLRUW/ref=lp_1233055011_1_2/143-2822029-6939659?s=pc&ie=UTF8&qid=1527932389&sr=1-2",
        "category": "Electronics",
        "name": "NETGEAR N300 WiFi Range Extender - Essentials Edition (EX2700)",
        "sub_category": "",
        "picture_urls": "",
        "original_price": "",
        "sale_price": [],
        "availability": "Available from",
        "specifications": "",
        "website_name": "",
        "description": ""
    },
    "reviews": [
        {
            "absolute_url": "",
            "rating": "2.0",
            "review_title": "Great Signal, Horrible Performance",
            "reviewed_at": "04/01/2018",
            "reviewer_name": "Amazon Customer",
            "category": "Electronics",
            "product_name": "NETGEAR N300 WiFi Range Extender - Essentials Edition (EX2700)",
            "review_text": "While it the unit was easy enough to setup and does boost the signal quite well, it reduces the throughput so drastically, from 3.2MB/s without the extender down to a peak of 870KB/s with it, which really defeats the purpose of an extender. I tested the unit in multiple locations, including in the same room as the WiFi router all with the same terrible speed results. I tested by downloading files from a server in my house wired to the WiFi router, the files ranged from 10Mb to 1Gb. Connecting directly to the WiFi router my throughput was 2.9MB/s to 3.2MB/s. When connecting to the NetGear extender and downloading the same files, my throughput dropped to 690KB/s to a peak of 870KB/s, but averaged at only 810KB/s. The extender reported a good connection (green light) to both my WiFi router and the computer downloading the files, so connection was not the issue. Considering these tests were with just a single computer connected to the extender, I would hate to see the performance of HD streaming or multiple devices at the same time. Returning the unit.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "4.0",
            "review_title": "Good if it's necessary - Try moving router first.",
            "reviewed_at": "13/08/2017",
            "reviewer_name": "Ronald J Cox",
            "category": "Electronics",
            "product_name": "NETGEAR N300 WiFi Range Extender - Essentials Edition (EX2700)",
            "review_text": "This range extender does work. It does extend my network (under a different SSID). I'm a bit underwhelmed with the extra range and the speed of the N300 though. I use it mostly for extra coverage in my back yard, but no matter what set up I use or where I move the router or range extender the WiFi still seems to have spotty internet that drops off periodically. It's good for just browsing the web, but it can be frustrating to use for video streaming. I bought this with the intention of streaming videos to my chromecast onto a projector into my backyard, so the range extension and speed needed to be above and beyond the rest. It worked for 2 hours straight one night, but then, with no changes to the physical setup, the internet started dropping every 5 minutes and never recovered for the night. With the range extender being 14 horizontal feet and 6 vertical feet away from the extender, separated with a finished ceiling, standing 15 feet further away from them in the back yard, I am able to get 8.77 Mbits down and 3.88 Mbits up in the back yard, which is decent enough for streaming HD videos from youtube, generally. Overall a wise purchase. It's worked better than anything else I've used so far. I'm going to try to move things around a bit and see if they work better or if I can get slightly faster speeds.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "It extends the signal easily another 150ft",
            "reviewed_at": "06/03/2017",
            "reviewer_name": "Ben",
            "category": "Electronics",
            "product_name": "NETGEAR N300 WiFi Range Extender - Essentials Edition (EX2700)",
            "review_text": "I have this plugged in about 200ft from the router. It extends the signal easily another 150ft. This is in an office with concrete block walls.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "4.0",
            "review_title": "It is a good product but I hate the registration process that you ...",
            "reviewed_at": "14/03/2017",
            "reviewer_name": "A Customer",
            "category": "Electronics",
            "product_name": "NETGEAR N300 WiFi Range Extender - Essentials Edition (EX2700)",
            "review_text": "It is a good product but I hate the registration process that you have to submit your receipt rather than just serial and product no. The setup is not easy so I end up have to call tech support to get it working. It does boost your signals.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "4.0",
            "review_title": "5 minute setup and working great.",
            "reviewed_at": "18/04/2018",
            "reviewer_name": "IQ Guy",
            "category": "Electronics",
            "product_name": "NETGEAR N300 WiFi Range Extender - Essentials Edition (EX2700)",
            "review_text": "I got this unit recently and setup was super easy. I plugged it in, logged into the created network and followed the instruction to hook it into my current 5G network. I purchased the unit because my current router could not get a 5G signal to the rec room where I have a chromecast. This unit fixed the issue and I stream perfectly now. There is a bit of speed loss from the main router but not enough to interfere with the streaming which is flawless. I deducted one star only because you have to log on using a web interface which I did on my phone. There is an app to check network quality but it really does not apply to the extender. There is no app to setup the extender but the web interface worked well. I simply bookmarked the page to the home screen and that was that. I would much rather have had an app instead but that is being really picky. All in all I would have no issues recommending it and it was hands down much easier to set up than a previous extender I had.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "1.0",
            "review_title": "Not worth it",
            "reviewed_at": "08/04/2018",
            "reviewer_name": "FT",
            "category": "Electronics",
            "product_name": "NETGEAR N300 WiFi Range Extender - Essentials Edition (EX2700)",
            "review_text": "I took some time to take my decision when going for this range extender and although saw some bad reviews but still went for it since this was Netgear. However, it was really a disappointment. 1) It DOES extend the range of wifi and if you put halfway from your router, the area that does not have wifi gets a very good wifi signal. 2) Point 1 above becomes USELESS because you get the extended coverage with as much as 7 times lower than your original wifi's bandwidth!!! I I tested this out by putting the extender right next to my router. My original bandwidth is 70Mbps and this was showing maximum 10Mbps. And when i moved it to the actual position I wanted the coverage, the bandwidth dropped to 5Mbps. I had trouble making voice and video calls when 2 devices were online at the same time. So, overall. This did not solve my problem and its sitting in the return shipping. I am not sure if any other extender in this price range does a better job. I am not willing to take another risk and will just go with purchasing a powerline + wifi router to extend my coverage.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Excellent",
            "reviewed_at": "18/11/2017",
            "reviewer_name": "Brian",
            "category": "Electronics",
            "product_name": "NETGEAR N300 WiFi Range Extender - Essentials Edition (EX2700)",
            "review_text": "Has worked extremely well for 2-3 months now. I haven't had any outages longer than a half hour or so and only have had one of those that I've ever noticed. As our family is a heavy user of wifi, we'd know if there were major issues. The setup was very easy and my least favorite part of the whole device is that it adds _EXT at the end of my wifi network name. The range is much better than my router and has been effective in covering my house.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Flawless Performance",
            "reviewed_at": "04/12/2017",
            "reviewer_name": "Steve S. Morris",
            "category": "Electronics",
            "product_name": "NETGEAR N300 WiFi Range Extender - Essentials Edition (EX2700)",
            "review_text": "It has a simple and effective design – it plugs straight into an outlet and has adjustable antennas to give you the best coverage possible. The setup process is very straight forward. You simply plug it in, hit the WPS button on your router and the corresponding button on your router, and you’re ready to go. It’s doesn’t require any special software, though you can use the Netgear app to troubleshoot any issues you have.",
            "picture_urls": "",
            "website_name": "AMAZON"
        }
    ],
    "Product URL": "https://www.amazon.ca/NETGEAR-N300-WiFi-Range-Extender/dp/B00L0YLRUW/ref=lp_1233055011_1_2/143-2822029-6939659",
    "Listing URL": "https://www.amazon.ca/b/ref=s9_acss_bw_cg_pcgrid_3c1_w?node=1233055011",
    "Product Image": "https://images-na.ssl-images-amazon.com/images/I/41ut+X0tgqL.jpg"
}{
    "business_item_data": {
        "business_type": "",
        "absolute_url": "https://www.amazon.ca/HTC-VIVE-Virtual-Reality-System/dp/B00VF5NT4I/ref=lp_1233055011_1_3/143-2822029-6939659?s=pc&ie=UTF8&qid=1527932389&sr=1-3",
        "category": "Video Games",
        "name": "HTC VIVE - Virtual Reality System - VIVE Edition",
        "sub_category": "",
        "picture_urls": "",
        "original_price": "",
        "sale_price": [],
        "availability": "Available from",
        "specifications": "",
        "website_name": "",
        "description": ""
    },
    "reviews": [
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Five Stars",
            "reviewed_at": "25/06/2017",
            "reviewer_name": "G. Lambert",
            "category": "Video Games",
            "product_name": "HTC VIVE - Virtual Reality System - VIVE Edition",
            "review_text": "Real life is dead to me.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "An Amazing Workout! Highly Recommend!",
            "reviewed_at": "26/06/2017",
            "reviewer_name": "Zack",
            "category": "Video Games",
            "product_name": "HTC VIVE - Virtual Reality System - VIVE Edition",
            "review_text": "First Off, my Vive arrived on a Thursday and broke that Sunday. I am getting it replaced, free of charge by Amazon. HTC tried to help me get it back up and running but to no avail. They have great customer service. I am not happy that this happened, but I also understand that with mass production, sometimes things happen or don't work as they should all the time. Now, on to the review! This thing is AMAZING! I have never gotten such a workout in my life. I am a computer guy. I like to play games and research stuff on the internet. This has unfortunately led to an unhealthy lifestyle and I needed to shed a few pounds. I wanted to get a VR system anyway so I thought may be this would be a great way to kill two birds with one stone. And it is. This thing tricks you. You think you're just having fun playing games, but no. It is a full body workout and I love it! I have never been able to find something that was fun and exercise at the same time, but now I have it. I have an approximately 3m x 1.5m room-scale setup. While this works without a hitch most of the time, I would definitely recommend a 3m x 2m space if at all possible. I play Audioshield, Holopoint, The Golf Club VR, Superhot VR, Sword Master VR and Raw Data for exercise and activity. Of these, Holopoint and Audioshield are definitely the most intensive... but they are also a blast to play. I would definitely recommend this headset to anyone who has a powerful enough PC and can afford it, and would also like to get a nice workout in their own home. Now, a few other things; -The screen door effect is pretty bad unfortunately. However, as my HMD did die after 3 days, this may have just been a faulty or defective item. I will have to wait and see. -I wear glasses. I did not have problem with making the headset feel comfortable at all. Very spacious if you wear glasses. -My hand tracking seemed to be a bit wacky sometimes. However, I am gonna go out on a limb and blame myself for this one and say it was my fault for bad sensor placement. - I have an i7 5930k and a GTX 1080 TI. I never had any problems with framerates or whatnot.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Great Toy for those who can afford it!",
            "reviewed_at": "18/07/2017",
            "reviewer_name": "Sherbet Lemon",
            "category": "Video Games",
            "product_name": "HTC VIVE - Virtual Reality System - VIVE Edition",
            "review_text": "First off, going to say, you need to fork out a lot of money for this toy, this is not cheap and don't expect a price drop like the RIFT because as Gabe Newell said, Valve's loss of sales on this toy does not affect them at all nor do they care if it ends up as a total failure. That sounds like some really confident people! The great thing about it is supported by Steam not Facebook. I have owned it since Feb. Have to say, I have had no issues at all whatsoever, the hardware is great, top notch, VR is so amazingly immersive, the games are great, just bought a deluxe audio strap too recently, I have no negatives for this headset beside one thing and one thing only. Eye Tracking. VR could really use Eye Tracking. I wish this had Eye Tracking. Other thing is I wish the stock foam didn't suck so much, I sweat a lot and I can only enjoy 2 hours of gaming before taking the headset off. I wish the foam was actually some sweat fighting leather instead. All and all 5/5 from me.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "So much fun",
            "reviewed_at": "09/09/2017",
            "reviewer_name": "Bluemonker",
            "category": "Video Games",
            "product_name": "HTC VIVE - Virtual Reality System - VIVE Edition",
            "review_text": "The device comes with everything you will need. No need to go out and buy extra cables. Everything is easy to set up, and when you plug it in, Steam recognizes it right away for even easier install. The mask is fairly comfortable, and the controls are very lightweight. The controls are easy to learn, you just need to remember that you don't HAVE to walk physically everywhere, the device let's you move. 10/10 would recommend to everyone.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Perfect Working Condition",
            "reviewed_at": "29/09/2017",
            "reviewer_name": "Amazon Customer",
            "category": "Video Games",
            "product_name": "HTC VIVE - Virtual Reality System - VIVE Edition",
            "review_text": "My HTC Vive arrived in perfect working condition and I have had no problems 2 weeks under heavy use. The system itself is an amazing piece of technology and the illusion created by accurate tracking and room scale is one that I have not seen matched by either the PSVR or the Occulos (although the Occulos is close when using 3+ sensors). After extended periods of use however, I've noticed that the screen door effect is becoming more prevalent, this mostly happens when I unfocus my eyes while thinking. If you play games that are still interesting to you, you'll be really immersed in the experience. Everybody I let try my headset have been amazed. Videos are not able to do it justice. I was playing a game called smash party recently and accidentally smashed one of the controllers full force into my wall, I dented the wall but the controller still works fine!",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "4.0",
            "review_title": "Amazing product, but can be a tad difficult at times.",
            "reviewed_at": "04/10/2017",
            "reviewer_name": "Percy Cucumber",
            "category": "Video Games",
            "product_name": "HTC VIVE - Virtual Reality System - VIVE Edition",
            "review_text": "Amazing product, but not for those that aren't computer proficient. Right off the bat, I was having some issues setting up my HTC Vive. However, customer support was incredibly nice and helpful, and had me up and rolling in a few hours. I also have a PSVR and have used the Oculus Rift, and must say that this is by far the best and most amazing VR experience out there. I would highly recommend this to anybody, but do have some warnings! Firstly, be prepared for lots of glitches and problems while using this. While there are a couple hardware issues, most of the glitches are software glitches. These are all solvable, but might require some time and troubleshooting. Anybody good with computers should have no problems, but for example my parents would be utterly lost. Secondly, make sure your PC specs are well above the minimum required specs to run the HTC Vive. My computer is a bit more powerful than the minimum requirements, and has at times had serious problems trying to run some software on the Vive. Overall this product is amazing and I highly recommend it for those wanting the best possible VR experience. For those looking to get into VR without the hassle or the expensive PC build, I would highly recommend the PSVR.",
            "picture_urls": "",
            "website_name": "AMAZON"
        }
    ],
    "Product URL": "https://www.amazon.ca/HTC-VIVE-Virtual-Reality-System/dp/B00VF5NT4I/ref=lp_1233055011_1_3/143-2822029-6939659",
    "Listing URL": "https://www.amazon.ca/b/ref=s9_acss_bw_cg_pcgrid_3c1_w?node=1233055011",
    "Product Image": "https://images-na.ssl-images-amazon.com/images/I/41k-JbZHFOL.jpg"
}{
    "business_item_data": {
        "business_type": "",
        "absolute_url": "https://www.amazon.ca/BenQ-24-inch-Monitor-HDMI-GL2460HM/dp/B00IKDFL4O/ref=lp_1233055011_1_4/143-2822029-6939659?s=pc&ie=UTF8&qid=1527932389&sr=1-4",
        "category": "Electronics",
        "name": "BenQ 24-inch LED Monitor, 2ms, HDMI (GL2460HM)",
        "sub_category": "",
        "picture_urls": "",
        "original_price": "",
        "sale_price": [],
        "availability": "Available from",
        "specifications": "",
        "website_name": "",
        "description": ""
    },
    "reviews": [
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Almost Perfect",
            "reviewed_at": "28/07/2015",
            "reviewer_name": "Sandbo",
            "category": "Electronics",
            "product_name": "BenQ 24-inch LED Monitor, 2ms, HDMI (GL2460HM)",
            "review_text": "Got this monitor as a part a Python programming server. Have been using Dell's Ultrasharp and S-series, why made the switch when I am to get a new one? Pros: Low Blue Light - It would be great as I am going to stare at text through this monitor for a while Non-flicker - a big plus for reading text. Now try, shake your fingers left and right rapidly in front of your LCD monitor, do you see multiple fingers? This is because the PWM module powering the lighting didn't have a high enough frequency. In particular, when you set the monitor to low light, the flickering is more pronounced. This BENQ monitor is totally free from that as I checked. Most older Dell monitors, including the one I got 2 years ago, all suffered from this. So BENQ is a clear winner in terms of eyes caring. Cons: It is VA, not IPS as the panel technology. What it means is a worse color accuracy and view angle. What does it translate to? If you are serious about the color and you do some photoshop, or you will be viewing this monitor at a close distance/at an angle, you will then see the color changes a lot. I compared this directly with a Dell IPS monitor and I can say the difference is very significant. It is more like a TN panel monitor in terms of this, IPS are better options. In short, if you want a monitor healthy to your eyes and wallet, this is a very good monitor to think about. However it is not suitable if you expect large view angle or high color accuracy. An IPS monitor from Dell or even EIZO will be the better candidates.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "1.0",
            "review_title": "Product does not match reviews - NO HDMI port",
            "reviewed_at": "14/04/2018",
            "reviewer_name": "Jim",
            "category": "Electronics",
            "product_name": "BenQ 24-inch LED Monitor, 2ms, HDMI (GL2460HM)",
            "review_text": "I actually ordered this both in April 2018 and Feb 2017. In 2017 it came with an HDMI port and now it does not. As far as I can tell this product was \"updated\" and the new display does not have a HDMI port despite it being mentioned in the user reviews and by amazon recommendations. This product is 9H.LE5LB.QPA however the reviews and info are for the previously sold model \"GW2265HM.\" This is the fault of amazon for allowing this confusing to happen. The 718 user reviews include reviews for both models despite them being very different products.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "The BEST CHEAP 1080p Monitor!",
            "reviewed_at": "07/01/2018",
            "reviewer_name": "Jon",
            "category": "Electronics",
            "product_name": "BenQ 24-inch LED Monitor, 2ms, HDMI (GL2460HM)",
            "review_text": "This is a great monitor for the price! I had fairly basic needs with this purchase as I just wanted a 21 inch or bigger screen, 1080p, a tilt stand, Vesa mount compatible, and an HDMI port. This has everything I required and has been working great as a monitor for my home server, and the occasional time I use it as a second screen for my laptop. Image clarity is as expected, and as I normally use either high refresh rate or IPS monitors I am pleasantly surprised with this monitor from BenQ. There also are no dead pixels on my monitor, which I am happy to see. At a price of $129.99 (at the time of purchase) it’s really hard to complain at all. This monitor is used almost daily, and it serves its task. And with a good included stand and Vesa mount compatible it can be very multi-functional. This is a great product and I highly recommend it to anyone interested in it!",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Perfect for gaming and all other purposes.",
            "reviewed_at": "30/11/2017",
            "reviewer_name": "Hillary Trumpinton",
            "category": "Electronics",
            "product_name": "BenQ 24-inch LED Monitor, 2ms, HDMI (GL2460HM)",
            "review_text": "A really good monitor for the price. 22 inch exact. Flickerless and is perfect for gaming tbh. I was skeptical about it, but after I received the product I was actually really satisfied. The controls (buttons) have a perfect placement. The monitor has a lot of sound coming out of it (as in the gaming sound is perfect) when I play. The sound at even the lowest volume I put it on is extremely clear. I connected my Ps4 and played COD, you will not even notice the 5ms and 1ms response difference (this being 5ms). It has senseye tech and low blue light and many other options for the right view and night usage.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Amazing quality",
            "reviewed_at": "01/03/2017",
            "reviewer_name": "Parms",
            "category": "Electronics",
            "product_name": "BenQ 24-inch LED Monitor, 2ms, HDMI (GL2460HM)",
            "review_text": "got two of these babies on a vesa mount and hooked up to my clam shell mode MacBook. the quality is amazing and the Low Blue Light mode has made working/reading at night so much better and easier to do. Resolution is great and I wouldn't recommend using the speakers on these but it's great that they do come with it.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Great screen with some really GREAT features",
            "reviewed_at": "17/11/2017",
            "reviewer_name": "Kai",
            "category": "Electronics",
            "product_name": "BenQ 24-inch LED Monitor, 2ms, HDMI (GL2460HM)",
            "review_text": "I've had this monitor for about 2 weeks now and it's a great monitor. Great contrast, good refresh time and a low blue light mode which I find surprisingly useful. This monitor actually changed my enjoyment of using a computer, I was always doing things on my 13\" MacBook and decided to jump the gun and get an external monitor and the first thing I thought after the first day of using it was \"why didn't I get this sooner\"? The reason why I got this monitor and might help you decide is: -It's a VA panel, I like the contrast it gives, and I also LIKE how the viewing angle is a bit less than an IPS panel, it's like having an included privacy filter, although viewing angles are good. -It has HDMI input, built in speakers, but more importantly a built in 3.5mm headphone jack -VESA mountable -21.5\" is a good size, but small form factor.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "3.0",
            "review_title": "Questionable tech support",
            "reviewed_at": "31/12/2017",
            "reviewer_name": "AlMac",
            "category": "Electronics",
            "product_name": "BenQ 24-inch LED Monitor, 2ms, HDMI (GL2460HM)",
            "review_text": "While the design was relatively pleasing, there was a large column of dead pixels in the middle of the screen. Normally that would only be a single point off, but when contacted, though swift, a BenQ tech suggested I try to fix it with multiple techniques --from wikihow of all websites!-- that would in all likelihood void the warranty. Including; striking the screen with a pen, pressing a bag of boiling water against the screen, and using third party \"screen enhancers\". The least egregious of the suggestions was to try an online dead pixel fixer (it didn't work). Now I honestly have no idea if these methods are standard or effective, or for that matter given in earnest, but the idea of striking a screen with a pen until it flashes rather alarmed me. Hopefully my next screen will not have any such problems.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Pretty hard to find fault at that price point.",
            "reviewed_at": "10/12/2015",
            "reviewer_name": "BW022",
            "category": "Electronics",
            "product_name": "BenQ 24-inch LED Monitor, 2ms, HDMI (GL2460HM)",
            "review_text": "I use it as a workstation monitor for my tablet. The HDMI input and speakers makes it great for this purpose. There isn't much to find fault with in the unit for the price. Shipment arrived in time. Picture and colours is good and the sound is good enough for general music and work. It has 3.5mm headphone jack if you need a headset of speakers. With the HDMI, you could use it as a TV for a PVR, gaming console, etc. Stand is fine and allows tilting. Nothing really to take marks off at that price.",
            "picture_urls": "",
            "website_name": "AMAZON"
        }
    ],
    "Product URL": "https://www.amazon.ca/BenQ-24-inch-Monitor-HDMI-GL2460HM/dp/B00IKDFL4O/ref=lp_1233055011_1_4/143-2822029-6939659",
    "Listing URL": "https://www.amazon.ca/b/ref=s9_acss_bw_cg_pcgrid_3c1_w?node=1233055011",
    "Product Image": "https://images-na.ssl-images-amazon.com/images/I/41R+GEaCG3L.jpg"
}{
    "business_item_data": {
        "business_type": "",
        "absolute_url": "https://www.amazon.ca/Logitech-Wireless-Touch-Keyboard-920-007119/dp/B014EUQOGK/ref=lp_1233055011_1_5/143-2822029-6939659?s=pc&ie=UTF8&qid=1527932389&sr=1-5",
        "category": "Electronics",
        "name": "Logitech K400 Plus Wireless Touch Keyboard (920-007119)",
        "sub_category": "",
        "picture_urls": "",
        "original_price": "",
        "sale_price": [],
        "availability": "Available from",
        "specifications": "",
        "website_name": "",
        "description": ""
    },
    "reviews": [
        {
            "absolute_url": "",
            "rating": "3.0",
            "review_title": "Not a bad choice for an HTPC keyboard",
            "reviewed_at": "05/01/2017",
            "reviewer_name": "Amazon Customer",
            "category": "Electronics",
            "product_name": "Logitech K400 Plus Wireless Touch Keyboard (920-007119)",
            "review_text": "Picked one up for my HTPC. It's nice to be able to type things into XBMC / YouTube / etc. The keyboard itself has a few draw backs, but I'd bet all the small form-factor keyboards on the market would share my cons. Pros: - Seems to work fine about 4 meters from my HTPC - Integrated touchpad means I could ditch the mouse sitting under my coffee table Cons: - By default, function keys (F1, F2, etc) are the secondary functions to the media functions (Vol. Up, Mute, Next.) This means that instead of Alt+F4, you need three fingers to press Alt+Fn+F4. Maybe not the end of the world, but being someone who uses keyboard shortcuts a lot, I find it annoying! You are able to change this so the reverse is true, but it requires a software called \"Logitech Options.\" A simple shortcut would have been nicer. - It's small. I have big hands, so typing on what amounts to a netbook keyboard is difficult. Not a big deal if you're only typing in the odd movie name, or album artist. Pro/Con: - Uses the Logitech Unifying receiver. Means that you don't need another USB receiver if you're already using Unifying hardware. If you're using Bluetooth however, you'll need another USB port. - Top left yellow button is left-click. This is a duplication of the normal left click button below the track pad. I don't get it. Unless that button is re-programmable with software, why did that include it?",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "3.0",
            "review_title": "An ok keyboard but not great by any means...",
            "reviewed_at": "28/02/2018",
            "reviewer_name": "Sam Sharma",
            "category": "Electronics",
            "product_name": "Logitech K400 Plus Wireless Touch Keyboard (920-007119)",
            "review_text": "The keyboard quality is not all that great. The keys although are easy enough to click and feel pretty nice while typing. The mousepad however has a very plasticky feel and is much too sensitive especially when scrolling. The keyboard looks as though it has been previously used as the box came beaten up and the keyboard had a few scratches and marks on it... To be honest, its an okay product but not good by any means. If you can get a deal on it for roughly 20 bucks, its ok especially for use on a tv which it is pretty good at. Beware the small keys and size and the very small backspace button. All in all the mouse pad area works well but not when scrolling, the keys are really small and congested for people with bigger hand sizes, and the quality is not up to the mark for the Logitech brand name.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Highly recommended keyboard.",
            "reviewed_at": "27/10/2017",
            "reviewer_name": "Elie Michael",
            "category": "Electronics",
            "product_name": "Logitech K400 Plus Wireless Touch Keyboard (920-007119)",
            "review_text": "Finally a great keyboard for the TV. Light and sturdy with essential keys and functions with a very good range. I have tried several other keyboards but the range was poor, even if I was sitting in front of the TV, any small item in between the keyboard and its receiver will block their operation, but not the Logitech K400. If you look for the scroll wheel, you will not find one, to make the screen scroll you have to slide 2 fingers on the touch pad to simulate a scrolling wheel. The scroll is not as responsive and precise as a scroll wheel, but you get used to it quickly. On top of all these positive points, its price was unbeatable when I purchased it on sale for around $31. I highly recommend it.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "4.0",
            "review_title": "Good for Internet Surfing on your Smart TV",
            "reviewed_at": "15/06/2017",
            "reviewer_name": "Mischa_C",
            "category": "Electronics",
            "product_name": "Logitech K400 Plus Wireless Touch Keyboard (920-007119)",
            "review_text": "This keyboard is good for web surfing on your smart TV. It's compatible with my Sharp 55\" N6000 Series 4K Smart TV. I initially hoped that this keyboard would work specifically for YouTube and Netflix but the only thing that works for those apps are the arrow buttons so it did not really speed up my search time unfortunately. You can bypass this problem by using the web browser and using YouTube there, however the quality of the resolution is not the same as using the YouTube App directly. The batteries are included and there is an on/off switch on the top side of the keyboard. This is a nice size and quite light and I like the cursor pad. I sit about 5 meters away from the TV using this and it works flawlessly. I hope that one day YouTube and Netflix will update their wireless keyboard functionally so that this can be put more in use because it's a nice product.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "3.0",
            "review_title": "OK, but for the inconsistent touch pad and the lack of backlight",
            "reviewed_at": "08/07/2017",
            "reviewer_name": "VM",
            "category": "Electronics",
            "product_name": "Logitech K400 Plus Wireless Touch Keyboard (920-007119)",
            "review_text": "Nice and functional, the \"Unify\" adapter means you save a USB port if you also have a Logitech mouse. Would be 5 stars but for two misses: - the touch pad is... touchy - you don't get the consistent, smooth movement even the cheapest laptops pads provide. Two finger scroll is more \"miss\" than \"hit\" - lack of backlight, made worse by the dim lettering on the keys: most keyboards without back light at least have very bright lettering that catches the faintest light and are sill useable in near darkness.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Very good product",
            "reviewed_at": "01/01/2018",
            "reviewer_name": "Leon Sebek",
            "category": "Electronics",
            "product_name": "Logitech K400 Plus Wireless Touch Keyboard (920-007119)",
            "review_text": "I bought this keyboard as a replacement for the smaller Rii i8+ that I was previously using for my Android box. Unfortunately, like the Rii, I still have to keep the OEM remote handy in order to jump all the way back to the home screen and turn the box on and off. This keyboard is extremely light and the touch pad is a huge convenience, although the right button does not appear to function in the same manner as on a regular touch pad (at least it doesn't when I am in Kodi and I haven't tried it with my laptop yet to determine if the same issue exists with a computer).",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Good wireless keyboard and track pad",
            "reviewed_at": "24/06/2017",
            "reviewer_name": "Beebs",
            "category": "Electronics",
            "product_name": "Logitech K400 Plus Wireless Touch Keyboard (920-007119)",
            "review_text": "I had a similar but older version of this keyboard and own a Microsoft version that is similar in apparance. This is better than both of them. Looks good, the keys feel good, and it looks quality made. The keyboard isn't mechanical level quality but it is more than good enough for most people's use (and its used in an office - its gotten solid reviews). While I love the track pad which keeps your hands on the keyboard and is accurate and easy to use, others in the office still prefer to use a wireless mouse. Habit I guess.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "4.0",
            "review_title": "Good and recommended to use with android box / Pc",
            "reviewed_at": "19/01/2018",
            "reviewer_name": "Janardhanan",
            "category": "Electronics",
            "product_name": "Logitech K400 Plus Wireless Touch Keyboard (920-007119)",
            "review_text": "On my search for a wireless keyboard with trackpad I had this coming up first in my list .Here goes my review for this product pros - - light and easy to use - wireless dongle to connect with usb port - Trackpad is decent and usable - Keys are mushy and easy to type cons - No Bluetooth- cannot use with smartphones - the trackpad is not great at the best decent only - coming from a mechanical keyboard this felt so cheap though it is indeed cheap I took out one star for the lack of Bluetooth at this cost point . for the rest works well with tv and android boxes",
            "picture_urls": "",
            "website_name": "AMAZON"
        }
    ],
    "Product URL": "https://www.amazon.ca/Logitech-Wireless-Touch-Keyboard-920-007119/dp/B014EUQOGK/ref=lp_1233055011_1_5/143-2822029-6939659",
    "Listing URL": "https://www.amazon.ca/b/ref=s9_acss_bw_cg_pcgrid_3c1_w?node=1233055011",
    "Product Image": "https://images-na.ssl-images-amazon.com/images/I/411hpHoHDvL.jpg"
}{
    "business_item_data": {
        "business_type": "",
        "absolute_url": "https://www.amazon.ca/BenQ-GW2270HM-22-Inch-Monitor-Display/dp/B00KYCSRQI/ref=lp_1233055011_1_6/143-2822029-6939659?s=pc&ie=UTF8&qid=1527932389&sr=1-6",
        "category": "Electronics",
        "name": "BenQ GW2270HM 22-Inch 1080 LED Monitor, 5ms, 8-bit Display, HDMI",
        "sub_category": "",
        "picture_urls": "",
        "original_price": "",
        "sale_price": [],
        "availability": "Available from",
        "specifications": "",
        "website_name": "",
        "description": ""
    },
    "reviews": [
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Almost Perfect",
            "reviewed_at": "28/07/2015",
            "reviewer_name": "Sandbo",
            "category": "Electronics",
            "product_name": "BenQ GW2270HM 22-Inch 1080 LED Monitor, 5ms, 8-bit Display, HDMI",
            "review_text": "Got this monitor as a part a Python programming server. Have been using Dell's Ultrasharp and S-series, why made the switch when I am to get a new one? Pros: Low Blue Light - It would be great as I am going to stare at text through this monitor for a while Non-flicker - a big plus for reading text. Now try, shake your fingers left and right rapidly in front of your LCD monitor, do you see multiple fingers? This is because the PWM module powering the lighting didn't have a high enough frequency. In particular, when you set the monitor to low light, the flickering is more pronounced. This BENQ monitor is totally free from that as I checked. Most older Dell monitors, including the one I got 2 years ago, all suffered from this. So BENQ is a clear winner in terms of eyes caring. Cons: It is VA, not IPS as the panel technology. What it means is a worse color accuracy and view angle. What does it translate to? If you are serious about the color and you do some photoshop, or you will be viewing this monitor at a close distance/at an angle, you will then see the color changes a lot. I compared this directly with a Dell IPS monitor and I can say the difference is very significant. It is more like a TN panel monitor in terms of this, IPS are better options. In short, if you want a monitor healthy to your eyes and wallet, this is a very good monitor to think about. However it is not suitable if you expect large view angle or high color accuracy. An IPS monitor from Dell or even EIZO will be the better candidates.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "1.0",
            "review_title": "Product does not match reviews - NO HDMI port",
            "reviewed_at": "14/04/2018",
            "reviewer_name": "Jim",
            "category": "Electronics",
            "product_name": "BenQ GW2270HM 22-Inch 1080 LED Monitor, 5ms, 8-bit Display, HDMI",
            "review_text": "I actually ordered this both in April 2018 and Feb 2017. In 2017 it came with an HDMI port and now it does not. As far as I can tell this product was \"updated\" and the new display does not have a HDMI port despite it being mentioned in the user reviews and by amazon recommendations. This product is 9H.LE5LB.QPA however the reviews and info are for the previously sold model \"GW2265HM.\" This is the fault of amazon for allowing this confusing to happen. The 718 user reviews include reviews for both models despite them being very different products.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "The BEST CHEAP 1080p Monitor!",
            "reviewed_at": "07/01/2018",
            "reviewer_name": "Jon",
            "category": "Electronics",
            "product_name": "BenQ GW2270HM 22-Inch 1080 LED Monitor, 5ms, 8-bit Display, HDMI",
            "review_text": "This is a great monitor for the price! I had fairly basic needs with this purchase as I just wanted a 21 inch or bigger screen, 1080p, a tilt stand, Vesa mount compatible, and an HDMI port. This has everything I required and has been working great as a monitor for my home server, and the occasional time I use it as a second screen for my laptop. Image clarity is as expected, and as I normally use either high refresh rate or IPS monitors I am pleasantly surprised with this monitor from BenQ. There also are no dead pixels on my monitor, which I am happy to see. At a price of $129.99 (at the time of purchase) it’s really hard to complain at all. This monitor is used almost daily, and it serves its task. And with a good included stand and Vesa mount compatible it can be very multi-functional. This is a great product and I highly recommend it to anyone interested in it!",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Perfect for gaming and all other purposes.",
            "reviewed_at": "30/11/2017",
            "reviewer_name": "Hillary Trumpinton",
            "category": "Electronics",
            "product_name": "BenQ GW2270HM 22-Inch 1080 LED Monitor, 5ms, 8-bit Display, HDMI",
            "review_text": "A really good monitor for the price. 22 inch exact. Flickerless and is perfect for gaming tbh. I was skeptical about it, but after I received the product I was actually really satisfied. The controls (buttons) have a perfect placement. The monitor has a lot of sound coming out of it (as in the gaming sound is perfect) when I play. The sound at even the lowest volume I put it on is extremely clear. I connected my Ps4 and played COD, you will not even notice the 5ms and 1ms response difference (this being 5ms). It has senseye tech and low blue light and many other options for the right view and night usage.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Amazing quality",
            "reviewed_at": "01/03/2017",
            "reviewer_name": "Parms",
            "category": "Electronics",
            "product_name": "BenQ GW2270HM 22-Inch 1080 LED Monitor, 5ms, 8-bit Display, HDMI",
            "review_text": "got two of these babies on a vesa mount and hooked up to my clam shell mode MacBook. the quality is amazing and the Low Blue Light mode has made working/reading at night so much better and easier to do. Resolution is great and I wouldn't recommend using the speakers on these but it's great that they do come with it.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Great screen with some really GREAT features",
            "reviewed_at": "17/11/2017",
            "reviewer_name": "Kai",
            "category": "Electronics",
            "product_name": "BenQ GW2270HM 22-Inch 1080 LED Monitor, 5ms, 8-bit Display, HDMI",
            "review_text": "I've had this monitor for about 2 weeks now and it's a great monitor. Great contrast, good refresh time and a low blue light mode which I find surprisingly useful. This monitor actually changed my enjoyment of using a computer, I was always doing things on my 13\" MacBook and decided to jump the gun and get an external monitor and the first thing I thought after the first day of using it was \"why didn't I get this sooner\"? The reason why I got this monitor and might help you decide is: -It's a VA panel, I like the contrast it gives, and I also LIKE how the viewing angle is a bit less than an IPS panel, it's like having an included privacy filter, although viewing angles are good. -It has HDMI input, built in speakers, but more importantly a built in 3.5mm headphone jack -VESA mountable -21.5\" is a good size, but small form factor.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "3.0",
            "review_title": "Questionable tech support",
            "reviewed_at": "31/12/2017",
            "reviewer_name": "AlMac",
            "category": "Electronics",
            "product_name": "BenQ GW2270HM 22-Inch 1080 LED Monitor, 5ms, 8-bit Display, HDMI",
            "review_text": "While the design was relatively pleasing, there was a large column of dead pixels in the middle of the screen. Normally that would only be a single point off, but when contacted, though swift, a BenQ tech suggested I try to fix it with multiple techniques --from wikihow of all websites!-- that would in all likelihood void the warranty. Including; striking the screen with a pen, pressing a bag of boiling water against the screen, and using third party \"screen enhancers\". The least egregious of the suggestions was to try an online dead pixel fixer (it didn't work). Now I honestly have no idea if these methods are standard or effective, or for that matter given in earnest, but the idea of striking a screen with a pen until it flashes rather alarmed me. Hopefully my next screen will not have any such problems.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Pretty hard to find fault at that price point.",
            "reviewed_at": "10/12/2015",
            "reviewer_name": "BW022",
            "category": "Electronics",
            "product_name": "BenQ GW2270HM 22-Inch 1080 LED Monitor, 5ms, 8-bit Display, HDMI",
            "review_text": "I use it as a workstation monitor for my tablet. The HDMI input and speakers makes it great for this purpose. There isn't much to find fault with in the unit for the price. Shipment arrived in time. Picture and colours is good and the sound is good enough for general music and work. It has 3.5mm headphone jack if you need a headset of speakers. With the HDMI, you could use it as a TV for a PVR, gaming console, etc. Stand is fine and allows tilting. Nothing really to take marks off at that price.",
            "picture_urls": "",
            "website_name": "AMAZON"
        }
    ],
    "Product URL": "https://www.amazon.ca/BenQ-GW2270HM-22-Inch-Monitor-Display/dp/B00KYCSRQI/ref=lp_1233055011_1_6/143-2822029-6939659",
    "Listing URL": "https://www.amazon.ca/b/ref=s9_acss_bw_cg_pcgrid_3c1_w?node=1233055011",
    "Product Image": "https://images-na.ssl-images-amazon.com/images/I/41hKcK8IKUL.jpg"
}{
    "business_item_data": {
        "business_type": "",
        "absolute_url": "https://www.amazon.ca/Corsair-Vengeance-3000MHz-Desktop-Memory/dp/B0134EW7G8/ref=lp_1233055011_1_8/143-2822029-6939659?s=pc&ie=UTF8&qid=1527932389&sr=1-8",
        "category": "Electronics",
        "name": "Corsair Vengeance LPX 16GB (2x8GB) DDR4 DRAM 3000MHz C15 Desktop Memory Kit - Black (CMK16GX4M2B3000C15)",
        "sub_category": "",
        "picture_urls": "",
        "original_price": "CDN$ 290.82",
        "sale_price": [],
        "availability": "Usually ships within 6 to 10 days",
        "specifications": "",
        "website_name": "",
        "description": ""
    },
    "reviews": [
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Great budget ram for Ryzen",
            "reviewed_at": "27/04/2017",
            "reviewer_name": "Sean",
            "category": "Electronics",
            "product_name": "Corsair Vengeance LPX 16GB (2x8GB) DDR4 DRAM 3000MHz C15 Desktop Memory Kit - Black (CMK16GX4M2B3000C15)",
            "review_text": "I spent HOURS trying to track down 'Samsung B-die' for my Asrock x370 SLI board that would work properly, and could only find severely overpriced RAM that wasn't on my QVL. I had read that other Ryzen builders had gotten this to run at 2933, so took a chance even though this 8gb density wasn't on the list. Sure enough, it booted up no problem at 2933. Not able to boot at 3200 (YET) - but I'm sure that functionality will come over the next month or two. For the budget price for this pair, it's 100% worth it to buy and wait for the extra 267mhz. Certainly better than paying $250+ for B-die that will become irrelevant shortly anyways. Purchase with confidence!",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "PLEASE READ FOR RYZEN SYSTEMS",
            "reviewed_at": "08/07/2017",
            "reviewer_name": "Amazon Customer",
            "category": "Electronics",
            "product_name": "Corsair Vengeance LPX 16GB (2x8GB) DDR4 DRAM 3000MHz C15 Desktop Memory Kit - Black (CMK16GX4M2B3000C15)",
            "review_text": "Excellent RAM. Used currently in a Ryzen 5 1600 build w/ a MSI Tomahawk B350 board. Am able to reach 3200 with this build after latest bios updates! Incredibly fast and low profile, does its job and does it well. I recommend heavily! ***MAKE SURE TO UPDATE BIOS TO LATEST FIRMWARE/BETA*** You will not be able to reach these speeds without updating! Latest bios update fixes any sort of ram speed problems!",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "You WANT Corsair RAM!",
            "reviewed_at": "02/06/2017",
            "reviewer_name": "Jon",
            "category": "Electronics",
            "product_name": "Corsair Vengeance LPX 16GB (2x8GB) DDR4 DRAM 3000MHz C15 Desktop Memory Kit - Black (CMK16GX4M2B3000C15)",
            "review_text": "Corsair always delivers on their products, and their RAM is no exception. I have now bought 7/8 sets of my RAM from Corsair and have yet to have a single issue with any of their sticks. I only once bought RAM from G.Skill, but for the most part I buy Corsair RAM exclusively. I own their Value Select, Vengeance LPX, Vengeance LED, and Dominator Platinum RAM. If you want RAM that will perform as advertised and last forever this is the kit of RAM you want. I got this set at a great price a few months back in anticipation for this latest build. This particular set is for an ITX system. For this build I went with a white theme so naturally I wanted white RAM, and I didn’t want tall RAM either. This Vengeance LPX kit was the perfect fit for my needs and it looks great in my system. It is paired with an Intel i5-7500 and an EVGA GTX 960 FTW ACX 2.0 4GB, and I get great system performance. This kit is also easy to set to its rated speed of 3000MHz; you simply go into your bios on start-up (hit F2 and Delete) then enable XMP and it should automatically set to 3000MHz depending on your motherboard. If not head to advanced settings, and then to AI Tweaker (Asus motherboards), and set your RAM to its rated speed, so 3000HMz for this set, then save your settings and exit. It’s an easy process and allows you to use the full potential of your RAM, I have yet to have a problem setting any of my Corsair RAM to its rated speed. So for those of you looking for a great kit of RAM look no further. Corsair has many ‘flavours’ of RAM, and all sorts of colors so there’s something for everyone. I swear by Corsair’s ram and highly recommend this product to anyone interested! (Pictures attached)",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "1.0",
            "review_title": "Used it for less than two months and one of ...",
            "reviewed_at": "05/12/2017",
            "reviewer_name": "Amazon Customer",
            "category": "Electronics",
            "product_name": "Corsair Vengeance LPX 16GB (2x8GB) DDR4 DRAM 3000MHz C15 Desktop Memory Kit - Black (CMK16GX4M2B3000C15)",
            "review_text": "Used it for less than two months and one of them is not working. Took me a while to figure out why I'm getting BSOD. Now I'm trying to send it back but they don't have customer service in Canada. Update: Their website is awful and they are asking me to send both modules back to them while only one of them is faulty. If I send both back my computer won't work anymore. Update #2: Trying to get them to send me a kit before I send them my kit (express option) and their website is not working.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Very good DDR4 Ram for the money!",
            "reviewed_at": "26/09/2017",
            "reviewer_name": "SpeedyTechies",
            "category": "Electronics",
            "product_name": "Corsair Vengeance LPX 16GB (2x8GB) DDR4 DRAM 3000MHz C15 Desktop Memory Kit - Black (CMK16GX4M2B3000C15)",
            "review_text": "Firstly, I have just built a Ryzen 1800X setup and these were the ram I got for it because of the frequency. At first the motherboard could not recognize the 3200mhz due to old BIOS settings. After doing a bit of research, OH MY GOD, the computer finally recognized it. I got two of these so I can fill in all 4 RAM slots in my motherboard and now my PC is chopping through video work like butter!!!! Definitely recommend these ram kits.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Great bang for your buck",
            "reviewed_at": "09/02/2017",
            "reviewer_name": "Soph Fly",
            "category": "Electronics",
            "product_name": "Corsair Vengeance LPX 16GB (2x8GB) DDR4 DRAM 3000MHz C15 Desktop Memory Kit - Black (CMK16GX4M2B3000C15)",
            "review_text": "Solid RAM sticks as you'd expect from Corsair! I have purchased these to use with my custom mid/high range video editing build (keep reading for the full list), and I am super happy! They can also be overclocked by the way (only do this if you know what you're doing). The price is very reasonable and the fact that they are DDR4 makes them last a little longer until you need to upgrade. CPU: Intel Core i5-6600K 3.5GHz Quad-Core Processor CPU Cooler: Corsair H100i v2 70.7 CFM Liquid CPU Cooler (I went all out with the cooler because I am overclocking my CPU) Motherboard: Asus Z170-A ATX LGA1151 Motherboard RAM: Corsair Vengeance LPX 16GB (2 x 8GB) DDR4-3000 Memory Video Card: Gigabyte GeForce GTX 1060 6GB 6GB WINDFORCE OC 6G Video Card Case: NZXT S340 (White) ATX Mid Tower Case Power Supply: EVGA SuperNOVA NEX 650W 80+ Gold Certified Fully-Modular ATX Power Supply For storage, I used my existing Crucial SSD and a Samsung HDD which fit with this build no problem. As for monitors, that a whole different topic :)",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "4.0",
            "review_title": "Nicely Priced RAM and a solid product from Corsair once again.",
            "reviewed_at": "29/11/2017",
            "reviewer_name": "Wayne",
            "category": "Electronics",
            "product_name": "Corsair Vengeance LPX 16GB (2x8GB) DDR4 DRAM 3000MHz C15 Desktop Memory Kit - Black (CMK16GX4M2B3000C15)",
            "review_text": "Solid product from Corsair. Never been disappointed with Corsair memory and have not had a single issue with this memory kit so far. Also purchased a second kit and am running 32GB's of RAM in my current system build. Was lucky when I purchased this kit and got it for $149.99 when I purchased it and got the second kit for the exactly same price from another vendor as well. Now it is retailing for $243.99, crazy.",
            "picture_urls": "",
            "website_name": "AMAZON"
        }
    ],
    "Product URL": "https://www.amazon.ca/Corsair-Vengeance-3000MHz-Desktop-Memory/dp/B0134EW7G8/ref=lp_1233055011_1_8/143-2822029-6939659",
    "Listing URL": "https://www.amazon.ca/b/ref=s9_acss_bw_cg_pcgrid_3c1_w?node=1233055011",
    "Product Image": "https://images-na.ssl-images-amazon.com/images/I/41AGvSmY-fL.jpg"
}{
    "business_item_data": {
        "business_type": "",
        "absolute_url": "https://www.amazon.ca/BenQ-9H-LE5LB-QPA-21-5-Inch-LED-Lit-Monitors/dp/B019EFMK1I/ref=lp_1233055011_1_9/143-2822029-6939659?s=pc&ie=UTF8&qid=1527932389&sr=1-9",
        "category": "Electronics",
        "name": "BenQ 9H.LE5LB.QPA 21.5-Inch Screen LED-Lit LCD Monitors",
        "sub_category": "",
        "picture_urls": "",
        "original_price": "",
        "sale_price": [],
        "availability": "Available from",
        "specifications": "",
        "website_name": "",
        "description": ""
    },
    "reviews": [
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Almost Perfect",
            "reviewed_at": "28/07/2015",
            "reviewer_name": "Sandbo",
            "category": "Electronics",
            "product_name": "BenQ 9H.LE5LB.QPA 21.5-Inch Screen LED-Lit LCD Monitors",
            "review_text": "Got this monitor as a part a Python programming server. Have been using Dell's Ultrasharp and S-series, why made the switch when I am to get a new one? Pros: Low Blue Light - It would be great as I am going to stare at text through this monitor for a while Non-flicker - a big plus for reading text. Now try, shake your fingers left and right rapidly in front of your LCD monitor, do you see multiple fingers? This is because the PWM module powering the lighting didn't have a high enough frequency. In particular, when you set the monitor to low light, the flickering is more pronounced. This BENQ monitor is totally free from that as I checked. Most older Dell monitors, including the one I got 2 years ago, all suffered from this. So BENQ is a clear winner in terms of eyes caring. Cons: It is VA, not IPS as the panel technology. What it means is a worse color accuracy and view angle. What does it translate to? If you are serious about the color and you do some photoshop, or you will be viewing this monitor at a close distance/at an angle, you will then see the color changes a lot. I compared this directly with a Dell IPS monitor and I can say the difference is very significant. It is more like a TN panel monitor in terms of this, IPS are better options. In short, if you want a monitor healthy to your eyes and wallet, this is a very good monitor to think about. However it is not suitable if you expect large view angle or high color accuracy. An IPS monitor from Dell or even EIZO will be the better candidates.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "1.0",
            "review_title": "Product does not match reviews - NO HDMI port",
            "reviewed_at": "14/04/2018",
            "reviewer_name": "Jim",
            "category": "Electronics",
            "product_name": "BenQ 9H.LE5LB.QPA 21.5-Inch Screen LED-Lit LCD Monitors",
            "review_text": "I actually ordered this both in April 2018 and Feb 2017. In 2017 it came with an HDMI port and now it does not. As far as I can tell this product was \"updated\" and the new display does not have a HDMI port despite it being mentioned in the user reviews and by amazon recommendations. This product is 9H.LE5LB.QPA however the reviews and info are for the previously sold model \"GW2265HM.\" This is the fault of amazon for allowing this confusing to happen. The 718 user reviews include reviews for both models despite them being very different products.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "The BEST CHEAP 1080p Monitor!",
            "reviewed_at": "07/01/2018",
            "reviewer_name": "Jon",
            "category": "Electronics",
            "product_name": "BenQ 9H.LE5LB.QPA 21.5-Inch Screen LED-Lit LCD Monitors",
            "review_text": "This is a great monitor for the price! I had fairly basic needs with this purchase as I just wanted a 21 inch or bigger screen, 1080p, a tilt stand, Vesa mount compatible, and an HDMI port. This has everything I required and has been working great as a monitor for my home server, and the occasional time I use it as a second screen for my laptop. Image clarity is as expected, and as I normally use either high refresh rate or IPS monitors I am pleasantly surprised with this monitor from BenQ. There also are no dead pixels on my monitor, which I am happy to see. At a price of $129.99 (at the time of purchase) it’s really hard to complain at all. This monitor is used almost daily, and it serves its task. And with a good included stand and Vesa mount compatible it can be very multi-functional. This is a great product and I highly recommend it to anyone interested in it!",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Perfect for gaming and all other purposes.",
            "reviewed_at": "30/11/2017",
            "reviewer_name": "Hillary Trumpinton",
            "category": "Electronics",
            "product_name": "BenQ 9H.LE5LB.QPA 21.5-Inch Screen LED-Lit LCD Monitors",
            "review_text": "A really good monitor for the price. 22 inch exact. Flickerless and is perfect for gaming tbh. I was skeptical about it, but after I received the product I was actually really satisfied. The controls (buttons) have a perfect placement. The monitor has a lot of sound coming out of it (as in the gaming sound is perfect) when I play. The sound at even the lowest volume I put it on is extremely clear. I connected my Ps4 and played COD, you will not even notice the 5ms and 1ms response difference (this being 5ms). It has senseye tech and low blue light and many other options for the right view and night usage.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Amazing quality",
            "reviewed_at": "01/03/2017",
            "reviewer_name": "Parms",
            "category": "Electronics",
            "product_name": "BenQ 9H.LE5LB.QPA 21.5-Inch Screen LED-Lit LCD Monitors",
            "review_text": "got two of these babies on a vesa mount and hooked up to my clam shell mode MacBook. the quality is amazing and the Low Blue Light mode has made working/reading at night so much better and easier to do. Resolution is great and I wouldn't recommend using the speakers on these but it's great that they do come with it.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Great screen with some really GREAT features",
            "reviewed_at": "17/11/2017",
            "reviewer_name": "Kai",
            "category": "Electronics",
            "product_name": "BenQ 9H.LE5LB.QPA 21.5-Inch Screen LED-Lit LCD Monitors",
            "review_text": "I've had this monitor for about 2 weeks now and it's a great monitor. Great contrast, good refresh time and a low blue light mode which I find surprisingly useful. This monitor actually changed my enjoyment of using a computer, I was always doing things on my 13\" MacBook and decided to jump the gun and get an external monitor and the first thing I thought after the first day of using it was \"why didn't I get this sooner\"? The reason why I got this monitor and might help you decide is: -It's a VA panel, I like the contrast it gives, and I also LIKE how the viewing angle is a bit less than an IPS panel, it's like having an included privacy filter, although viewing angles are good. -It has HDMI input, built in speakers, but more importantly a built in 3.5mm headphone jack -VESA mountable -21.5\" is a good size, but small form factor.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "3.0",
            "review_title": "Questionable tech support",
            "reviewed_at": "31/12/2017",
            "reviewer_name": "AlMac",
            "category": "Electronics",
            "product_name": "BenQ 9H.LE5LB.QPA 21.5-Inch Screen LED-Lit LCD Monitors",
            "review_text": "While the design was relatively pleasing, there was a large column of dead pixels in the middle of the screen. Normally that would only be a single point off, but when contacted, though swift, a BenQ tech suggested I try to fix it with multiple techniques --from wikihow of all websites!-- that would in all likelihood void the warranty. Including; striking the screen with a pen, pressing a bag of boiling water against the screen, and using third party \"screen enhancers\". The least egregious of the suggestions was to try an online dead pixel fixer (it didn't work). Now I honestly have no idea if these methods are standard or effective, or for that matter given in earnest, but the idea of striking a screen with a pen until it flashes rather alarmed me. Hopefully my next screen will not have any such problems.",
            "picture_urls": "",
            "website_name": "AMAZON"
        },
        {
            "absolute_url": "",
            "rating": "5.0",
            "review_title": "Pretty hard to find fault at that price point.",
            "reviewed_at": "10/12/2015",
            "reviewer_name": "BW022",
            "category": "Electronics",
            "product_name": "BenQ 9H.LE5LB.QPA 21.5-Inch Screen LED-Lit LCD Monitors",
            "review_text": "I use it as a workstation monitor for my tablet. The HDMI input and speakers makes it great for this purpose. There isn't much to find fault with in the unit for the price. Shipment arrived in time. Picture and colours is good and the sound is good enough for general music and work. It has 3.5mm headphone jack if you need a headset of speakers. With the HDMI, you could use it as a TV for a PVR, gaming console, etc. Stand is fine and allows tilting. Nothing really to take marks off at that price.",
            "picture_urls": "",
            "website_name": "AMAZON"
        }
    ],
    "Product URL": "https://www.amazon.ca/BenQ-9H-LE5LB-QPA-21-5-Inch-LED-Lit-Monitors/dp/B019EFMK1I/ref=lp_1233055011_1_9/143-2822029-6939659",
    "Listing URL": "https://www.amazon.ca/b/ref=s9_acss_bw_cg_pcgrid_3c1_w?node=1233055011",
    "Product Image": "https://images-na.ssl-images-amazon.com/images/I/4120pMKmBNL.jpg"
}