{
    "business_units": [
        {
            "response": [
                {
                    "reviews": [], 
                    "business_item_data": {
                        "category": "Vehicles", 
                        "sub_category": "", 
                        "original_price": "No Info", 
                        "specifications": "", 
                        "website_name": "AMAZON", 
                        "availability": [], 
                        "picture_urls": "https://images-na.ssl-images-amazon.com/images/I/41kIV4e+NoL.jpg", 
                        "business_type": "", 
                        "name": "1995 Volkswagen EuroVan Camper", 
                        "absolute_url": "https://www.amazon.com/Volkswagen-1995-EuroVan-Camper/dp/B010S4V3TO/ref=sr_1_1/146-7813721-9552330?s=vehicles&ie=UTF8&qid=1530119854&sr=1-1&refinements=p_4%3AVolkswagen", 
                        "description": "", 
                        "sale_price": "No Info"
                    }
                }
            ], 
            "scrapping_website_url": "https://www.amazon.com/Volkswagen-1995-EuroVan-Camper/dp/B010S4V3TO/ref=sr_1_1/146-7813721-9552330?s=vehicles&ie=UTF8&qid=1530119854&sr=1-1&refinements=p_4%3AVolkswagen", 
            "scrapping_website_name": "amazon.com"
        }
    ]
}{
    "business_units": [
        {
            "response": [
                {
                    "reviews": [], 
                    "business_item_data": {
                        "category": "Vehicles", 
                        "sub_category": "", 
                        "original_price": "$6,625.00", 
                        "specifications": "", 
                        "website_name": "AMAZON", 
                        "availability": [], 
                        "picture_urls": "https://images-na.ssl-images-amazon.com/images/I/41uD5NLX9rL.jpg", 
                        "business_type": "", 
                        "name": "2008 Volkswagen Jetta Wolfsburg\n\n        4-Door DSG PZEV, Salsa Red", 
                        "absolute_url": "https://www.amazon.com/Volkswagen-Jetta-Wolfsburg-4-Door-Salsa/dp/B011CG20Q2/ref=sr_1_2/146-7813721-9552330?s=vehicles&ie=UTF8&qid=1530119854&sr=1-2&refinements=p_4%3AVolkswagen", 
                        "description": "\n                \n                    \n                    \n                        \n                            Low entry price; safety features including available rear thorax air bags; styling and performance (GLI); cargo space (SportWagen).For 2008, a new SportWagen line of wagon models joins the Volkswagen Jetta lineup.The 2.0T four-cylinder engine is no longer offered on the Jetta line, only on the performance-oriented GLI model, but the Jetta's 2.5L five-cylinder engine now gets a 20-horsepower boost in power, to 170 horsepower. The top-of-the-range SEL model is now offered only with an automatic transmission, and Climatronic climate control and leather upholstery are no longer standard on the SEL or the GLI. A power recline feature for the driver's seat is now standard through the Jetta line.For both models Laser Blue is a new color, replaces Shadow Blue in the Jetta's color palette. Wheat Beige has been dropped.The 2008 Volkswagen Jetta comes well-equipped and value-priced for those who want a small but roomy sedan or wagon, while the GLI model is a sophisticated sport sedan that also has strong value-for-money appeal. The Jetta and GLI line is also a safety standout, as one of only a few compact sedans and wagons at any price to offer available side-thorax air bags for rear-seat occupants. With the addition of the new SportWagen body style, small families should look to it as a more efficient alternative to sport-utility vehicles.The Volkswagen Jetta sedan comes in three different models for 2008: S, SE, and SEL. The entire line is powered by a 170-horsepower, 2.5L five-cylinder engine, matched either with a five-speed manual gearbox or with a six-speed automatic transmission with Tiptronic and sport mode. Top-of-the-range SEL models only offer the automatic.The new SportWagen boasts a surprising amount of cargo space. With the back seat up, there's 32.8 cubic feet of space, but with it folded forward the cargo area expands to nearly 67 cubic feet. An optional fold-flat front passenger seat provides additional cargo space.Then there's also the GLI, a performance-oriented sports-sedan model that's powered by a 2.0L turbocharged four-cylinder engine making 200 horsepower and 207 lb-ft of torque. The GLI also includes a distinctive honeycomb grille, lower-body trim, red brake calipers, large round taillights, dual stainless exhaust tips, special sport seats, an F1-style, flat-bottom steering wheel, and aluminum interior trim.The Jetta sedan can accelerate from zero to 60 mph in 8.2 seconds with the manual transmission, but the GLI can dash to 60 in only 6.9 seconds. Both engines attain 29 mpg in the EPA highway estimate.On both models, front thorax-protecting side air bags are standard, along with full-length side-curtain bags. Side thorax bags for rear occupants are optional. All Jettas and GLIs also include anti-lock brakes with engine braking assist, and an electronic differential lock for improved traction. SE, SEL, and GTI models get standard electronic stability control.All Jettas come with air conditioning, cruise control, a CD sound system, eight-way adjustable front seats, and tilt/telescopic steering standard. Top SEL models add big 17-inch alloy wheels, heated front seats, a sunroof, and a ten-speaker sound system with six-disc changer. Top options include a navigation system and a sport styling kit that gives the Jetta a high-performance look. The same package is available on the GLI, along with a special rear wing spoiler and front lip spoiler\n                        \n                        \n                    \n                \n            \n        \n        \n    ", 
                        "sale_price": "\n            \n                \n                    $5,850.00\n                "
                    }
                }
            ], 
            "scrapping_website_url": "https://www.amazon.com/Volkswagen-Jetta-Wolfsburg-4-Door-Salsa/dp/B011CG20Q2/ref=sr_1_2/146-7813721-9552330?s=vehicles&ie=UTF8&qid=1530119854&sr=1-2&refinements=p_4%3AVolkswagen", 
            "scrapping_website_name": "amazon.com"
        }
    ]
}